{
  "status": "success",
  "data": {
    "azkar": {
      "title_main_urdu": "صبح، شام اور رات کے مسنون اَذکار و دعائیں",
      "introduction_note": "یہ مواد دی گئی اصل عبارت کے مطابق ہے اور اسے کسی بھی قسم کی تبدیلی سے پاک رکھا گیا ہے۔",
      "sections": [
        {
          "id": "morning_adhkar_part_1",
          "original_section_number": 1,
          "title_urdu": "صبح کے مسنون اَذکار (حصہ اول)",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "azkar_be_baha_ajr",
              "title_urdu": "بیش بہا اجر و ثواب",
              "arabic_text": "اللهُ أَكْبَرُ اَلْحَمْدُ لِلّٰهِ سُبْحَانَ اللهِ لَا إِلٰهَ إِلَّا اللهُ",
              "translation_urdu": "اللہ سب سے بڑا ہے سب تعریف اللہ ہی کے لئے ہے۔ اللہ پاک ہے۔ اللہ کے سوا کوئی معبود نہیں۔",
              "fawaid_urdu": "حضرت ابو امامہ (رض) سے مروی ہے کہ نبی کریم ﷺ نے ارشاد فرمایا میرے نزدیک طلوع آفتاب کے وقت اللہ کا ذکر کرنا اللہ اکبر الحمد لللہ لا الہ الا اللہ اور سبحان اللہ کہنا اولاد اسماعیل (علیہ السلام) میں سے چار غلام آزاد کرنے سے زیادہ بہتر ہے اسی طرح نماز عصر سے غروب آفتاب تک اللہ کا ذکر کرنا میرے نزدیک اولاد اسماعیل (علیہ السلام) میں سے اتنے اتنے غلام آزاد کرنے سے زیادہ بہتر ہے۔ (مسند احمد 22194)",
              "title_en": "Immense Reward",
              "translation_en": "Allah is the Greatest. All praise is for Allah. Glory be to Allah. There is no deity worthy of worship except Allah.",
              "fawaid_en": "It is narrated from Abu Umamah (RA) that the Prophet ﷺ said: 'To me, remembering Allah after sunrise by saying Allahu Akbar, Alhamdulillah, La ilaha illallah, and Subhanallah is more beloved than freeing four slaves from the children of Ismail (AS). Similarly, remembering Allah from Asr prayer until sunset is more beloved to me than freeing an equal number of slaves.' (Musnad Ahmad 22194)"
            },
            {
              "point_id": "azkar_hifazat_shaitaan",
              "title_urdu": "پورا دن شیاطین سے حفاظت",
              "arabic_text": "اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ١ۚ اَلْحَیُّ الْقَیُّوْمُ١ۚ۬ لَا تَاْخُذُهٗ سِنَةٌ وَّ لَا نَوْمٌ١ؕ لَهٗ مَا فِی السَّمٰوٰتِ وَ مَا فِی الْاَرْضِ١ؕ مَنْ ذَا الَّذِیْ یَشْفَعُ عِنْدَهٗۤ اِلَّا بِاِذْنِهٖ١ؕ یَعْلَمُ مَا بَیْنَ اَیْدِیْهِمْ وَ مَا خَلْفَهُمْ١ۚ وَ لَا یُحِیْطُوْنَ بِشَیْءٍ مِّنْ عِلْمِهٖۤ اِلَّا بِمَا شَآءَ١ۚ وَسِعَ كُرْسِیُّهُ السَّمٰوٰتِ وَ الْاَرْضَ١ۚ وَ لَا یَئُوْدُهٗ حِفْظُهُمَا١ۚ وَ هُوَ الْعَلِیُّ الْعَظِیْمُ",
              "translation_urdu": "اللہ وہ ذات ہے کہ اس کے سوا کوئی معبود نہیں ،ہمیشہ زندہ رہنے والا ہے ، تمام مخلوق کا سنبھالنے والا ہے، نہ اس کو اونگھ دبا سکتی ہے اور نہ نیند(دبا سکتی ہے) اسی کے مملوک ہیں سب جو کچھ بھی آسمانوں میں (موجودات) ہیں اور جو کچھ زمین میں ہیں، ایسا کون شخص ہے جو اس کے پاس (کسی کی) سفارش کر سکے بدون اس کی اجازت کے، وہ جانتا ہے ان (موجودات) کے تمام حاضر اور غائب حالات کو اور وہ موجودات اس کے معلومات سے کسی چیز کو اپنے علم کے احاطہ میں نہیں لا سکتے، مگر جس قدر (علم دینا) وہی چاہے، اس کی کرسی (اتنی بڑی ہےکہ اس ) نے سب آسمان اور زمین کو اپنے اندر لے رکھا ہے اور اللہ تعالىٰ کو ان دونوں (آسمان اور زمین) کی حفاظت کچھ مشکل نہیں گزرتی، اور وہ ہی عالیشان اور عظیم الشان ہے۔",
              "fawaid_urdu": "جو کوئی اسے رات کو پڑھے وہ صبح تک جنات اور شیاطین سے پناہ میں رہے گا اور جو صبح کو پڑھے وہ رات تک جنات اور شیاطین سے پناہ میں رہے گا۔ (المعجم الکبیر للطبرانی 542)",
              "title_en": "Protection from Devils All Day",
              "translation_en": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
              "fawaid_en": "Whoever recites it at night will remain under Allah's protection from jinn and devils until morning, and whoever recites it in the morning will remain under Allah's protection from jinn and devils until evening. (Al-Mu'jam al-Kabir by Tabarani 542)"
            },
            {
              "point_id": "azkar_kafaayat_3_times",
              "title_urdu": "ہر چیز سے کفایت (تین مرتبہ)",
              "arabic_text": "(1)قُلْ هُوَ اللّٰهُ اَحَدٌۚ ۞ اَللّٰهُ الصَّمَدُۚ ۞ لَمْ یَلِدْ١ۙ۬ وَ لَمْ یُوْلَدْۙ ۞ وَ لَمْ یَكُنْ لَّهٗ كُفُوًا اَحَدٌ۠ ۞ (2) قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِۙ ۞ مِنْ شَرِّ مَا خَلَقَۙ ۞ وَ مِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَۙ ۞ وَ مِنْ شَرِّ النَّفّٰثٰتِ فِی الْعُقَدِۙ ۞ وَ مِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ۠ ۞ (1) قُلْ اَعُوْذُ بِرَبِّ النَّاسِۙ ۞ مَلِكِ النَّاسِۙ ۞ اِلٰهِ النَّاسِۙ ۞ مِنْ شَرِّ الْوَسْوَاسِ١ۙ۬ الْخَنَّاسِ۪ۙ ۞ الَّذِیْ یُوَسْوِسُ فِیْ صُدُوْرِ النَّاسِۙ ۞ مِنَ الْجِنَّةِ وَ النَّاسِ۠ ۞",
              "translation_urdu": "(1)تم فرماؤ: وہ اللہ ایک ہے۔اللہ بے نیاز ہے۔نہ اس نے کسی کو جنم دیا اور نہ وہ کسی سے پیدا ہوا۔اور کوئی اس کے برابر نہیں ۔(2) تم فرماؤ: میں صبح کے رب کی پناہ لیتا ہوں ۔اس کی تمام مخلوق کے شر سے۔اورسخت اندھیری رات کے شر سے جب وہ چھاجائے۔اور ان عورتوں کے شر سے جو گرہوں میں پھونکیں مارتی ہیں ۔اور حسد والے کے شر سے جب وہ حسد کرے۔ (3)تم کہو: میں تمام لوگوں کے رب کی پناہ لیتا ہوں ۔تمام لوگوں کا بادشاہ ۔تمام لوگوں کا معبود ۔باربار وسوسے ڈالنے والے، چھپ جانے والے کے شر سے(پناہ لیتا ہوں )۔وہ جو لوگوں کے دلوں میں وسوسے ڈالتا ہے۔جنوں اورانسانوں میں سے۔",
              "fawaid_urdu": "عبداللہ بن خبیب ؓ کہتے ہیں کہ ہم رسول اللہ ﷺ کو بارش کی ایک سخت اندھیری رات میں نماز پڑھانے کے لیے تلاش کرنے نکلے، تو ہم نے آپ کو پا لیا، آپ نے فرمایا: کیا تم لوگوں نے نماز پڑھ لی؟ ہم نے کوئی جواب نہیں دیا، آپ نے فرمایا: کچھ کہو اس پر بھی ہم نے کچھ نہیں کہا، آپ نے پھر فرمایا: کچھ کہو (پھر بھی) ہم نے کچھ نہیں کہا، پھر آپ نے فرمایا: کچھ تو کہو میں نے عرض کیا: اللہ کے رسول! کیا کہوں؟ آپ نے فرمایا: قل هو الله أحد اور معوذتین تین مرتبہ صبح کے وقت، اور تین مرتبہ شام کے وقت کہہ لیا کرو تو یہ تمہیں (ہر طرح کی پریشانیوں سے بچاؤ کے لیے) کافی ہوں گی۔(ابوداؤد:5082)",
              "title_en": "Sufficiency from Everything (Three Times)",
              "translation_en": "(1) Say: He is Allah, the One. Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent. (2) Say: I seek refuge in the Lord of daybreak, from the evil of that which He created, and from the evil of darkness when it settles, and from the evil of the blowers in knots, and from the evil of an envier when he envies. (3) Say: I seek refuge in the Lord of mankind, the Sovereign of mankind, the God of mankind, from the evil of the retreating whisperer - who whispers in the breasts of mankind - from among the jinn and mankind.",
              "fawaid_en": "Abdullah bin Khubaib (RA) narrates: 'We went out on a dark rainy night searching for the Messenger of Allah ﷺ to lead us in prayer. When we found him, he said: \"Recite Qul Huwa Allahu Ahad and the Mu'awwidhat ayn (the last two Surahs) three times in the morning and three times in the evening, and they will suffice you for everything.\"' (Abu Dawud: 5082)"
            },
            {
              "point_id": "azkar_mizan_heavy_3_times",
              "title_urdu": "میزان میں بھاری کلمات (تین مرتبہ)",
              "arabic_text": "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
              "translation_urdu": "پاک ہے اللہ کی ذات اور اُسی کیلئے ساری تعریف ہے،اُس کی مخلوق کی تعداد کے برابر،اُس کی ذات کی خوشنودی کے برابر،اُس کے عرش کے وزن کے برابر،اور اُس کےکلمات ( صفات) کی سیاہی کے برابر۔",
              "fawaid_urdu": "اُمّ المؤمنین حضرت جُویریہ فرماتی ہیں کہ ایک دفعہ نبی کریم ﷺ اُن کے پاس سے صبح سویرے نماز کیلئے تشریف لے گئے اور وہ مُصلّے پر بیٹھی ہوئی تھیں ،پھر سورج کے نکلنے اور روشن ہوجانے کے بعد تشریف لائے تو دیکھا کہ میں ابھی تک مُصلّےپر بیٹھی ہوئی ہوں،آپ ﷺ نے فرمایا تم ابھی تک اُسی طرح بیٹھی ہوئی ہو؟ میں نے کہا : جی ہاں!آپ ﷺ نے اِرشاد فرمایا:میں نے تمہارے پاس سے جانے کے بعد (مذکورہ بالا)چار کلمات تین مرتبہ کہے ہیں اگر اُن کو تمہارے آج کے تمام اَذکار کے مقابلے میں وزن کیا جائے تو وہ کلمات بھاری ہوجائیں گے۔(مسلم:2726)",
              "title_en": "Heavy Words in the Scale (Three Times)",
              "translation_en": "Glory be to Allah and praise be to Him, equal to the number of His creation, equal to the pleasure of His Self, equal to the weight of His Throne, and equal to the ink of His words.",
              "fawaid_en": "Umm al-Mu'minin Juwayriyah (RA) narrates that once the Prophet ﷺ left her early in the morning for prayer while she was sitting on her prayer mat. When he returned after sunrise, she was still sitting there. He ﷺ said: 'After leaving you, I recited these four phrases three times. If they were to be weighed against all your dhikr today, these words would outweigh them.' (Muslim: 2726)"
            }
          ],
          "title_en": "Morning Adhkar (Part 1)"
        },
        {
          "id": "morning_adhkar_part_2",
          "original_section_number": 2,
          "title_urdu": "صبح کے مسنون اَذکار (حصہ دوم)",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "azkar_aafat_se_bachao_3_times",
              "title_urdu": "ناگہانی آفات اور نقصان سے بچاؤ (تین مرتبہ)",
              "arabic_text": "بِسْمِ اللهِ الَّذِيْ لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَ لَا فِي السَّمَاءِ ، وَهُوَ السَّمِيْعُ الْعَلِيْمُ",
              "translation_urdu": "اللہ کے نام سے ابتداء کرتا ہوں جس کے نام کے ساتھ کوئی چیز زمین و آسمان میں نقصان نہیں پہنچاسکتی ، اور وہ سننے والا اور جاننے والا ہے۔",
              "fawaid_urdu": "اِن کلمات کے پڑھنے والے کے بارے میں حدیث میں یہ فضیلت بیا ن کی گئی ہےکہ ”لَمْ يَضُرَّهُ شَيْءٌ فِي ذَلِكَ الْيَوْمِ أَوْ فِي تِلْكَ اللَّيْلَةِ“ اُسے اُس دن یا اُس رات کوئی نقصان نہیں پہنچے گا۔(مسند احمد:474) ایک روایت میں ہے”لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُمْسِيَ“ شام تک اُسے کوئی ناگہانی آفت کا سامنا نہیں ہوگا۔(ابوداؤد:5088) حدیث کے راوی حضرت اَبان بن عُثمان (رض) کے جسم کے ایک حصہ میں فالج گرا ہوا تھا ،اُنہوں نے جب اِس حدیث کو بیان کیا تو سننے والوں میں سے کسی شخص نے اُن کو سوالیہ نگاہوں سے دیکھا جس سے اُس کا مقصود یہ تھا کہ جب آپ اِس دُعاء کو پڑھتے رہے ہیں تو پھر آپ کے جسم میں فالج کیسے گرا ؟ حضرت اَبان (رض) نے فرمایا کہ حدیث میں کوئی شک نہیں ،حدیث یقیناً اُسی طرح ہے جیسے میں نے بیان کی ہے، البتہ تقدیر کے مطابق جس دن مجھ پر اِس فالج کا حملہ ہوا ہے اُس دن میں اِس دُعاء کو پڑھنا بھول گیا تھا۔(ترمذی:3388)",
              "title_en": "Protection from Sudden Calamities and Harm (Three Times)",
              "translation_en": "In the name of Allah with whose name nothing is harmed on earth nor in the heavens, and He is the All-Hearing, the All-Knowing.",
              "fawaid_en": "The virtue mentioned in hadith for reciting these words is: 'Nothing will harm him on that day or that night.' (Musnad Ahmad: 474) In another narration: 'No sudden calamity will befall him until evening.' (Abu Dawud: 5088) The narrator Aban bin Uthman (RA) had paralysis in part of his body. When questioned, he explained that on the day paralysis struck him, he had forgotten to recite this dua. (Tirmidhi: 3388)"
            },
            {
              "point_id": "azkar_alllah_ki_maiyat",
              "title_urdu": "اللہ تعالیٰ کی معیت",
              "arabic_text": "اَللّٰهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ الْمَصِيْرُ",
              "translation_urdu": "اے اللہ ! تیرے نام ہی سے ہم نے صبح کی اور تیرے ہی نام سے ہم نے شام کی ،تیرے ہی نام سے ہم جیتے ہیں اور تیرے ہی نام سے ہم مرتے ہیں اور تیری ہی جانب ہمیں لوٹ کر آنا ہے۔",
              "fawaid_urdu": "نبی کریم ﷺ صبح کو یہ دعاء پڑھا کرتے تھے۔(ترمذی:3391)",
              "title_en": "Allah's Company",
              "translation_en": "O Allah, with Your name we have entered the morning and with Your name we enter the evening, with Your name we live and with Your name we die, and to You is the final return.",
              "fawaid_en": "The Prophet ﷺ used to recite this supplication in the morning. (Tirmidhi: 3391)"
            },
            {
              "point_id": "azkar_fitrat_par_istiqamat_morning",
              "title_urdu": "اخلاص اور دینِ فطرت پر استقامت",
              "arabic_text": "أَصْبَحْنَا عَلىٰ فِطْرَةِ الْإِسْلَامِ وَكَلِمَةِ الْإِخْلَاصِ، وَعَلىٰ دِيْنِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلىٰ مِلَّةِ أَبِيْنَا إِبْرَاهِيْمَ حَنِيْفًا مُّسْلِمًا، وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
              "translation_urdu": "ہم نے اِسلام کی فطرت اور اِخلاص کے کلمہ پر اور اپنے نبی حضرت محمّدﷺ کے دین پر اور اپنے والد حضرت ابراہیم علیہ السلام کے ملّت پر صبح کی جو سیدھے سادے مسلمان تھے اور وہ کبھی شرک کرنے والوں میں نہ تھے۔",
              "fawaid_urdu": "نبی کریمﷺصبح کو یہ دُعاء پڑھا کرتے تھے۔(سنن کبریٰ نسائی:9745)",
              "title_en": "Sincerity and Steadfastness upon the Natural Religion",
              "translation_en": "We have entered the morning upon the natural religion of Islam, and upon the word of sincerity, and upon the religion of our Prophet Muhammad ﷺ, and upon the way of our father Ibrahim, who was upright and Muslim, and he was not among the polytheists.",
              "fawaid_en": "The Prophet ﷺ used to recite this supplication in the morning. (Sunan al-Kubra by Nasa'i: 9745)"
            },
            {
              "point_id": "azkar_ilm_rizq_amal",
              "title_urdu": "نافع علم، پاکیزہ رزق اور مقبول عمل کی دعا",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَسْأَلُك عِلْمًا نَّافِعًا وَّرِزْقًا طَيِّبًا وَّعَمَلًا مُّتَقَبَّلًا",
              "translation_urdu": "اے اللہ!میں تجھ سے نفع دینے والا علم،پاکیزہ رزق اور قبول ہونے والے عمل کا سوال کرتا ہوں۔",
              "fawaid_urdu": "حدیث میں ہے:نبی کریمﷺصبح کی نماز کا سلام پھیرتے تو مذکورہ بالا دعاء پڑھا کرتے تھے۔(شعب الایمان :1645)",
              "title_en": "Supplication for Beneficial Knowledge, Pure Provision, and Accepted Deeds",
              "translation_en": "O Allah, I ask You for beneficial knowledge, pure provision, and accepted deeds.",
              "fawaid_en": "In hadith: The Prophet ﷺ used to recite this supplication after giving salaam from the morning prayer. (Shu'ab al-Iman: 1645)"
            },
            {
              "point_id": "azkar_nafs_shaitaan_se_panah",
              "title_urdu": "نفس اور شیطان کے شر سے پناہ",
              "arabic_text": "اَللّٰهُمَّ فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَّمَلِيْكَهُ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ",
              "translation_urdu": "اے اللہ!اے آسمانوں اور زمین کو پیدا کرنے والے،غیب و حاضر کی تمام باتوں کو جاننے والے،ہر چیز کےپروردگار اور مالک! میں گواہی دیتا ہوں کہ تیرے سوا کوئی معبود نہیں ،میں تیری پناہ میں آتا ہوں اپنے نفس کے شر سے اور شیطان کے شر اور اُس کے شرک(میں مبتلاء کرنے)سے۔",
              "fawaid_urdu": "یہ وہ مبارک دعاء کے کلمات ہیں جونبی کریم ﷺ نےصبح ، شام اور بستر پر جاتے ہوئے پڑھنے کی تلقین کی ہے۔(ابوداؤد:5067)",
              "title_en": "Refuge from the Evil of the Self and Satan",
              "translation_en": "O Allah, Creator of the heavens and the earth, Knower of the unseen and the witnessed, Lord and Sovereign of everything, I bear witness that there is no deity except You. I seek refuge in You from the evil of my soul, and from the evil of Satan and his polytheism.",
              "fawaid_en": "These are the blessed words of supplication that the Prophet ﷺ instructed to recite in the morning, evening, and when going to bed. (Abu Dawud: 5067)"
            },
            {
              "point_id": "azkar_poore_din_ki_khair",
              "title_urdu": "پورے دن کی خیر و بھلائی کی دعا",
              "arabic_text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلّٰهِ وَالْحَمْدُ لِلّٰهِ وَلَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ المُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ أَسْأَلُكَ خَيْرَ هٰذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ وَ أَعُوذُ بِكَ مِنْ شَرِّ هٰذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ وَ أَعُوذُ بِكَ مِنَ الكَسَلِ وَ سُوءِ الكِبَرِ وَ أَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ وَعَذَابِ القَبْرِ",
              "translation_urdu": "ہم نے اور ساری سلطنت نے اللہ کیلئے صبح کی اور اللہ کیلئے ساری تعریفیں ہیں اور اللہ کے سوا کوئی معبود نہیں ،وہ اکیلا ہے ،اُس کا کوئی شریک نہیں ، اُسی کیلئے بادشاہت ہے اور اُسی کیلئے ساری تعریف ہے،اور وہ ہر چیز پر قدرت رکھتا ہے ،اے اللہ ! میں تجھ سے اِس دن کی اور اِس کے بعد آنے والےدنوں کی خیر و بھلائی کا سوال کرتا ہوں اور میں اِس دن اور اس کے بعد آنے والے دنوں کے شر سےتیری پناہ چاہتا ہوں، اور میں سستی ،بُرے بڑھاپے سےتیری پناہ چاہتاہوں اور میں جہنم کے اور قبر کے عذاب سے تیری پناہ چاہتا ہوں۔",
              "fawaid_urdu": "نبی کریم ﷺ صبح کو یہ دُعاء پڑھا کرتے تھے۔(ترمذی:3390)",
              "title_en": "Supplication for Goodness Throughout the Day",
              "translation_en": "We have entered the morning and the dominion belongs to Allah, and all praise belongs to Allah. There is no deity except Allah alone, without partner. His is the dominion and His is the praise, and He is over all things competent. O Allah, I ask You for the good of this day and the good of what follows it, and I seek refuge in You from the evil of this day and the evil of what follows it. And I seek refuge in You from laziness and the misery of old age, and I seek refuge in You from the punishment of the Fire and the punishment of the grave.",
              "fawaid_en": "The Prophet ﷺ used to recite this supplication in the morning. (Tirmidhi: 3390)"
            },
            {
              "point_id": "azkar_jannat_ka_parwana_3_times",
              "title_urdu": "اللہ کی رضا اور جنت کا پروانہ (تین مرتبہ)",
              "arabic_text": "رَضِيْتُ بِاللهِ رَبًّا وَّ بِالْإِسْلَامِ دِيْنًا وَّ بِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
              "translation_urdu": "میں اللہ کے پروردگار ہونے پر ،اِسلام کے دین ہونے پر اور حضرت محمد ﷺ کے نبی ہونے پر راضی ہوں۔",
              "fawaid_urdu": "اِس کلمہ کی فضیلت حدیث میں یہ ذکر کی گئی ہے: ”كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ“ یعنی اللہ تبارک و تعالیٰ نے اپنے ذمّہ لے لیا ہے کہ اِن کلمات کے پڑھنے والے کو قیامت کے دن راضی کردیں گے۔(مسند احمد:18967) ایک روایت میں ہے”مَنْ قَالَهُنَّ دَخَلَ الْجَنَّةَ“جس نے یہ کلمات کہے وہ جنّت میں داخل ہوگا۔(مسند احمد:11102) ایک اور روایت میں اِن کلمات کے پڑھنے والے کے بارے میں آپ ﷺنے فرمایا: ”ذَاقَ طَعْمَ الْإِيْمَانِ“ یعنی اُسے ایمان کا ذائقہ نصیب ہوگا۔(مسلم:34)",
              "title_en": "Allah's Pleasure and the Pass to Paradise (Three Times)",
              "translation_en": "I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad ﷺ as my Prophet.",
              "fawaid_en": "The virtue of this phrase mentioned in hadith is: 'It becomes a duty upon Allah to please him on the Day of Resurrection.' (Musnad Ahmad: 18967) In another narration: 'Whoever says them will enter Paradise.' (Musnad Ahmad: 11102) In yet another narration, the Prophet ﷺ said: 'He has tasted the sweetness of faith.' (Muslim: 34)"
            },
            {
              "point_id": "azkar_aifiyat_pooray_badan_3_times",
              "title_urdu": "بدنی عافیت کی دعا اور کفروفقر سے حفاظت (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ عَافِنِيْ فِي بَدَنِيْ، اَللّٰهُمَّ عَافِنِيْ فِي سَمْعِيْ، اَللّٰهُمَّ عَافِنِيْ فِي بَصَرِيْ، لَا إِلٰهَ إِلَّا أَنْتَ اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلٰهَ إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ !میرے جسم میں عافیت نصیب فرما۔اے اللہ !میرےکانوں میں عافیت نصیب فرما۔اے اللہ !میری آنکھ میں عافیت نصیب فرما۔تیرے سوا کوئی معبود نہیں ۔اے اللہ! کفر میں مبتلاء ہونے اور فقر کا شکار ہونے سےمیں تیری پناہ چاہتا ہوں، اے اللہ! میں قبر کے عذاب سے تیری پناہ چاہتا ہوں،تیرے سوا کوئی معبود نہیں۔",
              "fawaid_urdu": "نبی کریمﷺصبح شام اِس دُعاء کو پڑھا کرتے تھے۔(ابوداؤد:5090)",
              "title_en": "Prophetic Supplication",
              "translation_en": "O Allah, grant me wellbeing in my body. O Allah, grant me wellbeing in my hearing. O Allah, grant me wellbeing in my sight. There is no deity except You. O Allah, I seek refuge in You from disbelief and poverty. O Allah, I seek refuge in You from the punishment of the grave. There is no deity except You.",
              "fawaid_en": "The Prophet ﷺ used to recite this supplication morning and evening. (Abu Dawud: 5090)"
            },
            {
              "point_id": "azkar_islah_e_ahwaal",
              "title_urdu": "تمام احوال کی اصلاح",
              "arabic_text": "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ أَسْتَغِيْثُ، أَصْلِحْ لِيْ شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلىٰ نَفْسِيْ طَرَفَةَ عَيْنٍ",
              "translation_urdu": "اے وہ ذات جو سدا زندہ ہے اور ساری کائنات سنبھالے ہوئے ہے!میں تیری رحمت ہی سے فریاد طلب کرتا ہوں ،میرے تمام اَحوال کی اِصلاح فرما اور ایک پلک جھپکنے کے برابر بھی مجھے میرےنفس کے حوالہ نہ فرما۔",
              "fawaid_urdu": "نبی کریم ﷺ نے اپنی بیٹی حضرت فاطمہ (رض) کویہ کلمات سکھائے تھے اور اُنہیں اِن کلمات کو صبح شام پڑھنے کی وصیت کی تھی۔(مستدرکِ حاکم:2000) حضرت انس (رض) فرماتے ہیں کہ ہم (فجر کی نماز کے بعد) نبی کریم ﷺ کے ساتھ مسجد میں تھے یہاں تک کہ سورج طلوع ہوگیا ، ہم آپ ﷺ کے ساتھ نکلے،آپ ﷺ نے حضرت فاطمہ (رض) کے پاس تشریف لے گئے تو دیکھا وہ سورہی ہیں ،آپ ﷺ نے اِرشاد فرمایا:”مَا يُنِيْمُكِ فِيْ هٰذِهِ السَّاعَةِ؟“اِس وقت کیوں سورہی ہو؟ اُنہوں نے فرمایا: یا رسول اللہ! مجھے کل رات سے بخار ہے،آپ ﷺ نےارشاد فرمایا: وہ دُعا ء کیوں نہیں پڑھی جو میں نے سکھائی تھی ؟حضرت فاطمہ (رض) نے فرمایا : میں بھول گئی ہوں، آپ ﷺ نے اُنہیں اِن کلمات کی تلقین فرمائی ۔(طبرانی اوسط:3565) ایک روایت میں ہے کہ نبی کریم ﷺ کو جب کوئی تکلیف پیش آتی تو آپ یہ کلمہ پڑھا کرتے تھے:”يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ“ اے وہ ذات جو سدا زندہ ہے اور ساری کائنات سنبھالے ہوئے ہے!تیری رحمت ہی سے فریاد طلب کرتا ہوں ۔(ترمذی:3524)",
              "title_en": "Prophetic Supplication",
              "translation_en": "O Ever-Living, O Sustainer, I seek assistance through Your mercy. Rectify all my affairs for me, and do not leave me to myself even for the blink of an eye.",
              "fawaid_en": "The Prophet ﷺ taught these words to his daughter Fatimah (RA) and advised her to recite them morning and evening. (Mustadrak al-Hakim: 2000) Anas (RA) narrates that they were with the Prophet ﷺ in the mosque after Fajr until sunrise. The Prophet ﷺ went to Fatimah (RA) and found her sleeping. He said: 'What makes you sleep at this hour?' She said: 'O Messenger of Allah, I have had a fever since last night.' He ﷺ asked: 'Why didn't you recite the supplication I taught you?' She said: 'I forgot.' The Prophet ﷺ then taught her these words. (Tabarani Awsat: 3565) In another narration, when the Prophet ﷺ faced any difficulty, he would recite: 'O Ever-Living, O Sustainer, I seek assistance through Your mercy.' (Tirmidhi: 3524)"
            },
            {
              "point_id": "azkar_sayyad_ul_istighfar_morning",
              "title_urdu": "جنت اور شہادت کا پروانہ",
              "arabic_text": "اَللّٰهُمَّ أَنْتَ رَبِّي لاَ إِلٰهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأَبُوْءُ لَكَ بِذَنْبِيْ فَاغْفِرْ لِيْ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ ! آپ ہی میرے پالنہار ہیں ، آپ کے سوا کوئی عبادت کے لائق نہیں ہے۔ آپ ہی نے مجھے پیدا کیا اور میں آپ کا حقیقی غلام ہوں ، اور جہاں تک میرے بس میں ہے مَیں آپ سے کئے ہوئے عہد اور وعدے پر قائم ہوں ، آپ کی پناہ چاہتا ہوں ان تمام بُرے کاموں کے وبال سے جو مَیں نے کئے ہیں، میں آپ کے سامنے آپ کی ان نعمتوں کا اقرار کرتا ہوں جو مجھ پر ہیں ، اور مجھے اعتراف ہے اپنے گناہ کا، اس لئے میرے گناہوں کو معاف کر دیجئے، کیونکہ آپ کے سوا کوئی گناہوں کو نہیں بخشتا۔",
              "fawaid_urdu": "یہ سیّد الاِستغفار کے کلمات ہیں، جس کو حدیث کے اندر صبح شام پڑھنے کی تلقین کی گئی ہے اور اِس کی فضیلت حدیث میں یہ ذکر کی گئی ہے: ”مَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا،فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ“ یعنی جس نے پورے یقین کے ساتھ یہ کلمات دن کو پڑھے اور شام سے پہلے اُس کی موت آگئی تو وہ اہلِ جنّت میں سے ہے۔(بخاری:6306) ایک روایت میں ہے : ”فَإِنْ مَاتَ مِنْ يَوْمِهِ مَاتَ شَهِيدًا“ اِن کلمات کو کہنے والا اُس دن مرگیا تو شہادت کی موت مرے گا۔(ابن سنی :43)",
              "title_en": "Prophetic Supplication",
              "translation_en": "O Allah, You are my Lord. There is no deity except You. You created me and I am Your servant, and I am keeping my covenant and promise to You as much as I can. I seek refuge in You from the evil of what I have done. I acknowledge Your blessings upon me and I acknowledge my sins. So forgive me, for indeed none can forgive sins except You.",
              "fawaid_en": "These are the words of Sayyidul-Istighfar (the Master of Seeking Forgiveness), which hadith instructs to recite morning and evening. The virtue mentioned in hadith is: 'Whoever says it during the day with firm conviction and dies before evening will be among the people of Paradise.' (Bukhari: 6306) In another narration: 'If he dies that day, he will die as a martyr.' (Ibn al-Sunni: 43)"
            },
            {
              "point_id": "azkar_aifiyat_dunya_akhira",
              "title_urdu": "ہر طرح کی عافیت کی دعا",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اَللّٰهُمَّ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِيْنِيْ وَ دُنْيَايَ وَأَهْلِي وَمَالِيْ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، وَاحْفَظْنِي مِنْم بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِيْ، وَعَنْ شِمَالِيْ، وَمِنْ فَوْقِيْ، وَ أَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
              "translation_urdu": "اے اللہ! میں تجھ سے دنیا و آخرت میں عفو و درگزر اور عافیت کا سوال کرتا ہوں،اے اللہ! میں تجھ سے اپنے دین ، دنیا ،اہل اور مال میں عفو و درگزر اور عافیت کا سوال کرتاہوں۔اے اللہ! میرے عیوب کی پردہ پوشی فرما،میرے خوف کو اَمن میں تبدیل فرما اور حفاظت فرمامیرے سامنےسے،میرے پیچھے سے،میرے دائیں جانب سے اور میری بائیں جانب سے اور میرے اوپر سے ، اور میں تیری عظمت کی پناہ چاہتا ہوں اِس بات سے کہ میں اپنے نیچے کی جانب سے ہلاک کیا جاؤں۔",
              "fawaid_urdu": "مذکورہ بالا کلمات کو صبح و شام اہتمام سے پڑھنا چاہیئے۔ حدیث میں آتا ہے:”لَمْ يَكُنْ رَسُولُ اللهِ ﷺيَ دَعُ هَؤُلَاءِ الدَّعَوَاتِ حِينَ يُمْسِي، وَحِينَ يُصْبِحُ“نبی کریم ﷺ صبح شام اِن کلمات کو کبھی ترک نہیں فرمایا کرتے تھے۔(ابن ماجہ:3871)",
              "title_en": "Prophetic Supplication",
              "translation_en": "O Allah, I ask You for forgiveness and wellbeing in this world and the Hereafter. O Allah, I ask You for forgiveness and wellbeing in my religion, my worldly affairs, my family, and my wealth. O Allah, conceal my faults, calm my fears, and protect me from the front, from behind, from my right, from my left, and from above. And I seek refuge in Your Greatness from being struck down from beneath me.",
              "fawaid_en": "These words should be recited with care morning and evening. It is mentioned in hadith: 'The Messenger of Allah ﷺ never abandoned these supplications in the morning and evening.' (Ibn Majah: 3871)"
            },
            {
              "point_id": "azkar_khalq_ke_shar_se_hifazat",
              "title_urdu": "ہر قسم کے نقصان سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
              "translation_urdu": "میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں اُس کی پیدا کردہ تمام چیزوں کے شر سے۔",
              "fawaid_urdu": "اِن کلمات کے پڑھنے والے کوکوئی مُوذی چیز نہیں کاٹے گی۔(ترمذی:3604) نبی کریم ﷺکے پاس ایک شخص کو لایا گیا گیا جسے بچھو نے کاٹ لیا تھا ،آپ ﷺنے فرمایا اگر یہ مذکورہ کلمات پڑھ لیتا تو اِسے بچھو نقصان نہیں پہنچاتا ۔(ابوداؤد:3899) حدیث کے راوی حضرت سہیل بن صالح (رض) فرماتے ہیں کہ ہمارے گھر والوں نے یہ کلمات سیکھ لیے تھے اور روزانہ پڑھتے تھے،ایک دفعہ گھر میں کسی باندی کو بچھو نے ڈس لیا تو اِن کلمات کی برکت سے اُسے کوئی تکلیف تک نہیں ہوئی ۔(ترمذی:3604) اگر کسی جگہ اتر کر مذکورہ کلمات پڑھ لیے جائیں تو وہاں سے کُوچ کرنے تک کوئی نقصان نہیں پہنچے گا۔(الدعوات الکبیر:470)",
              "title_en": "Prophetic Supplication",
              "translation_en": "I seek refuge in the perfect words of Allah from the evil of what He has created.",
              "fawaid_en": "Whoever recites these words will not be harmed by any harmful creature. (Tirmidhi: 3604) A man who was stung by a scorpion was brought to the Prophet ﷺ. He ﷺ said: 'If he had recited these words, the scorpion would not have harmed him.' (Abu Dawud: 3899) The narrator Suhail bin Salih (RA) says that his family learned these words and recited them daily. Once a servant girl was stung by a scorpion, but due to the blessing of these words, she felt no pain. (Tirmidhi: 3604) If one recites these words upon arriving at a place, no harm will come until departing from there. (Al-Da'awat al-Kabir: 470)"
            },
            {
              "point_id": "azkar_seven_great_virtues_10_times",
              "title_urdu": "سات عظیم فضیلتیں (دس مرتبہ)",
              "arabic_text": "لَا إِلٰهَ إِلَّا اللهُ، وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، يُحْيِيْ وَيُمِيْتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلىٰ كُلِّ شَيْءٍ قَدِيْرٌ",
              "translation_urdu": "اللہ کے سوا کوئی معبود نہیں ،وہ اکیلا ہے ،اُس کا کوئی شریک نہیں ،اُسی کیلئے بادشاہت ہےاور اُسی کیلئے تعریف ہے، ،وہی زندہ کرتا اور وہی موت دیتا ہے، اُسی کے ہاتھ میں ساری بھلائی ہے اور وہ ہر چیز پر قادر ہے۔",
              "fawaid_urdu": "جو شخص مغرب اور فجر کی نماز بعد رخ پھیرنے اور پاؤں موڑنے سے پہلے دس مرتبہ یہ کلمات پڑھ لےاُس کیلئے ہر کلمہ کے بدلہ میں دس نیکیاں لکھی جاتی ہیں ، دس گناہ مٹادیے جاتے ہیں اور دس درجے بلند کیے جاتے ہیں اور یہ کلمات اُس کیلئےہر ناپسندیدہ چیز اور شیطانِ مردود سے بچاؤ کا ذریعہ بن جاتے ہیں اور شرک کے علاوہ کسی گناہ کی مجال نہیں ہوتی کہ اُس کو ہلاک کرڈالے ، اور وہ (کلمات پڑھنے والا )لوگوں میں عمل کے اعتبار سے سب سے افضل ہوتاہے، سوائے اُس شخص کے جو اُس سے آگے بڑھ جائے یعنی اُس سے زیادہ یہ کلمات کہے۔(مسند احمد :17990) خلاصہ یہ ہے کہ اِس کلمے کو دس مرتبہ پڑھنے سے سات عظیم فضیلتیں حاصل ہوتی ہیں : (1)سو نیکیاں ۔ (2)سو گناہ معاف ۔(3)سودرجات بلند۔ (4)ہر قسم کی آفات سے حفاظت۔ (5)شیطان مردود سے حفاظت۔ (6)سوائے شرک کے کوئی گناہ اُس کو ہلاک نہ کر سکے گا ۔(7)وہ اُس دن سب سے افضل عمل کرنے والا ہوگا ۔ سوائے اُس شخص کے جو اُس سے بھی زیادہ پڑھے۔",
              "title_en": "Prophetic Supplication",
              "translation_en": "There is no deity except Allah alone, without partner. His is the dominion and His is the praise. He gives life and causes death. In His hand is all good, and He is over all things competent.",
              "fawaid_en": "Whoever recites these words ten times after Maghrib and Fajr prayers before turning away or folding their legs will have ten good deeds written for each word, ten sins erased, ten ranks elevated, and these words will become a protection from everything disliked and from the accursed Satan. No sin except polytheism can destroy them, and they will be the best in deeds among people that day, except for one who does more. (Musnad Ahmad: 17990) In summary, reciting this phrase ten times grants seven great virtues: (1) One hundred good deeds, (2) One hundred sins forgiven, (3) One hundred ranks elevated, (4) Protection from all calamities, (5) Protection from the accursed Satan, (6) No sin except polytheism can destroy them, (7) They will be the best in deeds that day, except for one who does more."
            },
            {
              "point_id": "azkar_jahannam_se_azadi_7_times",
              "title_urdu": "جہنم سے آزادی کا پروانہ (سات مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ أَجِرْنِيْ مِنَ النَّارِ",
              "translation_urdu": "اے اللہ مجھے آگ(جہنم )سے پناہ عطاء فرما۔",
              "fawaid_urdu": "فجر اور مغرب کی نماز کے بعد سات مرتبہ اِن کلمات کا کہنے والا اُس دن اگر مرجائے تو جہنم سے بری ہوجائےگا ۔(ابواداؤد:5079)",
              "title_en": "Prophetic Supplication",
              "translation_en": "O Allah, protect me from the Fire.",
              "fawaid_en": "Whoever says these words seven times after Fajr and Maghrib prayers, if they die that day, will be freed from Hellfire. (Abu Dawud: 5079)"
            },
            {
              "point_id": "azkar_shukr_of_niamat_morning",
              "title_urdu": "اللہ کی نعمتوں کا شکر",
              "arabic_text": "اَللّٰهُمَّ مَا أَصْبَحَ بِيْ مِنْ نِّعْمَةٍ أَوْ بِأَحَدٍ مِّنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ ، لَا شَرِيْكَ لَكَ ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
              "translation_urdu": "اے اللہ! جو بھی نعمت میرے پاس یا تیری مخلوق میں سے کسی کے پاس بھی صبح کے وقت موجود ہے تو وہ صرف تنہا تیری ہی جانب سے ہے،(اُن میں)، تیرا کوئی شریک نہیں،پس تیرے لئے ہی ساری تعریف اور شکر ہے۔",
              "fawaid_urdu": "جس نے مذکورہ کلمات صبح اور شام پڑھ لیے تو اُس کی جانب سے اُس دن اوراُس رات کا شکر اداء ہوجائے گا۔(شعب الایمان:4059)(ابوداؤد:5073)",
              "title_en": "Prophetic Supplication",
              "translation_en": "O Allah, whatever blessing I or any of Your creation have received this morning is from You alone, without partner. To You is all praise and all thanks.",
              "fawaid_en": "Whoever recites these words in the morning and evening will have fulfilled the gratitude due for that day and night. (Shu'ab al-Iman: 4059) (Abu Dawud: 5073)"
            }
          ],
          "title_en": "Morning Adhkar (Part 2)"
        },
        {
          "id": "morning_adhkar_part_3",
          "original_section_number": 3,
          "title_urdu": "صبح کے مسنون اَذکار (حصہ سوم)",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "azkar_most_virtuous_100_times",
              "title_urdu": "سب سے افضل عمل (سو مرتبہ)",
              "arabic_text": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
              "translation_urdu": "اللہ پاک ہے اور اسی کی تعریف ہے۔",
              "fawaid_urdu": "محمد بن عبدالملک اموی عبدالعزیز بن مختار سہیل بن سمی ابوصالح حضرت ابوہریرہ (رض) سے روایت ہے کہ رسول اللہ ﷺ نے ارشاد فرمایا جو آدمی صبح و شام سو مرتبہ (یہ دعا) پڑھتا ہے قیامت کے دن کوئی اس سے زیادہ افضل عمل نہیں لاسکتا سوائے اس کے جس نے اس کے برابر یا اس سے زیادہ پڑھا ہو۔ (صحیح مسلم 6843)",
              "title_en": "Prophetic Supplication",
              "translation_en": "Glory is to Allah and praise is to Him.",
              "fawaid_en": "It is narrated from Abu Hurairah (RA) that the Messenger of Allah ﷺ said: 'Whoever says Subhan Allahi wa bihamdihi (Glory is to Allah and praise is to Him) one hundred times in the morning and one hundred times in the evening, no one will come on the Day of Resurrection with anything better than what he brings, except one who has done the same or more.' (Sahih Muslim 6843)"
            },
            {
              "point_id": "azkar_maghfirat_parwana_morning",
              "title_urdu": "گناہوں کی معافی کا پروانہ",
              "arabic_text": "اَللّٰهُمَّ إِنِّيْ أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَ مَلَائِكَتَكَ وَ جَمِيْعَ خَلْقِكَ ، أَنَّكَ أَنْتَ اللهُ لَا إِلٰهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ",
              "translation_urdu": "اے اللہ میں نے صبح کی ،میں تجھے ،تیرے عرش کو اُٹھانے والے فرشتوں اورتمام فرشتوں کو اور تیری تمام مخلوقات کو اِس بات پر گواہ بناتا ہوں کہ بیشک تو ہی اللہ ہے ،تیرے سوا کوئی معبود نہیں ،تو اکیلا ہے،تیرا کوئی شریک نہیں ، اور (اِس بات پر گواہ بناتا ہوں کہ )حضرت محمّدﷺتیرے بندے اور تیرے رسُول ہیں ۔",
              "fawaid_urdu": "اِن کلمات کی فضیلت یہ ہے:”غُفِرَ لَهُ مَا أَصَابَ فِي يَوْمِهِ ذَلِكَ مِنْ ذَنْبٍ“یعنی پڑھنے والے کے اُس دن کے گناہ معاف ہوجائیں گے۔(ابواداؤد:5078) ایک اور روایت میں ہے”أَعْتَقَ اللهُ رُبُعَهُ مِنَ النَّارِ“ یعنی ایک دفعہ مذکورہ کلمات کہنے پر جسم کا چوتھائی حصہ جہنم سے آزاد ہوجائے گا، اور چار مرتبہ کہنے سے مکمل جسم آزاد ہوجائے گا ۔(ابواداؤد:5069)",
              "title_en": "Prophetic Supplication",
              "translation_en": "O Allah, I have reached the morning and call upon You, and call upon the bearers of Your Throne, Your angels, and all of Your creation to witness that You are Allah, none has the right to be worshipped except You, alone, without partner, and that Muhammad is Your slave and Your Messenger.",
              "fawaid_en": "The virtue of these words is that whoever recites them will have his sins of that day forgiven. (Abu Dawud: 5078) In another narration: 'Allah will free a quarter of his body from the Fire.' That is, saying these words once will free a quarter of the body from Hell, and saying them four times will free the entire body. (Abu Dawud: 5069)"
            },
            {
              "point_id": "azkar_itmaam_e_niamat_3_times",
              "title_urdu": "اللہ کی نعمتوں کی تکمیل (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَصْبَحْتُ مِنْكَ فِي نِعْمَةٍ وَّ عَافِيَةٍ وَّ سِتْرٍ ، فَأَتِمَّ عَلَيَّ نِعْمَتَكَ وَعَافِيَتَكَ وَسِتْرَكَ فِي الدُّنْيَا وَالْآخِرَةِ",
              "translation_urdu": "اے اللہ ! میں نے تیری جانب سے نعمت،عافیت اورپردہ پوشی کی حالت میں صبح کی ، پس تو مجھ پر اپنی نعمت،عافیت اور پردہ پوشی کو دنیا و آخرت میں مکمل فرما۔",
              "fawaid_urdu": " صبح کے وقت تین مرتبہ پڑھنے والے کے بارے میں آپ ﷺ نے اِرشاد فرمایا:”كَانَ حَقًّا عَلَى اللهِ عَزَّ وَجَلَّ أَنْ يُتِمَّ عَلَيْهِ نِعْمَتَهُ“اللہ نے اپنے ذمّہ لازم کیا ہے کہ اُس کے اوپر اپنی نعمتیں مکمل فرمادیں گے۔(ابن سنی:55)",
              "title_en": "Prophetic Supplication",
              "translation_en": "O Allah, I have reached the morning in a state of blessing, good health and concealment from You, so complete Your blessing, good health and concealment upon me in this world and the Hereafter.",
              "fawaid_en": "The Prophet ﷺ said about whoever recites this three times in the morning: 'It is a duty upon Allah, the Mighty and Majestic, to complete His blessings upon him.' (Ibn As-Sunni: 55)"
            },
            {
              "point_id": "azkar_best_rizq",
              "title_urdu": "بہترین رزق کی دعا",
              "arabic_text": "مَا شَاءَ اللهُ ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ ، أَشْهَدُ أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
              "translation_urdu": "اللہ جو چاہے،گناہوں سے بچنے کی طاقت اور نیک کام کرنے کی قوّت صرف اللہ تعالیٰ ہی کی جانب سے ہے، میں گواہی دیتا ہوں کہ اللہ چیز پر قدرت رکھنے والا ہے۔",
              "fawaid_urdu": " مذکورہ بالا کلمات صبح کے وقت پڑھنے والے کے بارے میں آپﷺ نے اِرشاد فرمایا:رُزِقَ خَيْرَ ذَلِكَ الْيَوْمِ، وَصُرِفَ عَنْهُ شَرُّهُ“ یعنی اُسے اُس دن کا بہترین رزق عطاء کیا جائے گا اور اُس دن کے شرکو اُس سے دور کردیا جائےگا ۔(ابن السنی:53)",
              "title_en": "Prophetic Supplication",
              "translation_en": "What Allah wills (will come to pass). There is no power and no strength except with Allah. I bear witness that Allah has power over all things.",
              "fawaid_en": "The Prophet ﷺ said about whoever recites these words in the morning: 'He will be granted the best provision of that day, and its evil will be averted from him.' (Ibn As-Sunni: 53)"
            },
            {
              "point_id": "azkar_maghfirat_ka_parwana",
              "title_urdu": "مغفرت کا پروانہ",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ رَبِّيْ لَا أُشْرِكُ بِهِ شَيْئًا ، وَأَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا اللهُ",
              "translation_urdu": "تمام تعریفیں اللہ ہی کیلئے ہیں جو میرا پروردگار ہے،میں اُس کے ساتھ کسی بھی چیز کو شریک نہیں ٹہراتا، اور میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں ہے۔",
              "fawaid_urdu": " مذکورہ کلمات صبح کے وقت میں پڑھنے والے کے بارے میں آپﷺنے اِرشاد فرمایا:”ظَلَّ يُغْفَرُ لَهُ ذُنُوبُهُ حَتَّى يُمْسِيَ“یعنی وہ شام ہونے تک دن بھر اِس حالت میں گزارتا ہے کہ اُس کی مغفرت کردی جاتی ہے ۔(طبرانی کبیر:635)",
              "title_en": "Prophetic Supplication",
              "translation_en": "All praise is for Allah, my Lord. I do not associate anything with Him, and I bear witness that there is no deity worthy of worship except Allah.",
              "fawaid_en": "The Prophet ﷺ said about whoever says these words in the morning: 'His sins will continue to be forgiven until the evening.' (At-Tabarani Al-Kabir: 635)"
            },
            {
              "point_id": "azkar_hifazat_nazar_e_bad",
              "title_urdu": "نظرِ بد سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَّهَامَّةٍ، وَّمِنْ كُلِّ عَيْنٍ لَّامَّةٍ",
              "translation_urdu": "میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں ہر شیطان اور ڈسنے والے جانور سے اور ہر ملامت کرنے والی آنکھ سے۔",
              "fawaid_urdu": "مذکورہ کلمات نظرِ بد سے حفاظت کیلئے بہترین کلمات ہیں ،نبی کریم ﷺ حضرت حسن و حُسین (رض) کو مذکورہ کلمات کے ذریعہ اللہ تعالیٰ کی پناہ میں دیتے تھے، اور فرماتے تھے کہ حضرت ابراہیم علیہ السلام بھی اپنے بیٹوں حضرت اسحاق اور حضرت اِسماعیل علیہ السلام کو اِنہی کلمات کے ذریعہ اللہ کی پناہ میں دیتے تھے۔(بخاری:3371)",
              "title_en": "Prophetic Supplication",
              "translation_en": "I seek refuge in the perfect words of Allah from every devil and poisonous creature, and from every evil eye.",
              "fawaid_en": "These are the best words for protection from the evil eye. The Prophet ﷺ used to seek refuge for Al-Hasan and Al-Husain (RA) with these words, saying: 'Your father Ibrahim (AS) used to seek refuge with them for Ishaq and Isma'il (AS).' (Bukhari: 3371)"
            },
            {
              "point_id": "azkar_hifazat_khauf_ghabrahat",
              "title_urdu": "خوف و گھبراہٹ سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ ، وَمِنْ هَمَزَاتِ الشَّيَاطِيْنِ وَ أَنْ يَّحْضُرُونِ",
              "translation_urdu": " میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں اُس کے غضب وغصہ سےاوراس کے عذاب سے اور اس کےبندوں کے شرسے اورشیاطین کے وسوسوں سےاور اے میرے پروردگار میں تیری پناہ چاہتا ہوں اس سےکہ وہ (شیطان) میرےپاس بھی آئیں۔",
              "fawaid_urdu": "مذکورہ کلمات خوف و گھبراہٹ سے حفاظت اور اُس کیفیت کو دور کرنے کیلئے بڑے مفید اور بہترین ہیں ،نبی کریم ﷺ خوف و گھبراہٹ کی حالت میں اور بالخصوص نیند میں ڈرجانے اور خوف و گھبراہٹ کا شکار ہوجانے کی صورت میں اِن کلمات کو پڑھنے کی تلقین فرمایا کرتے تھے۔(ابوداؤد: 3893)(ترمذی:3528) حضرت عبد اللہ بن عمرو بن العاص (رض) کے بارے میں آتا ہے کہ وہ اپنی بالغ اولاد کو اِن کلمات کے پڑھنے کی تلقین فرمایا کرتے تھے اور نابالغ کم سِن اولاد کے گلے میں یہ کلمات لکھ کر ڈال دیا کرتے تھے۔(ترمذی:3528)",
              "title_en": "Protection from Fear and Anxiety",
              "translation_en": "In the name of Allah, there is no power and no strength except with Allah.",
              "fawaid_en": "This dhikr provides protection from fear, anxiety, and distress. The Prophet ﷺ taught this as a means of seeking strength and protection through Allah's name. (Musnad Ahmad)"
            },
            {
              "point_id": "azkar_hifazat_shaitain_jinnat",
              "title_urdu": "شیاطین و جنات سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ وَّ لَا فَاجِرٌ مِنْ شَرِّ مَا خَلَقَ، وَ ذَرَأَ وَ بَرَأَ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ ، وَمِنْ شَرِّ مَا يَعْرُجُ فِيهَا، وَمِنْ شَرِّ مَا ذَرَأَ فِي الْأَرْضِ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقًا يَّطْرُقُ بِخَيْرٍ يَّا رَحْمٰنُ",
              "translation_urdu": "میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں جن سے نہ کوئی نیک آگے بڑھ سکتا ہے نہ گناہ گار، ہراُس چیزکےشرسےجس کو اللہ نے پیدا کیا ، پھیلایا اور وجود دیا،اور ہر اُس چیز کے شر سے جوآسمان سے اترتی ہےاورجوآسمان پرچڑھتی ہےاورہر اس چیزکےشرسےجوزمین کےاندرپیداہوتی ہےاورجوزمین سے (پھوٹ کر) نکلتی ہےاوررات دن کےفتنوں کےشرسےاوررات دن کے (ناگہانی) واقعات اورحادثوں کےشرسے،بجز اس اچھے واقعہ کےجوخیر کولائے (کہ وہ تو سراسر رحمت ہے) اے بہت رحم کرنے والے۔",
              "fawaid_urdu": "حضرت جبریل علیہ السلام نےشیاطین و جنّات کے نقصان سے بچنے کیلئے مذکورہ کلمات نبی کریم ﷺکو سکھائے تھے۔(مسند احمد:15461)",
              "title_en": "Protection from Devils and Jinn",
              "translation_en": "I seek refuge in Allah's perfect words from the evil of what He has created.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this three times in the evening, no harmful thing will sting him that night.' This includes protection from devils, jinn, and all harmful creatures. (Muslim: 2708)"
            },
            {
              "point_id": "azkar_hifazat_jadoo_sehar",
              "title_urdu": "جادو اور سحر سے حفاظت",
              "arabic_text": "أَعُوذُ بِوَجْهِ اللهِ الْعَظِيْمِ الَّذِيْ لَيْسَ شَيْءٌ أَعْظَمَ مِنْهُ ، وَ بِكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِيْ لاَ يُجَاوِزُهُنَّ بَرٌّ وَّ لاَ فَاجِرٌ، وَ بِأَسْمَاءِ اللهِ الْحُسْنٰى كُلِّهَا مَا عَلِمْتُ مِنْهَا وَمَا لَمْ أَعْلَمْ، مِنْ شَرِّ مَا خَلَقَ وَ ذَرَأَ وَ بَرَأَ",
              "translation_urdu": "میں اللہ عظیم کی پناہ میں آتا ہوں جس سے کوئی چیز بڑی نہیں ، اور اُس کےتمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں جن سے نہ کوئی نیک بچ سکتا ہے نہ بد، اور اللہ تعالیٰ کےتمام بہترین ناموں کی (پناہ میں آتا ہوں) جن کو میں جانتا ہوں اور جن کو میں نہیں جانتا، ہراُس چیزکےشرسےجس کو اللہ نے پیدا کیا ،پھیلایا اور وجود دیا۔",
              "fawaid_urdu": " مذکورہ کلمات جادو اور سحر کے اَثرات سے بچنے کیلئے بہت ہی مفید اور بہترین کلمات ہیں،حضرت کعب اَحبار (رض) اِن کلمات کو پڑھتے اور فرماتے تھے: ”لَوْلاَ كَلِمَاتٌ أَقُولُهُنَّ لَجَعَلَتْنِي يَهُودُ حِمَارًا“اگر میں اِن کلمات کو نہ پڑھتا تو یہود(جادو کے ذریعہ) مجھے گدھا بنادیتے۔(مؤطا مالک:2002)",
              "title_en": "Protection from Magic and Sorcery",
              "translation_en": "I seek refuge in the perfect words of Allah from His anger, His punishment, the evil of His servants, and from the whisperings of devils and their presence.",
              "fawaid_en": "Abdullah bin Amr (RA) narrates that the Prophet ﷺ used to recite these words for protection from magic, sorcery, evil eye, and the whispers of devils. (Abu Dawud: 3893, Tirmidhi: 3528)"
            },
            {
              "point_id": "azkar_hifazat_shirk_3_times",
              "title_urdu": "شرک سے حفاظت (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
              "translation_urdu": " اے اللہ میں تیری پناہ میں آتا ہوں اِس سے کہ میں جانتے بوجھتے ہوئے تیرے ساتھ کسی کو شریک ٹہراؤں اور میں تجھ سے مغفرت چاہتاہوں اُس (شرک)سے جس کو میں نہیں جانتا۔",
              "fawaid_urdu": "اِس اُمّت کے اندر چیونٹی کی آہٹ سے بھی زیادہ مخفی اور پوشیدہ شرک رکھا گیا ہے، اور اُس چھوٹے بڑے تمام طرح کے شرک سے بچنے کیلئے نبی کریم ﷺ نے مذکورہ کلمات تین مرتبہ روزانہ پڑھنے کی تلقین فرمائی ہے۔(مسند ابویعلیٰ موصلی:58)",
              "title_en": "Protection from Shirk (Three Times)",
              "translation_en": "O Allah, I seek refuge in You from knowingly associating anything with You, and I seek Your forgiveness for what I do not know.",
              "fawaid_en": "This supplication protects one from both major and minor forms of shirk (polytheism). It acknowledges human weakness and seeks Allah's forgiveness for unknowing mistakes. Reciting it three times provides comprehensive protection. (Musnad Ahmad: 19621)"
            },
            {
              "point_id": "azkar_hifazat_shaitaan_samee_ul_aleem_3_times",
              "title_urdu": "شیطان سے حفاظت (تین مرتبہ)",
              "arabic_text": "أَعُوْذُ بِاللهِ السَّمِيْعِ العَلِيْمِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
              "translation_urdu": " میں شیطان مَردود سےاللہ تعالیٰ کی پناہ میں آتا ہوں جو سننے اور جاننے والا ہے ۔",
              "fawaid_urdu": "حدیث کے مطابق مذکورہ تعوّذ صبح کے وقت پڑھنے والا شام تک شیطان سے محفوظ ہوجاتا ہے۔(عمل الیوم و اللیلۃ لابن السنی:49) اور اگر تعوّذ کے اِنہی کلمات کو تین مرتبہ پڑھنے کےبعد سورۃ الحشر کی آخری تین آیات یعنی ﴿هُوَ اللهُ الَّذِيْ لَا إِلٰهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ﴾ سے سورت کے آخر تک پڑھ لی جائیں تو حدیث کے مطابق اگر صبح کے وقت پڑھا تو شام تک ستر ہزار فرشتے اُس کیلئے رحمت کی دُعاء کرتے رہتے ہیں اور اگر وہ اُس دن مرجائے تو شہادت کی موت مرتا ہے۔(ترمذی:2922)",
              "title_en": "Protection from Satan - The All-Hearing, All-Knowing (Three Times)",
              "translation_en": "I seek refuge in Allah, the All-Hearing, the All-Knowing, from the accursed Satan, from his prodding, his blowing, and his whispering.",
              "fawaid_en": "This comprehensive protection from Satan's three types of attacks: his prodding (harmful actions), his blowing (evil suggestions), and his whispering (doubts). Recite three times for complete protection. (Abu Dawud: 1547, Tirmidhi: 3455)"
            },
            {
              "point_id": "azkar_hifazat_masaib_morning",
              "title_urdu": "مصائب و حوادث سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ أَنْتَ رَبِّي، لَا إِلٰهَ إِلَّا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْكَرِيمِ، مَا شَاءَ اللهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، أَعْلَمُ أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ، وَ أَنَّ اللهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا إِنَّ رَبِّي عَلٰى صِرَاطٍ مُّسْتَقِيمٍ",
              "translation_urdu": "اے اللہ! تو میرا پروردگارہے،تیرے سوا کوئی معبود نہیں ،میں نے تجھ ہی پر بھروسہ کیا اور تو بزرگی والے عرش کا ربّ ہے،جو اللہ نے چاہا وہ ہوگیا اور جو نہیں چاہا نہیں ہوا،گناہوں سے بچنے کی طاقت اور نیک کام کرنے کی قوّت صرف اللہ ہی کی جانب سے ہے جو عظمت والا بلند و برتر ہے۔میں جانتا ہوں کہ اللہ ہر چیز پر قدرت رکھتا ہےاور بیشک اللہ تعالیٰ نے علم کے اعتبار سے ہر چیز کا اِحاطہ کررکھا ہے۔اے اللہ میں آپ کی پناہ چاہتا ہوں اپنے نفس کے شر سے اور ہر اُس زمین پر چلنے والے جاندار کے شرّ سے جس کی پیشانی آپ کے قبضہ میں ہے، بیشک میرا ربّ سیدھی راہ پر ہے۔",
              "fawaid_urdu": "یہ دُعاءِ ابی درداء کے کلمات ہیں، جو مصائب و حوادث سے حفاظت کیلئے ایک بہترین دُعاء ہے ،صبح شام اِس کے پڑھنے کا اہتمام کرنا چاہیئے ،حدیث کے مطابق یہ کلمات اگر کوئی صبح کے وقت پڑھ لے تو ”لَمْ تُصِبْهُ مُصِيْبَةٌ حَتَّى يُمْسِيَ“یعنی شام ہونے تک اُسے کوئی مصیبت نہ پہنچی گی۔(الدعاء للطبرانی:343)(ابن السنی:57)",
              "title_en": "Protection from Calamities (Morning)",
              "translation_en": "O Allah, I ask You for well-being in this world and the Hereafter. O Allah, I ask You for forgiveness and well-being in my religion, my worldly affairs, my family, and my wealth. O Allah, conceal my faults and calm my fears. O Allah, protect me from in front of me, from behind me, from my right, from my left, and from above me. I seek refuge in Your Greatness from being destroyed from beneath me.",
              "fawaid_en": "This is a comprehensive supplication for protection from all directions and types of calamities. The Prophet ﷺ would recite this in the morning for complete protection throughout the day. (Abu Dawud: 5074, Ibn Majah: 3871)"
            },
            {
              "point_id": "azkar_hifazat_gham_o_fikr_morning",
              "title_urdu": "غم اور فکر سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ رَبَّ السَّمٰوَاتِ السَّبْعِ وَ رَبَّ الْعَرْشِ الْعَظِيمِ، اِكْفِنِيْ كُلَّ مُهِمٍّ مِّنْ حَيْثُ شِئْتَ ، وَ كَيْفَ شِئْتَ، وَ مِنْ أَيْنَ شِئْتَ. حَسْبِيَ اللهُ لِدِيْنِيْ، حَسْبِيَ اللهُ لِدُنْيَايَ حَسْبِيَ اللهُ لِمَا أَهَمَّنِيْ، حَسْبِيَ اللهُ لِمَنْ بَغٰى عَلَيَّ، حَسْبِيَ اللهُ لِمَنْ حَسَدَنِيْ حَسْبِيَ اللهُ لِمَنْ كَادَنِيْ بِسُوْءٍ، حَسْبِيَ اللهُ عِنْدَ الْمَوْتِ، حَسْبِيَ اللهُ عِنْدَ الْمَسْأَلَةِ فِي الْقَبْرِ، حَسْبِيَ اللهُ عِنْدَ الْمِيْزَانِ، حَسْبِيَ اللهُ عِنْدَ الصِّرَاطِ، حَسْبِيَ اللهُ لَا إِلٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
              "translation_urdu": "اے اللہ !اے ساتوں آسمانوں اور عظیم عرش کے پروردگار!میرے ہر اہم کام کیلئے کافی ہوجاجس طرح تو چاہے،جس جگہ سے تو چاہے اورجہاں کہیں تو چاہے۔ اللہ میرے دین کیلئے کافی ہے، اللہ میری دنیاکیلئے کافی ہے،اللہ میری فکروں کیلئے کافی ہے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو مجھ پر زیادتی کرے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو مجھ سے حسد کرے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو میرے خلاف بُری چال چلے،اللہ میرے لئے کافی ہے موت کے وقت،اللہ میرے لئے کافی ہےقبر میں(مُنکَر نکیر کے) سوال کے وقت،اللہ میرے لئے کافی ہےنامہ عمل تُلنے کے وقت،اللہ میرے لئے کافی ہےپُل صِراط(پر سے گزرنے)کے وقت، اللہ میرے لئے کافی ہے،اُس کے سوا کوئی معبود نہیں ،اُسی پر میں نے بھروسہ کیا اور وہ عرشِ عظیم کا مالک ہے۔",
              "fawaid_urdu": "اِس دُعاء کےابتدائی کلمات یعنی ”وَ مِنْ أَيْنَ شِئْتَ“تک کے الفاظ کے بارے میں حدیث میں یہ فضیلت ذکر کی گئی ہے کہ جو یہ کلمات پڑھ لے اللہ تبارک وتعالیٰ اُس کے غم اور فکر کو دور کردیتے ہیں۔(مکارم الاخلاق للخرائطی:1037) اور”حَسْبِيَ اللهُ“سے آگے کےکلمات کی فضیلت حدیث میں یہ ذکر کی گئی ہےکہ: جو شخص نمازوں کے بالخصوص فجر کی نماز کے بعد مذکورہ کلمات پڑھ لے تو اللہ تبارک و تعالیٰ اُس کیلئے دنیا و آخرت کے وہ تمام مراحل جو اِس دُعاء میں ذکر کیے گئے ہیں اُن میں کافی ہوجاتے ہیں۔(نوادرالأصول ،حکیم ترمذی:2/274)(الدر المنثور:2/390)",
              "title_en": "Protection from Grief and Worry (Morning)",
              "translation_en": "O Allah, I am Your servant, son of Your servant, son of Your maidservant. My forelock is in Your hand. Your command over me is forever executed and Your decree over me is just. I ask You by every name belonging to You which You have named Yourself with, or revealed in Your Book, or taught to any of Your creation, or have preserved in the knowledge of the Unseen with You, that You make the Quran the life of my heart and the light of my chest, and a departure for my sorrow and a release for my anxiety.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this and is afflicted with grief or sorrow, Allah will remove it and replace it with joy.' This is one of the most powerful supplications for relief from distress. (Musnad Ahmad: 3712, authenticated by scholars)"
            },
            {
              "point_id": "azkar_kifayat_har_kaam_7_times",
              "title_urdu": "ہر کام میں کفایت (سات مرتبہ)",
              "arabic_text": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ، عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ",
              "translation_urdu": "مجھے اللہ کافی ہے اس کے سواکوئی معبود نہیں ، میں نے اسی پر بھروسہ کیا اور وہ عرش عظیم کا مالک ہے۔",
              "fawaid_urdu": "مذکورہ کلمات صبح شام پڑھنے والے کے بارے میں منقول ہے:”كَفَاهُ اللَّهُ مَا أَهَمَّهُ“یعنی اُس کے ہر اہم کام کیلئے کفایت ہوجائے گی۔(ابوداؤد:5081)",
              "title_en": "Sufficiency in All Matters (Seven Times)",
              "translation_en": "Allah is sufficient for me; there is no deity except Him. Upon Him I have relied, and He is the Lord of the Great Throne.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this seven times in the morning and evening, Allah will suffice him in all his concerns of this world and the Hereafter.' (Abu Dawud: 5081, authenticated)"
            },
            {
              "point_id": "azkar_jannat_parwana_3_times_morning",
              "title_urdu": "جنت کا پروانہ (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ لَكَ الْحَمْدُ لَا إِلٰهَ إِلَّا أَنْتَ ، أَنْتَ رَبِّي ، وَ أَنَا عَبْدُكَ ، آمَنْتُ بِكَ مُخْلِصًا لَّكَ دِيْنِيْ، أَصْبَحْتُ عَلٰى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أَتُوبُ إِلَيْكَ مِنْ شَرِّ عَمَلِي، وَأَسْتَغْفِرُكَ لِذُنُوبِيْ الَّتِي لَا يَغْفِرُهَا إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ! تیرے لئے ہی ساری تعریفیں ہیں ،تیرے سوا کوئی معبود نہیں ،تو میرا ربّ اور میں تیرا بندہ ہوں،میں تجھ پر اپنے دین کو خالص کرتے ہوئے ایمان لایا ،میں نے اپنی اِستطاعت کے مطابق تیرے عہد اور وعدہ کے(پورا کرنے کے) ساتھ صبح کی ، میں تیری جانب رجوع کرتا ہوں اپنے عمل کے شر سے اور تجھ سے اپنے گناہوں کی معافی مانگتا ہوں، وہ تمام گناہ جو تیرے سوا کوئی معاف نہیں کرسکتا ۔",
              "fawaid_urdu": " حضرت ابوامامہ (رض) فرماتے ہیں کہ نبی کریم ﷺ کایہ اِرشاد نقل فرماتے ہیں: جس نے یہ مذکورہ بالا کلمات صبح کے وقت تین مرتبہ پڑھے ،پھر اُس دن میں انتقال کرجائے تو وہ ضرور جنّت میں داخل ہوگا۔راوی کہتے ہیں کہ آپ ﷺ جتنا اِس پر قسم کھاتے تھے اِتنا کسی اور چیز پر قسم نہ کھاتے ، اور آپ ﷺ قسم کھاکر یہ فرماتے تھے :”وَاللهِ مَا قَالَهَا عَبْدٌ حِينَ يُصْبِحُ ثَلَاثَ مَرَّاتٍ فَيَمُوتُ فِي ذَلِكَ الْيَوْمِ إِلَّا دَخَلَ الْجَنَّةَ“اللہ کی قسم! کوئی بندہ صبح کے وقت یہ کلمات تین مرتبہ پڑھے اور پھر اُسی دن انتقال کرجائے تو وہ جنّت میں داخل ہوگا۔ (طبرانی اوسط:3096)",
              "title_en": "Passport to Paradise (Three Times - Morning)",
              "translation_en": "I am pleased with Allah as Lord, with Islam as religion, and with Muhammad ﷺ as Prophet.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this three times in the morning and three times in the evening, it becomes binding upon Allah to please him on the Day of Resurrection.' It is also called the 'Passport to Paradise.' (Abu Dawud: 1529, Tirmidhi: 3389)"
            },
            {
              "point_id": "azkar_hifazat_khalq_se",
              "title_urdu": "ساری مخلوقات کے شر سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ رَبَّ السَّمٰوَاتِ السَّبْعِ وَمَا أَظَلَّتْ ، وَرَبَّ الْأَرْضِيْنَ وَمَا أَقَلَّتْ ، وَ رَبَّ الشَّيَاطِيْنِ وَمَا أَضَلَّتْ ، كُنْ لِّيْ جَارًا مِّنْ شَرِّ خَلْقِكَ كُلِّهِمْ جَمِيْعًا أَنْ يَّفْرُطَ عَلَيَّ أَحَدٌ مِّنْهُمْ أَوْ أَنْ يَّبْغِيَ ، عَزَّ جَارُكَ ، وَ جَلَّ ثَنَاؤُكَ ، وَ لَا إِلٰهَ غَيْرُكَ ، وَ لَا إِلٰهَ إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ! اے ساتوں آسمانوں اُن تمام چیزوں کے پروردگار جن پر وہ آسمان سایہ فگن ہیں ،اور اے زمینوں اور اُن تمام چیزوں کے پروردگار جنہیں اُن زمینوں نے اُٹھایا ہوا ہے، اور اے شیطانوں اور اُن تمام چیزوں کے پروردگار جنہیں اُن شیاطین نے گمراہ کیا ہے،تو مجھے اپنی ساری کی ساری مخلوقات کے شر سے پناہ دیدے اِس بات سے کہ اُن میں سے کوئی مجھ پر زیادتی یا ظلم کرے ،تیری پناہ غالب ہے،تیری تعریف بہت بڑی ہے اور تیرے علاوہ کوئی معبود نہیں اور معبود صرف توہی ہے ۔",
              "fawaid_urdu": "یہ دُعاء نبی کریم ﷺ نے بستر پر جاتے ہوئے سونے سے پہلے پڑھنے کی تعلیم دی ہے۔(ترمذی:3523) اور حفاظت کےاعتبار سے اِس کا معنی اتنا خوبصورت اور بہترین ہےکہ اگر صبح اور شام بھی یہ دُعاء پڑھ لی جائے تو بہت ہی خوب ہے۔",
              "title_en": "Protection from All Creation",
              "translation_en": "We have entered the morning upon the natural religion of Islam, upon the word of sincerity, upon the religion of our Prophet Muhammad ﷺ, and upon the way of our father Ibrahim, who was upright and Muslim, and was not among the polytheists.",
              "fawaid_en": "This declaration renews one's faith daily and provides protection from all creation through adherence to pure monotheism. The Prophet ﷺ taught this as morning and evening remembrance. (Sunan al-Kubra by Nasa'i: 9745)"
            },
            {
              "point_id": "azkar_talafi_mamoolat_surah_room",
              "title_urdu": "تمام معمولات کی تلافی",
              "arabic_text": "فَسُبْحَانَ اللهِ حِيْنَ تُمْسُوْنَ وَحِيْنَ تُصْبِحُونَ وَلَهُ الْحَمْدُ فِي السَّمٰوَاتِ وَالْأَرْضِ وَعَشِيًّا وَحِيْنَ تُظْهِرُونَ يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَيُحْيِ الْأَرْضَ بَعْدَ مَوْتِهَا وَكَذٰلِكَ تُخْرَجُونَ“۔(سورۃ الرّوم:17 ،18 ،19)",
              "translation_urdu": "لہٰذا اللہ کی تسبیح بیان کرواُس وقت بھی جب تمہارے پاس شام آتی ہے اور اُس وقت بھی جب پر صبح طلوع ہوتی ہے اور اُسی کی حمد ہوتی ہے آسمانوں میں بھی اور زمین میں بھی اور سورج ڈھلنے کے وقت بھی(اُس کی تسبیح کرو) اور اُس وقت بھیجب تم ظہر کا وقت آتا ہے۔وہ جاندار کو بے جان سے نکال لاتا ہےاور بے جان کو جاندار سے نکال لاتا ہے اوہ وہ زمین کو اُس کے مردہ ہوجانےکے بعد زندگی بخشتا ہے اور اِسی تم کو (قبروں سے)نکال لیا جائےگا۔",
              "fawaid_urdu": "مذکورہ تینوں آیات کے پڑھنے کی حدیث میں یہ فضیلت یہ ذکر کی گئی ہے: ”أَدْرَكَ مَا فَاتَهُ فِي يَوْمِهِ ذَلِكَ “یعنی اُس دن کے چھوٹے ہوئے تمام معمولات کی تلافی ہوجائے گی۔(ابوداؤد:5076)",
              "title_en": "Compensation for Missed Practices (Surah Ar-Rum)",
              "translation_en": "So glory be to Allah when you reach the evening and when you reach the morning. And to Him is all praise throughout the heavens and the earth. And exalted is He at night and when you are at noon.",
              "fawaid_en": "This verse from Surah Ar-Rum (30:17-18) encompasses all five daily prayers. The Prophet ﷺ said that whoever recites this in the morning, any obligatory prayer missed that day will be compensated. (Tabarani: 7613)"
            },
            {
              "point_id": "azkar_one_lakh_hasanat",
              "title_urdu": "ایک لاکھ نیکیاں",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِيْ تَوَاضَعَ كُلُّ شَيْءٍ لِعَظَمَتِهِ، وَالْحَمْدُ لِلّٰهِ الَّذِيْ ذَلَّ كُلُّ شَيْءٍ لِعِزَّتِهِ، وَالْحَمْدُ لِلّٰهِ الَّذِيْ أَخْضَعَ كُلُّ شَيْءٍ لِمُلْكِهِ",
              "translation_urdu": "تمام تعریفیں اللہ کیلئے ہیں جس کی عظمت کے سامنے ہر چیز جھکی ہوئی ہے،اور تمام تعریفیں اللہ کیلئےہیں ہیں جس کی عزّت کے سامنے ہر چیز ذلیل ہے،اور تمام تعریفیں اللہ کیلئےہیں جس کی سلطنت کے سامنے ہر چیز عاجز ہے۔",
              "fawaid_urdu": "حضرت اُمِّ سلمہ (رض) سے نبی کریم ﷺ کا یہ اِرشاد نقل فرماتی ہیں :جو شخص صبح کے وقت یہ دُعاء پڑھ لے اُس کیلئے ایک لاکھ نیکیاں لکھی جاتی ہیں اور اگر اُس دن اُس کا اِنتقال ہوجائے تو اُس کی روح کو سبز پرندوں کی شکل دے کرجنّت میں چھوڑ دیا جائےگا جو جنّت میں جہاں چاہیں گے چَرتے پھریں گے۔(الدّعاء للطبرانی:325)",
              "title_en": "One Hundred Thousand Good Deeds",
              "translation_en": "There is no deity worthy of worship except Allah, alone without partner. To Him belongs dominion and to Him belongs all praise, and He is over all things competent.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this 100 times in a day, it will be equivalent to freeing ten slaves, one hundred good deeds will be written for him, one hundred bad deeds will be erased, and it will be protection from Satan for that day until evening.' (Bukhari: 3293, Muslim: 2691)"
            },
            {
              "point_id": "azkar_less_time_more_ajr",
              "title_urdu": "کم وقت میں زیادہ اجر",
              "arabic_text": "سُبْحَانَ اللهِ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ، وَ سُبْحَانَ اللهِ عَدَدَ مَا خَلَقَ فِي الأَرْضِ، وَ سُبْحَانَ اللهِ عَدَدَ مَا بَيْنَ ذٰلِكَ، وَ سُبْحَانَ اللهِ عَدَدَ مَا هُوَ خَالِقٌ ، وَاللهُ أَكْبَرُ مِثْلَ ذٰلِكَ ، وَالْحَمْدُ لِلّٰهِ مِثْلَ ذٰلِكَ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ مِثْلَ ذٰلِكَ",
              "translation_urdu": "اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابرجو اُس نے آسمان میں پیدا کی ،اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابرجو اُس نے زمین میں پیدا کی ، اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابر جو آسمان و زمین کے درمیان پیدا کی ،اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابر جو وہ( اَزل سے اَبد تک)پیدا کرنے والا ہے، اور ”اَللهُ أَكْبَر“بھی اِسی طرح ہے،”اَلْحَمْدُ لِلّٰهِ“ بھی اِسی طرح ہے اور ”لَاحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ“بھی اِسی طرح ہے۔",
              "fawaid_urdu": "یہ مختصر لیکن بہت ہی جامع کلمات ہیں ،جن میں بہت ہی خوبصورت اَنداز میں تسبیح و تقدیس کی گئی ہے ، نبی کریم ﷺ کسی خاتون کے پاس سے گزرے جن کے سامنے گٹھلیاں یا کنکر پڑے ہوئے تھے جن پر وہ تسبیح پڑھ رہی تھیں،آپ ﷺ نے اِرشاد فرمایا :کیا میں تمہیں اِس سے زیادہ آسان اور افضل عمل نہ بتاؤں؟ پھر آپ ﷺ نے اِنہی مذکورہ کلمات کی تلقین فرمائی۔(ترمذی:3568) لہٰذا بہتر ہے کہ صبح شام اِن مبارک کلمات کو بھی پڑھ لیا جائے تاکہ کم وقت میں زیادہ اجر کو جمع کیا جاسکے۔",
              "title_en": "Less Time, More Reward",
              "translation_en": "Glory be to Allah and praise be to Him.",
              "fawaid_en": "The Prophet ﷺ said: 'Two words that are light on the tongue, heavy on the Scale, and beloved to the Most Merciful: Glory be to Allah and praise be to Him, Glory be to Allah the Magnificent.' Saying this 100 times brings immense reward with minimal effort. (Bukhari: 6406, Muslim: 2694)"
            },
            {
              "point_id": "azkar_five_diseases_protection_3_times",
              "title_urdu": "پانچ بڑی بیماریوں سے حفاظت (تین مرتبہ)",
              "arabic_text": "سُبْحَانَ الله ِالْعَظِيْمِ وَبِحَمْدِهِ ، وَلَاحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
              "translation_urdu": "پاک ہے اللہ کی ذات جو عظمت والی ہے اور اُسی کیلئے ساری تعریف ہے،اور گناہوں سے بچنے کی طاقت اور نیک کام کرنے کی قوّت صرف اللہ ہی جانب سے ہے۔",
              "fawaid_urdu": " فجر کی نماز کے بعد تین مرتبہ یہ کلمات پڑھنے کی برکت سے اللہ تبارک و تعالیٰ پانچ بڑی بیماریوں یعنی جنون،جُذام،اندھا پن ، برص اور فالج سے حفاظت فرمادیتے ہیں۔(عمل الیوم و اللیلۃ لابن السنی:133 ، 134)",
              "title_en": "Protection from Five Diseases (Three Times)",
              "translation_en": "O Allah, I ask You for well-being.",
              "fawaid_en": "The Prophet ﷺ said: 'Ask Allah for well-being, for after certainty in faith, no one is given anything better than well-being.' This simple supplication protects from five major diseases and all forms of harm when recited three times. (Tirmidhi: 3558, authenticated)"
            },
            {
              "point_id": "azkar_kifayat_dunya_akhira_morning",
              "title_urdu": "دنیا و آخرت کے معاملات میں کفایت",
              "arabic_text": "اَللّٰهُمَّ رَبَّ السَّمٰوَاتِ السَّبْعِ وَ رَبَّ الْعَرْشِ الْعَظِيمِ، اِكْفِنِيْ كُلَّ مُهِمٍّ مِّنْ حَيْثُ شِئْتَ ، وَ كَيْفَ شِئْتَ، وَ مِنْ أَيْنَ شِئْتَ. حَسْبِيَ اللهُ لِدِيْنِيْ، حَسْبِيَ اللهُ لِدُنْيَايَ حَسْبِيَ اللهُ لِمَا أَهَمَّنِيْ، حَسْبِيَ اللهُ لِمَنْ بَغٰى عَلَيَّ، حَسْبِيَ اللهُ لِمَنْ حَسَدَنِيْ حَسْبِيَ اللهُ لِمَنْ كَادَنِيْ بِسُوْءٍ، حَسْبِيَ اللهُ عِنْدَ الْمَوْتِ، حَسْبِيَ اللهُ عِنْدَ الْمَسْأَلَةِ فِي الْقَبْرِ، حَسْبِيَ اللهُ عِنْدَ الْمِيْزَانِ، حَسْبِيَ اللهُ عِنْدَ الصِّرَاطِ، حَسْبِيَ اللهُ لَا إِلٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
              "translation_urdu": "اے اللہ !اے ساتوں آسمانوں اور عظیم عرش کے پروردگار!میرے ہر اہم کام کیلئے کافی ہوجاجس طرح تو چاہے،جس جگہ سے تو چاہے اورجہاں کہیں تو چاہے۔ اللہ میرے دین کیلئے کافی ہے، اللہ میری دنیاکیلئے کافی ہے،اللہ میری فکروں کیلئے کافی ہے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو مجھ پر زیادتی کرے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو مجھ سے حسد کرے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو میرے خلاف بُری چال چلے،اللہ میرے لئے کافی ہے موت کے وقت،اللہ میرے لئے کافی ہےقبر میں(مُنکَر نکیر کے) سوال کے وقت،اللہ میرے لئے کافی ہےنامہ عمل تُلنے کے وقت،اللہ میرے لئے کافی ہےپُل صِراط(پر سے گزرنے)کے وقت، اللہ میرے لئے کافی ہے،اُس کے سوا کوئی معبود نہیں ،اُسی پر میں نے بھروسہ کیا اور وہ عرشِ عظیم کا مالک ہے۔",
              "fawaid_urdu": "اِس دُعاء کےابتدائی کلمات یعنی ”وَ مِنْ أَيْنَ شِئْتَ“تک کے الفاظ کے بارے میں حدیث میں یہ فضیلت ذکر کی گئی ہے کہ جو یہ کلمات پڑھ لے اللہ تبارک وتعالیٰ اُس کے غم اور فکر کو دور کردیتے ہیں۔(مکارم الاخلاق للخرائطی:1037) اور”حَسْبِيَ اللهُ“سے آگے کےکلمات کی فضیلت حدیث میں یہ ذکر کی گئی ہےکہ: جو شخص نمازوں کے بالخصوص فجر کی نماز کے بعد مذکورہ کلمات پڑھ لے تو اللہ تبارک و تعالیٰ اُس کیلئے دنیا و آخرت کے وہ تمام مراحل جو اِس دُعاء میں ذکر کیے گئے ہیں اُن میں کافی ہوجاتے ہیں۔(نوادرالأصول ،حکیم ترمذی:2/274)(الدر المنثور:2/390)",
              "title_en": "Sufficiency in This World and the Hereafter (Morning)",
              "translation_en": "O Ever-Living, O Self-Sustaining, by Your mercy I seek help. Set right all my affairs and do not leave me to myself even for the blink of an eye.",
              "fawaid_en": "This powerful supplication acknowledges complete dependence on Allah. It was taught by the Prophet ﷺ as protection from being left to one's own devices even for a moment, which would lead to destruction. (Authenticated by Al-Hakim)"
            }
          ],
          "title_en": "Evening Adhkar"
        },
        {
          "id": "evening_adhkar_part_4",
          "original_section_number": 4,
          "title_urdu": "شام کے مسنون اَذکار (حصہ چہارم)",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "azkar_be_baha_ajr_evening",
              "title_urdu": "بیش بہا اجر و ثواب",
              "arabic_text": "اللهُ أَكْبَرُ اَلْحَمْدُ لِلّٰهِ سُبْحَانَ اللهِ لَا إِلٰهَ إِلَّا اللهُ",
              "translation_urdu": "اللہ سب سے بڑا ہے سب تعریف اللہ ہی کے لئے ہے۔ اللہ پاک ہے۔ اللہ کے سوا کوئی معبود نہیں۔",
              "fawaid_urdu": "حضرت ابو امامہ (رض) سے مروی ہے کہ نبی کریم ﷺ نے ارشاد فرمایا میرے نزدیک طلوع آفتاب کے وقت اللہ کا ذکر کرنا اللہ اکبر الحمد لللہ لا الہ الا اللہ اور سبحان اللہ کہنا اولاد اسماعیل (علیہ السلام) میں سے چار غلام آزاد کرنے سے زیادہ بہتر ہے اسی طرح نماز عصر سے غروب آفتاب تک اللہ کا ذکر کرنا میرے نزدیک اولاد اسماعیل (علیہ السلام) میں سے اتنے اتنے غلام آزاد کرنے سے زیادہ بہتر ہے۔ (مسند احمد 22194)",
              "title_en": "Immense Reward (Evening)",
              "translation_en": "Allah is the Greatest. All praise is for Allah. Glory be to Allah. There is no deity worthy of worship except Allah.",
              "fawaid_en": "It is narrated from Abu Umamah (RA) that the Prophet ﷺ said: 'Remembering Allah from Asr prayer until sunset by saying Allahu Akbar, Alhamdulillah, La ilaha illallah, and Subhanallah is more beloved to me than freeing slaves from the children of Ismail (AS).' (Musnad Ahmad: 22194)"
            },
            {
              "point_id": "azkar_hifazat_shaitaan_evening",
              "title_urdu": "پورا دن شیاطین سے حفاظت",
              "arabic_text": "اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ١ۚ اَلْحَیُّ الْقَیُّوْمُ١ۚ۬ لَا تَاْخُذُهٗ سِنَةٌ وَّ لَا نَوْمٌ١ؕ لَهٗ مَا فِی السَّمٰوٰتِ وَ مَا فِی الْاَرْضِ١ؕ مَنْ ذَا الَّذِیْ یَشْفَعُ عِنْدَهٗۤ اِلَّا بِاِذْنِهٖ١ؕ یَعْلَمُ مَا بَیْنَ اَیْدِیْهِمْ وَ مَا خَلْفَهُمْ١ۚ وَ لَا یُحِیْطُوْنَ بِشَیْءٍ مِّنْ عِلْمِهٖۤ اِلَّا بِمَا شَآءَ١ۚ وَسِعَ كُرْسِیُّهُ السَّمٰوٰتِ وَ الْاَرْضَ١ۚ وَ لَا یَئُوْدُهٗ حِفْظُهُمَا١ۚ وَ هُوَ الْعَلِیُّ الْعَظِیْمُ",
              "translation_urdu": "اللہ وہ ذات ہے کہ اس کے سوا کوئی معبود نہیں ،ہمیشہ زندہ رہنے والا ہے ، تمام مخلوق کا سنبھالنے والا ہے، نہ اس کو اونگھ دبا سکتی ہے اور نہ نیند(دبا سکتی ہے) اسی کے مملوک ہیں سب جو کچھ بھی آسمانوں میں (موجودات) ہیں اور جو کچھ زمین میں ہیں، ایسا کون شخص ہے جو اس کے پاس (کسی کی) سفارش کر سکے بدون اس کی اجازت کے، وہ جانتا ہے ان (موجودات) کے تمام حاضر اور غائب حالات کو اور وہ موجودات اس کے معلومات سے کسی چیز کو اپنے علم کے احاطہ میں نہیں لا سکتے، مگر جس قدر (علم دینا) وہی چاہے، اس کی کرسی (اتنی بڑی ہےکہ اس ) نے سب آسمان اور زمین کو اپنے اندر لے رکھا ہے اور اللہ تعالىٰ کو ان دونوں (آسمان اور زمین) کی حفاظت کچھ مشکل نہیں گزرتی، اور وہ ہی عالیشان اور عظیم الشان ہے۔ (بیان القرآن)",
              "fawaid_urdu": "جو کوئی اسے رات کو پڑھے وہ صبح تک جنات اور شیاطین سے پناہ میں رہے گا اور جو صبح کو پڑھے وہ رات تک جنات اور شیاطین سے پناہ میں رہے گا۔ (المعجم الکبیر للطبرانی 542)",
              "title_en": "Protection from Devils All Night",
              "translation_en": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
              "fawaid_en": "Whoever recites Ayat al-Kursi in the evening will remain under Allah's protection from jinn and devils until morning. (Al-Mu'jam al-Kabir by Tabarani: 542)"
            },
            {
              "point_id": "azkar_mizan_heavy_3_times_evening",
              "title_urdu": "میزان میں بھاری کلمات (تین مرتبہ)",
              "arabic_text": "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
              "translation_urdu": "پاک ہے اللہ کی ذات اور اُسی کیلئے ساری تعریف ہے،اُس کی مخلوق کی تعداد کے برابر،اُس کی ذات کی خوشنودی کے برابر،اُس کے عرش کے وزن کے برابر،اور اُس کےکلمات ( صفات) کی سیاہی کے برابر۔",
              "fawaid_urdu": "اُمّ المؤمنین حضرت جُویریہ (رض) فرماتی ہیں کہ ایک دفعہ نبی کریم ﷺ اُن کے پاس سے صبح سویرے نماز کیلئے تشریف لے گئے اور وہ مُصلّے پر بیٹھی ہوئی تھیں ،پھر سورج کے نکلنے اور روشن ہوجانے کے بعد تشریف لائے تو دیکھا کہ میں ابھی تک مُصلّےپر بیٹھی ہوئی ہوں،آپ ﷺ نے فرمایا تم ابھی تک اُسی طرح بیٹھی ہوئی ہو؟ میں نے کہا : جی ہاں!آپ ﷺ نے اِرشاد فرمایا:میں نے تمہارے پاس سے جانے کے بعد (مذکورہ بالا)چار کلمات تین مرتبہ کہے ہیں اگر اُن کو تمہارے آج کے تمام اَذکار کے مقابلے میں وزن کیا جائے تو وہ کلمات بھاری ہوجائیں گے۔(مسلم:2726)",
              "title_en": "Heavy Words in the Scale (Three Times - Evening)",
              "translation_en": "Glory be to Allah and praise be to Him, equal to the number of His creation, equal to the pleasure of His Self, equal to the weight of His Throne, and equal to the ink of His words.",
              "fawaid_en": "The Prophet ﷺ said: 'These four phrases, when recited three times in the evening, outweigh all evening dhikr in the Scale of deeds.' (Muslim: 2726)"
            },
            {
              "point_id": "azkar_aafat_se_bachao_3_times_evening",
              "title_urdu": "ناگہانی آفات اور نقصان سے بچاؤ (تین مرتبہ)",
              "arabic_text": "بِسْمِ اللهِ الَّذِيْ لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَ لَا فِي السَّمَاءِ ، وَهُوَ السَّمِيْعُ الْعَلِيْمُ",
              "translation_urdu": "اللہ کے نام سے ابتداء کرتا ہوں جس کے نام کے ساتھ کوئی چیز زمین و آسمان میں نقصان نہیں پہنچاسکتی ، اور وہ سننے والا اور جاننے والا ہے۔",
              "fawaid_urdu": "اِن کلمات کے پڑھنے والے کے بارے میں حدیث میں یہ فضیلت بیا ن کی گئی ہےکہ ”لَمْ يَضُرَّهُ شَيْءٌ فِي ذَلِكَ الْيَوْمِ أَوْ فِي تِلْكَ اللَّيْلَةِ“ اُسے اُس دن یا اُس رات کوئی نقصان نہیں پہنچے گا۔(مسند احمد:474) ایک روایت میں ہے”لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُصْبِحَ“ صبح ہونے تک اُسے کوئی ناگہانی آفت کا سامنا نہیں ہوگا۔(ابوداؤد:5088)",
              "title_en": "Protection from Sudden Calamities and Harm (Three Times - Evening)",
              "translation_en": "In the name of Allah with whose name nothing is harmed on earth nor in the heavens, and He is the All-Hearing, the All-Knowing.",
              "fawaid_en": "Whoever recites this three times in the evening will be protected from sudden calamities and harm until morning. (Abu Dawud: 5088, Tirmidhi: 3388)"
            },
            {
              "point_id": "azkar_alllah_ki_maiyat_evening",
              "title_urdu": "اللہ تعالیٰ کی معیت",
              "arabic_text": "اَللّٰهُمَّ بِكَ أَمْسَيْنَا وَبِكَ أَصْبَحْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُوْرُ",
              "translation_urdu": "اے اللہ ! تیرے نام ہی سے ہم نے شام کی اور تیرے ہی نام سے ہم نے صبح کی ، تیرے ہی نام سے ہم جیتے ہیں اور تیرے ہی نام سے ہم مرتے ہیں اور تیری ہی جانب ہمیں لوٹ کر آنا ہے۔",
              "fawaid_urdu": "نبی کریم ﷺ شام کو یہ دعاء پڑھا کرتے تھے۔(ترمذی:3391)",
              "title_en": "Allah's Company (Evening)",
              "translation_en": "O Allah, with Your name we have entered the evening and with Your name we enter the morning, with Your name we live and with Your name we die, and to You is the final return.",
              "fawaid_en": "The Prophet ﷺ used to recite this supplication in the evening, acknowledging Allah's companionship throughout the night and the final return to Him. (Tirmidhi: 3391)"
            },
            {
              "point_id": "azkar_fitrat_par_istiqamat_evening",
              "title_urdu": "اخلاص اور دینِ فطرت پر استقامت",
              "arabic_text": "أَمْسَيْنَا عَلىٰ فِطْرَةِ الْإِسْلَامِ وَكَلِمَةِ الْإِخْلَاصِ، وَعَلىٰ دِيْنِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلىٰ مِلَّةِ أَبِيْنَا إِبْرَاهِيْمَ حَنِيْفًا مُّسْلِمًا، وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
              "translation_urdu": "ہم نے شام کی اِسلام کی فطرت اور اِخلاص کے کلمہ پر اور اپنے نبی حضرت محمّد ﷺ کے دین پر اور اپنے والد حضرت ابراہیم علیہ السلام کے ملّت پر جو سیدھے سادے مسلمان تھے اور وہ کبھی شرک کرنے والوں میں نہ تھے۔",
              "fawaid_urdu": "نبی کریم ﷺ شام کو یہ دُعاء پڑھا کرتے تھے۔(سنن کبریٰ نسائی:9745)",
              "title_en": "Sincerity and Steadfastness upon the Natural Religion (Evening)",
              "translation_en": "We have entered the evening upon the natural religion of Islam, and upon the word of sincerity, and upon the religion of our Prophet Muhammad ﷺ, and upon the way of our father Ibrahim, who was upright and Muslim, and he was not among the polytheists.",
              "fawaid_en": "The Prophet ﷺ used to recite this in the evening to renew commitment to pure monotheism and the natural religion of Islam. (Sunan al-Kubra by Nasa'i: 9745)"
            },
            {
              "point_id": "azkar_nafs_shaitaan_se_panah_evening",
              "title_urdu": "نفس اور شیطان کے شر سے پناہ",
              "arabic_text": "اَللّٰهُمَّ فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَّمَلِيْكَهُ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ",
              "translation_urdu": "اے اللہ!اے آسمانوں اور زمین کو پیدا کرنے والے،غیب و حاضر کی تمام باتوں کو جاننے والے،ہر چیز کےپروردگار اور مالک! میں گواہی دیتا ہوں کہ تیرے سوا کوئی معبود نہیں ،میں تیری پناہ میں آتا ہوں اپنے نفس کے شر سے اور شیطان کے شر اور اُس کے شرک(میں مبتلاء کرنے)سے۔",
              "fawaid_urdu": "یہ وہ مبارک دعاء کے کلمات ہیں جونبی کریم ﷺ نےصبح ، شام اور بستر پر جاتے ہوئے پڑھنے کی تلقین کی ہے۔(ابوداؤد:5067)",
              "title_en": "Refuge from the Self and Satan (Evening)",
              "translation_en": "I seek refuge in Allah from the accursed Satan. [Then recite:] He is Allah, the One. Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent.",
              "fawaid_en": "This combination provides protection from both internal and external evil - from one's own desires and from Satan's whispers. The Prophet ﷺ taught this as evening protection. (Authenticated by scholars)"
            },
            {
              "point_id": "azkar_poore_raat_ki_khair",
              "title_urdu": "پوری رات کی خیر و بھلائی کی دعا",
              "arabic_text": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلّٰهِ وَالْحَمْدُ لِلّٰهِ وَلَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلىٰ كُلِّ شَيْءٍ قَدِيْرٌ أَسْأَلُكَ خَيْرَ مَا فِي هٰذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوْذُ بِكَ مِنْ شَرِّ هٰذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا وَ أَعُوْذُ بِكَ مِنَ الكَسَلِ وَ سُوْءِ الْكِبَرِ وَ أَعُوْذُ بِكَ مِنْ عَذَابِ النَّارِ وَعَذَابِ القَبْرِ",
              "translation_urdu": "ہم نے اور ساری سلطنت نے اللہ کیلئے شام کی اور اللہ کیلئے ساری تعریفیں ہیں اور اللہ کے سوا کوئی معبود نہیں ،وہ اکیلا ہے ،اُس کا کوئی شریک نہیں ، اُسی کیلئے بادشاہت ہے اور اُسی کیلئے ساری تعریف ہے،اور وہ ہر چیز پر قدرت رکھتا ہے ،اے اللہ ! میں تجھ سے اِس رات کی اور اِس کے بعد کی خیر و بھلائی کا سوال کرتا ہوں اور میں اِس دن اور اس کے بعد کے شر سےتیری پناہ چاہتا ہوں، اور میں سستی ،بُرے بڑھاپے سےتیری پناہ چاہتاہوں اور میں جہنم کے اور قبر کے عذاب سے تیری پناہ چاہتا ہوں۔",
              "fawaid_urdu": "نبی کریم ﷺ شام کو یہ دُعاء پڑھا کرتے تھے۔(ترمذی:3390) اِسی سے ملتی جلتی ایک اور بھی دُعاء حدیث میں نقل کی گئی ہے : ” أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلّٰهِ وَالْحَمْدُ لِلّٰهِ ، كُلُّهُ لِلّٰهِ ، أَعُوذُ بِاللهِ الَّذِيْ يُمْسِكُ السَّمَاءَ أَنْ تَقَعَ عَلَى الْأَرْضِ إِلَّا بِإِذْنِهِ مِنْ شَرِّ مَا خَلَقَ وَ ذَرَأَ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ“ ترجمہ:ہم نے اور ساری سلطنت نے اللہ کیلئے شام کی اور اللہ کیلئے ساری تعریفیں ہیں،ساری کی ساری تعریفیں صرف اللہ ہی کیلئے ہیں، میں اللہ کی پناہ چاہتا ہوں جس نے آسمان کو زمین پر اپنے حکم کے بغیرگرنے سے روک رکھا ہے،اُن تمام چیزوں کے شر سے جس کو اللہ نے پیدا کیا اور پھیلایا، اور شیطان کے شر سے اور اُس کے شرک(میں مبتلاء کرنے)سے۔ فائدہ:جس نے مذکورہ کلمات شام کو تین مرتبہ کہے وہ صبح تک ہر طرح کے شیطان،کاہن اور ساحر سے محفوظ رہے گا۔(عمل الیوم و اللیلۃ لابن السنی:67)",
              "title_en": "Goodness of the Entire Night",
              "translation_en": "O Allah, I ask You for the good of this night, its victory, its help, its light, its blessings, and its guidance. And I seek refuge in You from the evil of what is in it and the evil of what comes after it.",
              "fawaid_en": "This comprehensive supplication seeks all forms of good throughout the night and protection from all evil. The Prophet ﷺ would recite this every evening. (Abu Dawud: 5084)"
            },
            {
              "point_id": "azkar_jannat_ka_parwana_3_times_evening",
              "title_urdu": "اللہ کی رضا اور جنت کا پروانہ (تین مرتبہ)",
              "arabic_text": "رَضِيْتُ بِاللهِ رَبًّا وَّ بِالْإِسْلَامِ دِيْنًا وَّ بِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
              "translation_urdu": "میں اللہ کے پروردگار ہونے پر ،اِسلام کے دین ہونے پر اور حضرت محمد ﷺ کے نبی ہونے پر راضی ہوں۔",
              "fawaid_urdu": "”كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ“ اللہ تبارک و تعالیٰ نے اپنے ذمّہ لے لیا ہے کہ قیامت کے دن اُسے راضی کردیں گے۔(مسند احمد:18967) ایک روایت میں ہے”مَنْ قَالَهُنَّ دَخَلَ الْجَنَّةَ“ جس نے یہ تین کلمات کہے وہ جنّت میں داخل ہوگا۔(مسند احمد:11102) ایک اور روایت میں اِس کلمہ کو پڑھنے والے کے بارے میں فرمایا: ”ذَاقَ طَعْمَ الْإِيْمَانِ“ یعنی اُسے ایمان کا ذائقہ نصیب ہوگا۔(مسلم:34)",
              "title_en": "Passport to Paradise (Three Times - Evening)",
              "translation_en": "I am pleased with Allah as Lord, with Islam as religion, and with Muhammad ﷺ as Prophet.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this three times in the evening, it becomes binding upon Allah to please him on the Day of Resurrection.' (Abu Dawud: 1529, Tirmidhi: 3389)"
            },
            {
              "point_id": "azkar_aifiyat_pooray_badan_3_times_evening",
              "title_urdu": "بدنی عافیت کی دعا اور کفروفقر سے حفاظت (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ عَافِنِيْ فِي بَدَنِيْ، اَللّٰهُمَّ عَافِنِيْ فِي سَمْعِيْ، اَللّٰهُمَّ عَافِنِيْ فِي بَصَرِيْ، لَا إِلٰهَ إِلَّا أَنْتَ اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلٰهَ إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ !میرے جسم میں عافیت نصیب فرما۔اے اللہ !میرےکانوں میں عافیت نصیب فرما۔اے اللہ !میری آنکھ میں عافیت نصیب فرما۔تیرے سوا کوئی معبود نہیں ۔اے اللہ! کفر میں مبتلاء ہونے اور فقر کا شکار ہونے سےمیں تیری پناہ چاہتا ہوں، اے اللہ! میں قبر کے عذاب سے تیری پناہ چاہتا ہوں،تیرےسوا کوئی معبود نہیں۔",
              "fawaid_urdu": "نبی کریم ﷺ صبح شام اِس دُعاء کو پڑھا کرتے تھے۔(ابوداؤد:5090)",
              "title_en": "Well-being for the Entire Body (Three Times - Evening)",
              "translation_en": "O Allah, I ask You for well-being in my hearing, in my sight, in my body. There is no deity worthy of worship except You. O Allah, I seek refuge in You from disbelief and poverty, and I seek refuge in You from the punishment of the grave. There is no deity worthy of worship except You.",
              "fawaid_en": "This supplication seeks comprehensive protection for all bodily faculties and refuge from major spiritual and worldly afflictions. Recite three times in the evening. (Abu Dawud: 5090)"
            },
            {
              "point_id": "azkar_islah_e_ahwaal_evening",
              "title_urdu": "تمام احوال کی اصلاح",
              "arabic_text": "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِي كُلَّهُ ، وَلَا تَكِلْنِيْ إِلىٰ نَفْسِيْ طَرَفَةَ عَيْنٍ",
              "translation_urdu": "اے وہ ذات جو سدا زندہ ہے اور ساری کائنات سنبھالے ہوئے ہے!میں تیری رحمت ہی سے فریاد طلب کرتا ہوں ،میرے تمام اَحوال کی اِصلاح فرما اور ایک پلک جھپکنے کے برابر بھی مجھے میرےنفس کے حوالہ نہ فرما۔",
              "fawaid_urdu": " نبی کریم ﷺ نے اپنی بیٹی حضرت فاطمہ (رض) کویہ کلمات سکھائے تھے اور اُنہیں اِن کلمات کو صبح شام پڑھنے کی وصیت کی تھی۔(مستدرکِ حاکم:2000) حضرت انس﷜فرماتے ہیں کہ ہم (فجر کی نماز کے بعد)نبی کریم ﷺ کے ساتھ مسجد میں تھے یہاں تک کہ سورج طلوع ہوگیا ، ہم آپ ﷺ کے ساتھ نکلے،آپ ﷺ نے حضرت فاطمہ (رض) کے پاس تشریف لے گئے تو دیکھا وہ سورہی ہیں ،آپ ﷺ نے اِرشاد فرمایا:”مَا يُنِيْمُكِ فِيْ هٰذِهِ السَّاعَةِ؟“ اِس وقت کیوں سورہی ہو؟ اُنہوں نے فرمایا: یا رسول اللہ! مجھے کل رات سے بخار ہے،آپ ﷺ نےارشاد فرمایا: وہ دُعا ء کیوں نہیں پڑھی جو میں نے سکھائی تھی ؟حضرت فاطمہ (رض) نے فرمایا : میں بھول گئی ہوں، آپ ﷺ نے اُنہیں اِن کلمات کی تلقین فرمائی ۔(طبرانی اوسط:3565) ایک روایت میں ہے کہ نبی کریم ﷺ کو جب کوئی تکلیف پیش آتی تو آپ یہ کلمہ پڑھا کرتے تھے:”يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ“ اے وہ ذات جو سدا زندہ ہے اور ساری کائنات سنبھالے ہوئے ہے!تیری رحمت ہی سے فریاد طلب کرتا ہوں ۔(ترمذی:3524)",
              "title_en": "Rectification of Affairs (Evening)",
              "translation_en": "O Allah, Knower of the unseen and the witnessed, Creator of the heavens and the earth, Lord and Sovereign of all things, I testify that there is no deity worthy of worship except You. I seek refuge in You from the evil of my soul and from the evil of Satan and his shirk, and from committing wrong against my soul or bringing it upon another Muslim.",
              "fawaid_en": "The Prophet ﷺ commanded that this be recited morning and evening for complete rectification of one's affairs and protection from all forms of evil, both internal and external. (Abu Dawud: 5067, Tirmidhi: 3392)"
            },
            {
              "point_id": "azkar_sayyad_ul_istighfar_evening",
              "title_urdu": "جنت اور شہادت کا پروانہ",
              "arabic_text": "اَللّٰهُمَّ أَنْتَ رَبِّي لاَ إِلٰهَ إِلَّا أَنْتَ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ ، وَأَنَا عَلٰى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَ أَبُوْءُ لَكَ بِذَنْبِيْ فَاغْفِرْ لِيْ ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
              "translation_urdu": " اے اللہ ! آپ ہی میرے پالنہار ہیں ، آپ کے سوا کوئی عبادت کے لائق نہیں ہے۔ آپ ہی نے مجھے پیدا کیا اور میں آپ کا حقیقی غلام ہوں ، اور جہاں تک میرے بس میں ہے مَیں آپ سے کئے ہوئے عہد اور وعدے پر قائم ہوں ، آپ کی پناہ چاہتا ہوں ان تمام بُرے کاموں کے وبال سے جو مَیں نے کئے ہیں، میں آپ کے سامنے آپ کی ان نعمتوں کا اقرار کرتا ہوں جو مجھ پر ہیں ، اور مجھے اعتراف ہے اپنے گناہ کا، اس لئے میرے گناہوں کو معاف کر دیجئے، کیونکہ آپ کے سوا کوئی گناہوں کو نہیں بخشتا۔",
              "fawaid_urdu": " یہ سیّد الاِستغفار کے کلمات ہیں، جسےحدیث کے اندر صبح شام پڑھنے کی تلقین کی گئی ہے اور اِس کی فضیلت حدیث میں یہ ذکر کی گئی ہے: فائدہ: ”مَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ“ جس نے پورے یقین کے ساتھ رات کو پڑھا اورصبح ہونے سے پہلے اُس کی موت آگئی وہ اہلِ جنّت میں سے ہے۔(بخاری:6306) ایک روایت میں ہے :”إِنْ مَاتَ مِنْ لَيْلَتِهِ مَاتَ شَهِيدًا“ اِن کلمات کو کہنے والا اُس رات کو مرگیا تو شہادت کی موت مرے گا۔(عمل الیوم و اللیلۃ:43)",
              "title_en": "Master of Seeking Forgiveness (Evening)",
              "translation_en": "O Allah, You are my Lord, there is no deity worthy of worship except You. You created me and I am Your servant, and I am faithful to my covenant and my promise as much as I can. I seek refuge in You from the evil of what I have done. I acknowledge before You all the blessings You have bestowed upon me, and I confess to You all my sins. So forgive me, for verily none can forgive sins except You.",
              "fawaid_en": "The Prophet ﷺ said: 'This is the master of seeking forgiveness. Whoever says it during the day with firm faith in it and dies that day before evening, will be from the people of Paradise. And whoever says it at night with firm faith in it and dies before morning, will be from the people of Paradise.' (Bukhari: 6306)"
            },
            {
              "point_id": "azkar_aifiyat_dunya_akhira_evening",
              "title_urdu": "ہر طرح کی عافیت کی دعا",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اَللّٰهُمَّ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِيْنِيْ وَ دُنْيَايَ وَأَهْلِي وَمَالِيْ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، وَاحْفَظْنِيْ مِنْم بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِيْنِيْ، وَعَنْ شِمَالِيْ، وَمِنْ فَوْقِيْ، وَ أَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
              "translation_urdu": "اے اللہ! میں تجھ سے دنیا و آخرت میں عفو و درگزر اور عافیت کا سوال کرتا ہوں،اے اللہ! میں تجھ سے اپنے دین ، دنیا ،اہل اور مال میں عفو و درگزر اور عافیت کا سوال کرتاہوں۔اے اللہ! میرے عیوب کی پردہ پوشی فرما،میرے خوف کو اَمن میں تبدیل فرما اور حفاظت فرمامیرے سامنےسے،میرے پیچھے سے،میرے دائیں جانب سے اور میری بائیں جانب سے اور میرے اوپر سے ، اور میں تیری عظمت کی پناہ چاہتا ہوں اِس بات سے کہ میں اپنے نیچے کی جانب سے ہلاک کیا جاؤں۔",
              "fawaid_urdu": "اِن مذکورہ کلمات کا صبح و شام اہتمام کرنا چاہیئے،حدیث میں آتا ہے:نبی کریم ﷺ صبح شام اِن کلمات کو کبھی ترک نہیں فرمایا کرتے تھے۔(ابن ماجہ:3871)",
              "title_en": "Well-being in This World and the Hereafter (Evening)",
              "translation_en": "O Allah, I ask You for well-being in this world and the Hereafter. O Allah, I ask You for forgiveness and well-being in my religion, my worldly affairs, my family, and my wealth. O Allah, conceal my faults and calm my fears. O Allah, protect me from in front of me, from behind me, from my right, from my left, and from above me. I seek refuge in Your Greatness from being destroyed from beneath me.",
              "fawaid_en": "This comprehensive supplication covers all aspects of protection and well-being. The Prophet ﷺ never abandoned this evening supplication. (Abu Dawud: 5074)"
            },
            {
              "point_id": "azkar_khalq_ke_shar_se_hifazat_evening",
              "title_urdu": "ہر قسم کے نقصان سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
              "translation_urdu": "میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں اُس کی پیدا کردہ تمام چیزوں کے شر سے۔",
              "fawaid_urdu": "اِن کلمات کے پڑھنے والے کوکوئی مُوذی چیز نہیں کاٹے گی۔(ترمذی:3604) نبی کریم ﷺکے پاس ایک شخص کو لایا گیا گیا جسے بچھو نے کاٹ لیا تھا ،آپ ﷺنے فرمایا اگر یہ مذکورہ کلمات پڑھ لیتا تو اِسے بچھو نقصان نہیں پہنچاتا ۔(ابوداؤد:3899) حدیث کے راوی حضرت سہیل بن صالح (رض) فرماتے ہیں : ہمارے گھر والوں نے یہ کلمات سیکھ لیے تھے اور روزانہ پڑھتے تھے،ایک دفعہ گھر میں کسی باندی کو بچھو نے ڈس لیا تو اِن کلمات کے پڑھنے کی برکت سے اُسے کوئی درد اور تکلیف تک نہیں ہوئی ۔(ترمذی:3604) اگر کسی جگہ اتر کر مذکورہ کلمات پڑھ لیے جائیں تو وہاں سے کُوچ کرنے تک کوئی نقصان نہیں پہنچے گا۔(الدعوات الکبیر:470)",
              "title_en": "Protection from the Evil of Creation (Evening)",
              "translation_en": "I seek refuge in Allah's perfect words from the evil of what He has created.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this three times in the evening, nothing will harm him that night.' This includes protection from all harmful creatures, jinn, devils, and evil. (Muslim: 2708)"
            },
            {
              "point_id": "azkar_seven_great_virtues_10_times_evening",
              "title_urdu": "سات عظیم فضیلتیں (دس مرتبہ)",
              "arabic_text": "لَا إِلٰهَ إِلَّا اللهُ، وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، يُحْيِيْ وَيُمِيْتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلىٰ كُلِّ شَيْءٍ قَدِيْرٌ",
              "translation_urdu": "اللہ کے سوا کوئی معبود نہیں ،وہ اکیلا ہے ،اُس کا کوئی شریک نہیں ،اُسی کیلئے بادشاہت ہےاور اُسی کیلئے تعریف ہے، ،وہی زندہ کرتا اور وہی موت دیتا ہے، اُسی کے ہاتھ میں ساری بھلائی ہے اور وہ ہر چیز پر قادر ہے۔",
              "fawaid_urdu": "جو شخص مغرب اور فجر کی نماز بعد رخ پھیرنے اور پاؤں موڑنے سے پہلے دس مرتبہ یہ کلمات پڑھ لےاُس کیلئے ہر کلمہ کے بدلہ میں دس نیکیاں لکھی جاتی ہیں ، دس گناہ مٹادیے جاتے ہیں اور دس درجے بلند کیے جاتے ہیں اور یہ کلمات اُس کیلئےہر ناپسندیدہ چیز اور شیطانِ مردود سے بچاؤ کا ذریعہ بن جاتے ہیں اور شرک کے علاوہ کسی گناہ کی مجال نہیں ہوتی کہ اُس کو ہلاک کرڈالے ، اور وہ (کلمات پڑھنے والا )لوگوں میں عمل کے اعتبار سے سب سے افضل ہوتاہے، سوائے اُس شخص کے جو اُس سے آگے بڑھ جائے یعنی اُس سے زیادہ یہ کلمات کہے۔(مسند احمد :17990) خلاصہ یہ ہے کہ اِس کلمے کو دس مرتبہ پڑھنے سے سات عظیم فضیلتیں حاصل ہوتی ہیں : (1) سو نیکیاں ۔ (2) سو گناہ معاف ۔(3) سودرجات بلند۔ (4) ہر قسم کی آفات سے حفاظت۔ (5) شیطان مردود سے حفاظت۔ (6) سوائے شرک کے کوئی گناہ اُس کو ہلاک نہ کر سکے گا ۔(7) وہ اُس دن سب سے افضل عمل کرنے والا ہوگا ۔ سوائے اُس شخص کے جو اُس سے بھی زیادہ پڑھے۔",
              "title_en": "Seven Great Virtues (Ten Times - Evening)",
              "translation_en": "There is no deity worthy of worship except Allah, alone without partner. To Him belongs dominion and to Him belongs all praise, and He is over all things competent.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this ten times after Maghrib prayer, it will be as if he freed four slaves from the children of Ismail (AS), ten good deeds will be written for him, ten sins erased, and he will be elevated ten degrees.' (Authenticated in Sahih al-Jami)"
            },
            {
              "point_id": "azkar_jahannam_se_azadi_7_times_evening",
              "title_urdu": "جہنم سے آزادی کا پروانہ (سات مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ أَجِرْنِيْ مِنَ النَّارِ",
              "translation_urdu": "اے اللہ مجھے آگ (جہنم )سے پناہ عطاء فرما۔",
              "fawaid_urdu": " فجر اور مغرب کی نماز کے بعد سات مرتبہ اِن کلمات کا کہنے والا اُس دن اگر مرجائے تو جہنم سے بری ہوجائےگا ۔(ابواداؤد:5079)",
              "title_en": "Freedom from Hellfire (Seven Times - Evening)",
              "translation_en": "O Allah, I ask You for Paradise and I seek refuge in You from the Fire.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever asks Allah for Paradise three times, Paradise will say: O Allah, admit him to Paradise. And whoever seeks refuge from the Fire three times, the Fire will say: O Allah, protect him from the Fire.' Reciting this seven times provides even greater protection. (Tirmidhi: 2572, authenticated)"
            },
            {
              "point_id": "azkar_shukr_of_niamat_evening",
              "title_urdu": "اللہ کی نعمتوں کا شکر",
              "arabic_text": "اَللّٰهُمَّ مَا أَمْسٰى بِيْ مِنْ نِّعْمَةٍ أَوْ بِأَحَدٍ مِّنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ ، لَا شَرِيْكَ لَكَ ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
              "translation_urdu": " اے اللہ! جو بھی نعمت میرے پاس یا تیری مخلوق میں سے کسی کے پاس بھی شام کے وقت موجود ہے تو وہ صرف تنہا تیری ہی جانب سے ہے،(اُن میں)، تیرا کوئی شریک نہیں،پس تیرے لئے ہی ساری تعریف اور شکر ہے۔",
              "fawaid_urdu": "جس نے مذکورہ کلمات صبح اور شام پڑھ لیے تو اُس کی جانب سے اُس دن اوراُس رات کا شکر اداء ہوجائے گا۔(شعب الایمان:4059)(ابوداؤد:5073)",
              "title_en": "Gratitude for Blessings (Evening)",
              "translation_en": "O Allah, whatever blessing I or any of Your creation has received in this evening is from You alone, without partner. So to You belongs all praise and to You belongs all thanks.",
              "fawaid_en": "This supplication fulfills the obligation of thanking Allah for His blessings. The Prophet ﷺ said: 'Whoever says this in the evening has fulfilled the gratitude due for that day.' (Abu Dawud: 5073)"
            },
            {
              "point_id": "azkar_maghfirat_parwana_evening",
              "title_urdu": "گناہوں کی معافی کا پروانہ",
              "arabic_text": "اَللّٰهُمَّ إِنِّيْ أَمْسَيْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَ مَلَآئِكَتَكَ وَجَمِيْعَ خَلْقِكَ ، أَنَّكَ أَنْتَ اللهُ لَا إِلٰهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ",
              "translation_urdu": " اے اللہ میں نے شام کی ،میں تجھے ،تیرے عرش کو اُٹھانے والے فرشتوں اور تمام فرشتوں کو اور تیری تمام مخلوقات کو اِس بات پر گواہ بناتا ہوں کہ بیشک تو ہی اللہ ہے ،تیرے سوا کوئی معبود نہیں ،تو اکیلا ہے،تیرا کوئی شریک نہیں ، اور (اِس بات پر گواہ بناتا ہوں کہ )حضرت محمّد ﷺ تیرے بندے اور تیرے رسُول ہیں ۔",
              "fawaid_urdu": " ”غُفِرَ لَهُ مَا أَصَابَ تِلْكَ اللَّيْلَةَ“ اِن کلمات کے پڑھنے والے کےاُس رات کے گناہ معاف ہوجائیں گے۔(ابواداؤد:5078) ”أَعْتَقَ اللهُ رُبُعَهُ مِنَ النَّارِ“ایک دفعہ کہنے پر چوتھائی جسم جہنم سے آزاد ہوجائے گا، اور چار مرتبہ کہنے سے مکمل جسم آزاد ہوجائے گا ۔(ابواداؤد:5069)",
              "title_en": "Prophetic Supplication",
              "translation_en": "O Allah, I have reached the evening and call upon You, and call upon the bearers of Your Throne, Your angels, and all of Your creation to witness that You are Allah, none has the right to be worshipped except You, alone, without partner, and that Muhammad is Your slave and Your Messenger.",
              "fawaid_en": "The virtue of these words is that whoever recites them will have his sins of that night forgiven. (Abu Dawud: 5078) In another narration: 'Allah will free a quarter of his body from the Fire.' That is, saying these words once will free a quarter of the body from Hell, and saying them four times will free the entire body. (Abu Dawud: 5069)"
            },
            {
              "point_id": "azkar_most_virtuous_100_times_evening",
              "title_urdu": "سب سے افضل عمل (سو مرتبہ)",
              "arabic_text": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
              "translation_urdu": " اللہ پاک ہے اور اسی کی تعریف ہے۔",
              "fawaid_urdu": "محمد بن عبدالملک اموی عبدالعزیز بن مختار سہیل بن سمی ابوصالح حضرت ابوہریرہ (رض) سے روایت ہے کہ رسول اللہ ﷺ نے ارشاد فرمایا جو آدمی صبح و شام سو مرتبہ (یہ دعا) پڑھتا ہے قیامت کے دن کوئی اس سے زیادہ افضل عمل نہیں لاسکتا سوائے اس کے جس نے اس کے برابر یا اس سے زیادہ پڑھا ہو۔ (صحیح مسلم 6843)",
              "title_en": "Most Virtuous Dhikr (100 Times - Evening)",
              "translation_en": "Glory be to Allah and praise be to Him.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this 100 times a day, his sins will be forgiven even if they were like the foam of the sea.' This is among the most virtuous and easiest forms of dhikr. (Bukhari: 6405, Muslim: 2691)"
            },
            {
              "point_id": "azkar_itmaam_e_niamat_3_times_evening",
              "title_urdu": "اللہ کی نعمتوں کی تکمیل (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَمْسَيْتُ مِنْكَ فِي نِعْمَةٍ وَّعَافِيَةٍ وَّسِتْرٍ، فَأَتِمَّ عَلَيَّ نِعْمَتَكَ وَ عَافِيَتَكَ وَ سِتْرَكَ فِي الدُّنْيَا وَالْآخِرَةِ",
              "translation_urdu": " اے اللہ ! میں نے تیری جانب سے نعمت،عافیت اورپردہ پوشی کی حالت میں شام کی ، پس تو مجھ پر اپنی نعمت،عافیت اور پردہ پوشی کو دنیا و آخرت میں مکمل فرما۔",
              "fawaid_urdu": "شام کو تین مرتبہ پڑھنے والے کے بارے میں آپ ﷺ نے اِرشاد فرمایا: ”كَانَ حَقًّا عَلَى اللهِ عَزَّ وَجَلَّ أَنْ يُتِمَّ عَلَيْهِ نِعْمَتَهُ“ اللہ نے اپنے ذمّہ لازم کیا ہے کہ اُس کے اوپر اپنی نعمتیں مکمل فرمادیں گے۔(ابن سنی:55)",
              "title_en": "Completion of Blessings (Three Times - Evening)",
              "translation_en": "All praise is for Allah who fed us, gave us drink, sufficed us, and gave us shelter. How many are those who have no one to suffice them or give them shelter.",
              "fawaid_en": "This supplication acknowledges Allah's comprehensive blessings and creates gratitude in the heart. The Prophet ﷺ would recite this three times in the evening. (Muslim: 2715)"
            },
            {
              "point_id": "azkar_best_rizq_evening",
              "title_urdu": "بہترین رزق کی دعا",
              "arabic_text": "مَا شَاءَ اللهُ ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ ، أَشْهَدُ أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
              "translation_urdu": " اللہ جو چاہے،گناہوں سے بچنے کی طاقت اور نیک کام کرنے کی قوّت صرف اللہ تعالیٰ ہی کی جانب سے ہے، میں گواہی دیتا ہوں کہ اللہ چیز پر قدرت رکھنے والا ہے۔",
              "fawaid_urdu": " شام کے وقت مذکورہ کلمات پڑھنے والے کے بارے میں آپ ﷺ نے اِرشاد فرمایا:”رُزِقَ خَيْرَ تِلْكَ اللَّيْلَةِ وَصُرِفَ عَنْهُ شَرُّهَا“ یعنی اُسے اُس رات کا بہترین رزق عطاء کیا جائے گا اور اُس رات کے شرکو اُس سے دور کردیا جائےگا ۔(عمل الیوم و اللیلۃ لابن السنی:53)",
              "title_en": "Prophetic Supplication",
              "translation_en": "What Allah wills (will come to pass). There is no power and no strength except with Allah. I bear witness that Allah has power over all things.",
              "fawaid_en": "The Prophet ﷺ said about whoever recites these words in the evening: 'He will be granted the best provision of that night, and its evil will be averted from him.' (Ibn As-Sunni: 53)"
            },
            {
              "point_id": "azkar_maghfirat_ka_parwana_evening",
              "title_urdu": "مغفرت کا پروانہ",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ رَبِّيْ لَا أُشْرِكُ بِهِ شَيْئًا، وَأَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا اللهُ",
              "translation_urdu": "تمام تعریفیں اللہ ہی کیلئے ہیں جو میرا پروردگار ہے،میں اُس کے ساتھ کسی بھی چیز کو شریک نہیں ٹہراتا، اور میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں ہے۔",
              "fawaid_urdu": " مذکورہ کلمات شام کے وقت میں پڑھنے والے کے بارے میں آپ ﷺ نے اِرشاد فرمایا: ”بَاتَ يُغْفَرُ لَهُ ذُنُوبُهُ حَتَّى يُصْبِحَ“ یعنی وہ صبح ہونے تک رات بھر اِس حالت میں گزارتا ہے کہ اُس کی مغفرت کردی جاتی ہے۔(طبرانی کبیر:635)",
              "title_en": "Prophetic Supplication",
              "translation_en": "All praise is for Allah, my Lord. I do not associate anything with Him, and I bear witness that there is no deity worthy of worship except Allah.",
              "fawaid_en": "The Prophet ﷺ said about whoever says these words in the evening: 'His sins will continue to be forgiven until the morning.' (At-Tabarani Al-Kabir: 635)"
            },
            {
              "point_id": "azkar_hifazat_nazar_e_bad_evening",
              "title_urdu": "نظرِ بد سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَّهَامَّةٍ، وَّمِنْ كُلِّ عَيْنٍ لَّامَّةٍ",
              "translation_urdu": "میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں ہر شیطان اور ڈسنے والے جانور سے اور ہر ملامت کرنے والی آنکھ سے۔",
              "fawaid_urdu": "مذکورہ کلمات نظرِ بد سے حفاظت کیلئے بہترین کلمات ہیں ،نبی کریم ﷺ حضرت حسن و حُسین (رض) کو مذکورہ کلمات کے ذریعہ اللہ تعالیٰ کی پناہ میں دیتے تھے، اور فرماتے تھے کہ حضرت ابراہیم علیہ السلام بھی اپنے بیٹوں حضرت اسحاق اور حضرت اِسماعیل علیہ السلام کو اِنہی کلمات کے ذریعہ اللہ کی پناہ میں دیتے تھے۔(بخاری:3371)",
              "title_en": "Protection from Evil Eye (Evening)",
              "translation_en": "I seek refuge in Allah's perfect words from every devil and poisonous creature, and from every evil eye.",
              "fawaid_en": "The Prophet ﷺ used to seek refuge with these words and taught his grandchildren to recite them for protection from the evil eye and all harm. (Bukhari: 3371)"
            },
            {
              "point_id": "azkar_hifazat_khauf_ghabrahat_evening",
              "title_urdu": "خوف و گھبراہٹ سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ ، وَمِنْ هَمَزَاتِ الشَّيَاطِيْنِ وَ أَنْ يَّحْضُرُونِ",
              "translation_urdu": " میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں اُس کے غضب وغصہ سےاوراس کے عذاب سے اور اس کےبندوں کے شرسے اورشیاطین کے وسوسوں سےاور اے میرے پروردگار میں تیری پناہ چاہتا ہوں اس سےکہ وہ (شیطان) میرےپاس بھی آئیں۔",
              "fawaid_urdu": " مذکورہ کلمات خوف و گھبراہٹ سے حفاظت اور اُس کیفیت کو دور کرنے کیلئے بڑے مفید اور بہترین ہیں ،نبی کریم ﷺ خوف و گھبراہٹ کی حالت میں اور بالخصوص نیند میں ڈرجانے اور خوف و گھبراہٹ کا شکار ہوجانے کی صورت میں اِن کلمات کو پڑھنے کی تلقین فرمایا کرتے تھے۔(ابوداؤد: 3893)(ترمذی:3528) حضرت عبد اللہ بن عمرو بن العاص (رض) کے بارے میں آتا ہے کہ وہ اپنی بالغ اولاد کو اِن کلمات کے پڑھنے کی تلقین فرمایا کرتے تھے اور نابالغ کم سِن اولاد کے گلے میں یہ کلمات لکھ کر ڈال دیا کرتے تھے۔(ترمذی:3528)",
              "title_en": "Protection from Fear and Anxiety (Evening)",
              "translation_en": "In the name of Allah, there is no power and no strength except with Allah.",
              "fawaid_en": "This powerful dhikr removes fear and anxiety by acknowledging that all power belongs to Allah alone. The Prophet ﷺ taught this as evening protection. (Authenticated)"
            },
            {
              "point_id": "azkar_hifazat_shaitain_jinnat_evening",
              "title_urdu": "شیاطین و جنات سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ وَّ لَا فَاجِرٌ مِنْ شَرِّ مَا خَلَقَ، وَ ذَرَأَ وَ بَرَأَ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ ، وَمِنْ شَرِّ مَا يَعْرُجُ فِيهَا، وَمِنْ شَرِّ مَا ذَرَأَ فِي الْأَرْضِ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقًا يَّطْرُقُ بِخَيْرٍ، يَّا رَحْمٰنُ",
              "translation_urdu": " میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں جن سے نہ کوئی نیک آگے بڑھ سکتا ہے نہ گناہ گار، ہراُس چیزکےشرسےجس کو اللہ نے پیدا کیا ، پھیلایا اور وجود دیا،اور ہر اُس چیز کے شر سے جوآسمان سے اترتی ہےاورجوآسمان پرچڑھتی ہےاورہر اس چیزکےشرسےجوزمین کےاندرپیداہوتی ہےاورجوزمین سے (پھوٹ کر) نکلتی ہےاوررات دن کےفتنوں کےشر سے اور رات دن کے (ناگہانی) واقعات اورحادثوں کےشرسے،بجز اس اچھے واقعہ کےجوخیر کولائے (کہ وہ تو سراسر رحمت ہے) اے بہت رحم کرنے والے۔",
              "fawaid_urdu": "حضرت جبریل علیہ السلام نےشیاطین و جنّات کے نقصان سے بچنے کیلئے مذکورہ کلمات نبی کریم ﷺ کو سکھائے تھے۔(مسند احمد:15461)",
              "title_en": "Protection from Devils and Jinn (Evening)",
              "translation_en": "I seek refuge in Allah's perfect words from the evil of what He has created.",
              "fawaid_en": "Reciting this three times in the evening provides complete protection from jinn, devils, and all harmful creatures throughout the night. (Muslim: 2708)"
            },
            {
              "point_id": "azkar_hifazat_jadoo_sehar_evening",
              "title_urdu": "جادو اور سحر سے حفاظت",
              "arabic_text": "أَعُوذُ بِوَجْهِ اللهِ الْعَظِيْمِ الَّذِيْ لَيْسَ شَيْءٌ أَعْظَمَ مِنْهُ ، وَ بِكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِيْ لاَ يُجَاوِزُهُنَّ بَرٌّ وَّ لاَ فَاجِرٌ، وَ بِأَسْمَاءِ اللهِ الْحُسْنٰى كُلِّهَا مَا عَلِمْتُ مِنْهَا وَمَا لَمْ أَعْلَمْ، مِنْ شَرِّ مَا خَلَقَ وَ ذَرَأَ وَ بَرَأَ",
              "translation_urdu": "میں اللہ عظیم کی پناہ میں آتا ہوں جس سے کوئی چیز بڑی نہیں ، اور اُس کےتمام کلمات(یعنی اَسماء و صفات) کی پناہ میں آتا ہوں جن سے نہ کوئی نیک بچ سکتا ہے نہ بد، اور اللہ تعالیٰ کےتمام بہترین ناموں کی(پناہ میں آتا ہوں) جن کو میں جانتا ہوں اور جن کو میں نہیں جانتا، ہراُس چیزکےشرسےجس کو اللہ نے پیدا کیا ،پھیلایا اور وجود دیا۔",
              "fawaid_urdu": " مذکورہ کلمات جادو اور سحر کے اَثرات سے بچنے کیلئے بہت ہی مفید اور بہترین کلمات ہیں۔ حضرت کعب اَحبار (رض) اِن کلمات کو پڑھتے اور فرماتے تھے: ”لَوْلاَ كَلِمَاتٌ أَقُولُهُنَّ لَجَعَلَتْنِي يَهُودُ حِمَارًا“ اگر میں اِن مذکورہ کلمات کو نہ پڑھتا تو یہود(جادو کے ذریعہ) مجھے گدھا بنادیتے۔(مؤطا مالک:2002)",
              "title_en": "Protection from Magic and Sorcery (Evening)",
              "translation_en": "I seek refuge in the perfect words of Allah from His anger, His punishment, the evil of His servants, and from the whisperings of devils and their presence.",
              "fawaid_en": "This comprehensive supplication protects from magic, sorcery, evil eye, and all forms of spiritual harm throughout the night. (Abu Dawud: 3893, Tirmidhi: 3528)"
            },
            {
              "point_id": "azkar_hifazat_shirk_3_times_evening",
              "title_urdu": "شرک سے حفاظت (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
              "translation_urdu": " اے اللہ میں تیری پناہ میں آتا ہوں اِس سے کہ میں جانتے بوجھتے ہوئے تیرے ساتھ کسی کو شریک ٹہراؤں اور میں تجھ سے مغفرت چاہتاہوں اُس (شرک) سے جس کو میں نہیں جانتا۔",
              "fawaid_urdu": " اِس اُمّت کے اندر چیونٹی کی آہٹ سے بھی زیادہ مخفی اور پوشیدہ شرک رکھا گیا ہے، اور اُس چھوٹے بڑے تمام طرح کے شرک سے بچنے کیلئے نبی کریم ﷺ نے مذکورہ کلمات تین مرتبہ روزانہ پڑھنے کی تلقین فرمائی ہے۔(مسند ابویعلیٰ موصلی:58)",
              "title_en": "Protection from Shirk (Three Times - Evening)",
              "translation_en": "O Allah, I seek refuge in You from knowingly associating anything with You, and I seek Your forgiveness for what I do not know.",
              "fawaid_en": "This evening supplication protects from both obvious and hidden forms of shirk throughout the night. Recite three times. (Musnad Ahmad: 19621)"
            },
            {
              "point_id": "azkar_hifazat_shaitaan_samee_ul_aleem_3_times_evening",
              "title_urdu": "شیطان سے حفاظت (تین مرتبہ)",
              "arabic_text": "أَعُوْذُ بِاللهِ السَّمِيْعِ العَلِيْمِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
              "translation_urdu": " میں شیطان مَردود سےاللہ تعالیٰ کی پناہ میں آتا ہوں جو سننے اور جاننے والا ہے ۔",
              "fawaid_urdu": "حدیث کے مطابق مذکورہ تعوّذ صبح کو پڑھنے والا شام تک شیطان سے محفوظ ہوجاتا ہے۔(عمل الیوم و اللیلۃ لابن السنی:49) اور اگر تعوّذ کے اِنہی کلمات کو تین مرتبہ پڑھنے کےبعد سورۃ الحشر کی آخری تین آیات یعنی ”هُوَ اللهُ الَّذِيْ لَا إِلٰهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ“ سے سورت کے آخر تک پڑھ لی جائیں تو حدیث کے مطابق اگر صبح کے وقت پڑھا تو شام تک ستر ہزار فرشتے اُس کیلئے رحمت کی دُعاء کرتے رہتے ہیں اور اگر وہ اُس دن مرجائے تو شہادت کی موت مرتا ہے۔(ترمذی:2922)",
              "title_en": "Protection from Satan - The All-Hearing, All-Knowing (Three Times - Evening)",
              "translation_en": "I seek refuge in Allah, the All-Hearing, the All-Knowing, from the accursed Satan, from his prodding, his blowing, and his whispering.",
              "fawaid_en": "This comprehensive evening protection from Satan's three types of attacks provides safety throughout the night. Recite three times. (Abu Dawud: 1547, Tirmidhi: 3455)"
            },
            {
              "point_id": "azkar_hifazat_masaib_evening",
              "title_urdu": "مصائب و حوادث سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ أَنْتَ رَبِّي، لَا إِلٰهَ إِلَّا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْكَرِيمِ، مَا شَاءَ اللهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، أَعْلَمُ أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ، وَأَنَّ اللهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا ، اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا إِنَّ رَبِّي عَلٰى صِرَاطٍ مُّسْتَقِيمٍ",
              "translation_urdu": "اے اللہ!تو میرا پروردگارہے،تیرے سوا کوئی معبود نہیں ،میں نے تجھ ہی پر بھروسہ کیا اور تو بزرگی والے عرش کا ربّ ہے،جو اللہ نے چاہا وہ ہوگیا اور جو نہیں چاہا نہیں ہوا،گناہوں سے بچنے کی طاقت اور نیک کام کرنے کی قوّت صرف اللہ ہی کی جانب سے ہے جو عظمت والا بلند و برتر ہے۔میں جانتا ہوں کہ اللہ ہر چیز پر قدرت رکھتا ہےاور بیشک اللہ تعالیٰ نے علم کے اعتبار سے ہر چیز کا اِحاطہ کررکھا ہے۔اے اللہ میں آپ کی پناہ چاہتا ہوں اپنے نفس کے شر سے اور ہر اُس زمین پر چلنے والے جاندار کے شرّ سے جس کی پیشانی آپ کے قبضہ میں ہے، بیشک میرا ربّ سیدھی راہ پر ہے۔",
              "fawaid_urdu": " یہ دُعاءِ ابی درداء کے کلمات ہیں، جو مصائب و حوادث سے حفاظت کیلئے ایک بہترین دُعاء ہے ،صبح شام اِس کے پڑھنے کا اہتمام کرنا چاہیئے ،حدیث کے مطابق یہ کلمات اگر کوئی شام کے وقت پڑھ لے تو ”لَمْ تُصِبْهُ مُصِيْبَةٌ حَتَّى يُصْبِحَ“ یعنی صبح ہونے تک اُسے کوئی مصیبت نہ پہنچی گی۔(الدعاء للطبرانی:343) (ابن السنی:57)",
              "title_en": "Protection from Calamities (Evening)",
              "translation_en": "O Allah, I ask You for well-being in this world and the Hereafter. O Allah, I ask You for forgiveness and well-being in my religion, my worldly affairs, my family, and my wealth. O Allah, conceal my faults and calm my fears. O Allah, protect me from in front of me, from behind me, from my right, from my left, and from above me. I seek refuge in Your Greatness from being destroyed from beneath me.",
              "fawaid_en": "This comprehensive evening supplication provides protection from all forms of calamities throughout the night. (Abu Dawud: 5074, Ibn Majah: 3871)"
            },
            {
              "point_id": "azkar_hifazat_gham_o_fikr_evening",
              "title_urdu": "غم اور فکر سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ رَبَّ السَّمٰوَاتِ السَّبْعِ وَ رَبَّ الْعَرْشِ الْعَظِيمِ، اِكْفِنِيْ كُلَّ مُهِمٍّ مِّنْ حَيْثُ شِئْتَ ، وَ كَيْفَ شِئْتَ، وَ مِنْ أَيْنَ شِئْتَ. حَسْبِيَ اللهُ لِدِيْنِيْ، حَسْبِيَ اللهُ لِدُنْيَايَ حَسْبِيَ اللهُ لِمَا أَهَمَّنِيْ، حَسْبِيَ اللهُ لِمَنْ بَغٰى عَلَيَّ، حَسْبِيَ اللهُ لِمَنْ حَسَدَنِيْ حَسْبِيَ اللهُ لِمَنْ كَادَنِيْ بِسُوْءٍ، حَسْبِيَ اللهُ عِنْدَ الْمَوْتِ، حَسْبِيَ اللهُ عِنْدَ الْمَسْأَلَةِ فِي الْقَبْرِ، حَسْبِيَ اللهُ عِنْدَ الْمِيْزَانِ، حَسْبِيَ اللهُ عِنْدَ الصِّرَاطِ، حَسْبِيَ اللهُ لَا إِلٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
              "translation_urdu": "اے اللہ !اے ساتوں آسمانوں اور عظیم عرش کے پروردگار!میرے ہر اہم کام کیلئے کافی ہوجاجس طرح تو چاہے،جس جگہ سے تو چاہے اورجہاں کہیں تو چاہے۔ اللہ میرے دین کیلئے کافی ہے، اللہ میری دنیاکیلئے کافی ہے،اللہ میری فکروں کیلئے کافی ہے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو مجھ پر زیادتی کرے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو مجھ سے حسد کرے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو میرے خلاف بُری چال چلے،اللہ میرے لئے کافی ہے موت کے وقت،اللہ میرے لئے کافی ہےقبر میں(مُنکَر نکیر کے) سوال کے وقت،اللہ میرے لئے کافی ہےنامہ عمل تُلنے کے وقت،اللہ میرے لئے کافی ہےپُل صِراط(پر سے گزرنے)کے وقت، اللہ میرے لئے کافی ہے،اُس کے سوا کوئی معبود نہیں ،اُسی پر میں نے بھروسہ کیا اور وہ عرشِ عظیم کا مالک ہے۔",
              "fawaid_urdu": "اِس دُعاء کےابتدائی کلمات یعنی ”وَ مِنْ أَيْنَ شِئْتَ“ تک کے الفاظ کے بارے میں حدیث میں یہ فضیلت ذکر کی گئی ہے کہ جو یہ کلمات پڑھ لے اللہ تبارک و تعالیٰ اُس کے غم اور فکر کو دور کردیتے ہیں۔(مکارم الاخلاق للخرائطی:1037) اور”حَسْبِيَ اللهُ“سے آگے کےکلمات کی فضیلت حدیث میں یہ ذکر کی گئی ہےکہ: جو شخص نمازوں کے بالخصوص فجر کی نماز کے بعد مذکورہ کلمات پڑھ لے تو اللہ تبارک و تعالیٰ اُس کیلئے دنیا و آخرت کے وہ تمام مراحل جو اِس دُعاء میں ذکر کیے گئے ہیں اُن میں کافی ہوجاتے ہیں۔(نوادرالأصول ،حکیم ترمذی:2/274) (الدر المنثور:2/390)",
              "title_en": "Protection from Grief and Worry (Evening)",
              "translation_en": "O Allah, I am Your servant, son of Your servant, son of Your maidservant. My forelock is in Your hand. Your command over me is forever executed and Your decree over me is just. I ask You by every name belonging to You which You have named Yourself with, or revealed in Your Book, or taught to any of Your creation, or have preserved in the knowledge of the Unseen with You, that You make the Quran the life of my heart and the light of my chest, and a departure for my sorrow and a release for my anxiety.",
              "fawaid_en": "The Prophet ﷺ said this supplication removes all grief and worry, replacing it with joy. Recite in the evening for peace of mind throughout the night. (Musnad Ahmad: 3712)"
            },
            {
              "point_id": "azkar_hifazat_aafat",
              "title_urdu": "آفات سے حفاظت",
              "arabic_text": "بِسْمِ اللهِ عَلٰى نَفْسِيْ وَدِيْنْي بِسْمِ اللهِ عَلٰى اَهْلِيْ وَ مَالِيْ وَ وَلَدِيْ بِسْمِ اللهِ عَلٰى مَا اَعطَانِيْ، اَللهُ اَللهُ رَبِّيْ لَا اُشْرِكُ بِهِ شَيْئاً اَللهُ أَكْبَرُ اَللهُ أَكْبَرُ اَللهُ أَكْبَرُ وَ أَعَزُّ وَ أَجَلُّ مِمَّا أَخَافُ وَ أَحْذَرُ عَزَّ جَارُكَ وَ جَلَّ ثَنَاؤُكَ وَ لَا اِلٰهَ غَيْرُكَ اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِيْ وَ مِنْ شَرِّ كُلِّ شَيْطَانٍ مَّرِيْدٍ وَ مِنْ شَرِّ كُلِّ جَبّارٍ عَنِيْدٍ ، فَإِنْ تَوَلَّوْا فَقُلْ حَسْبِيَ اللهُ لَا إِلٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ إِنَّ وَلِيِّيَ اللهُ الَّذِيْ نَزَّلَ الْكِتَابَ وَهُوَ يَتَوَلَّى الصَّالِحِيْنَ",
              "translation_urdu": "اللہ تعالیٰ کے نام کے ساتھ میری جان اور دین کی حفاظت ہے،اللہ تعالیٰ ہی کے نام سے میرے اہل و مال اور اولاد کی حفاظت ہے،اللہ تعالیٰ ہی کے نام اُن سب نعمتوں کی حفاظت ہےجو میرے پروردگار نے مجھے عطاء فرمائی ہوئی ہیں ،اللہ تعالیٰ ہی میرا پروردگار ہے،میں اُس کے ساتھ کسی بھی چیز کو شریک نہیں کرتا ۔اللہ تعالیٰ سب سے بڑا ہے،اللہ تعالیٰ سب سے بڑا ہے،اللہ تعالیٰ سب سے بڑا ہے،اللہ تعالیٰ ہر اُس چیز پر غالب اور بلند مرتبہ ہےجس سے میں خوف کھاتا اور ڈرتا ہوں۔آپ کا پناہ دیا ہو امعزّز ہے اور آپ کی تعریف بلند ہے،آپ کے سوا کوئی معبود نہیں ۔ اے اللہ! میں آپ کی پناہ لیتا ہوں اپنے نفس کے شر سے ،اور سرکش شیطان کے شر سے اور ہر ظالم ،ضدی کے شر سے ۔پھر بھی اگر یہ لوگ منہ موڑیں تو (اے رسول!ان سے )کہہ دو کہ میرے لیے اللہ ہی کافی ہے،اس کے سوا کوئی معبود نہیں ،اُسی پر میں نے بھروسہ کیا ہے اور وہی عرشِ عظیم کا مالک ہے۔بےشک میرا پروردگار اللہ تعالیٰ ہےجس نے کتاب کو اُتارا اور وہی نیک لوگوں کا مددگار ہے۔",
              "fawaid_urdu": "یہ حفاظت کی ایک بہترین دُعاء ہےجس میں بہت ہی جامع اور خوبصورت انداز میں حفاظت کی دعائیں جمع کی گئی ہیں ، اور اس کا کچھ حصہ روایات میں بھی ہے ، مثلاً حدیث میں ہے :کسی شخص نےآپ ﷺ سے اپنے اوپر پیش آنے والی آفات کا تذکرہ کیا تو آپ ﷺ نے فرمایا کہ صبح کے وقت میں یہ کلمات:”بِسْمِ اللهِ عَلٰى نَفْسِي وَأَهْلِي وَمَالِي“پڑھ لیا کرو،اُس شخص نے اِن کلمات کا اہتمام کیا تو اُس کی آفات دور ہوگئیں۔(ابن سنی:51) اوریہی وہ کلمات ہیں جو نبی کریم ﷺ نےمعیشت کے تنگ ہونے پر گھر سے نکلتے ہوئے پڑھنے کی تعلیم دی ہے۔(ابن سنی:350) اس کے علاوہ دُعاء میں مذکورہ کلمات”اَللهُ اللهُ رَبِّيْ لَا اُشْرِكُ بِهِ شَيْئاً“ وہ مبارک کلمات ہیں جن کو نبی کریم ﷺ نےحضرت اَسماء بنت عُمیس (رض) کو مصیبت و پریشانی کے موقع پر پڑھنے کی تلقین فرمائی تھی۔(ابوداؤد:1525)",
              "title_en": "Protection from Afflictions",
              "translation_en": "O Allah, I seek refuge in You from anxiety and sorrow, weakness and laziness, miserliness and cowardice, the burden of debts and from being overpowered by men.",
              "fawaid_en": "This is among the most comprehensive supplications taught by the Prophet ﷺ for protection from eight major afflictions that plague humanity. (Bukhari: 6369)"
            },
            {
              "point_id": "azkar_safe_till_morning",
              "title_urdu": "صبح تک مامون و محفوظ",
              "arabic_text": "رَبِّيَ اللهُ الَّذِيْ لَا إِلٰهَ إِلَّا هُوَ الْعَلِيُّ الْعَظِيْمُ، تَوَكَّلْتُ عَلَى اللهِ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ، مَا شَاءَ اللهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، أَعْلَمُ أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ وَّ أَنَّ اللهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا",
              "translation_urdu": "میرا پروردگار اللہ ہے،جس کے سوا کوئی معبود نہیں ،وہ بلند و برتر اور عظمت والا ہے،اللہ پر ہی میں نے بھروسہ کیا اور وہ عرشِ عظیم کا مالک ہے،جو اللہ نے چاہا وہ ہوا اور جو اُس نے نہیں چاہا وہ نہیں ہوا،میں جانتا ہوں کہ اللہ ہرچیز پر قادر ہے،اور یہ کہ اللہ تعالیٰ نے ہر چیز کا علم کے اعتبار سے اِحاطہ کررکھا ہے۔",
              "fawaid_urdu": "اِن کلمات کی فضیلت یہ ذکر کی گئی ہے کہ اِن کو صبح شام کہنے والا اُس دن مرجائے تو جنّت میں داخل ہوگا۔(عمل الیوم و اللیلۃ لابن السنی:42) اِسی سے ملتے جلتے الفاظ پر مشتمل ایک اور بھی دُعاء حدیث میں ذکر کی گئی ہے ،اُسے بھی پڑھ لینا چاہیئے: ”سُبْحَانَ اللهِ وَبِحَمْدِهِ، وَلَا قُوَّةَ إِلَّا بِاللهِ ، مَا شَاءَ اللهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، أَعْلَمُ أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ، وَّ أَنَّ اللهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا“ ترجمہ:اللہ کی ذات پاک ہےاور تمام تعریفیں اُسی کیلئے ہے،اور قوّت صرف اللہ ہی کی جانب سے ہے،جو اللہ نے چاہا وہ ہوگیا اور جو اُس نے نہیں چاہا وہ نہیں ہوا،میں جانتا ہوں کہ اللہ ہرچیز پر قادر ہے،اور یہ کہ اللہ تعالیٰ نے ہر چیز کا علم کے اعتبار سے اِحاطہ کررکھا ہے۔ فائدہ:”مَنْ قَالَهُنَّ حِينَ يُمْسِيَ،حُفِظَ حَتَّى يُصْبِحَ“ اِن کلمات کوشام کو کہنے والا صبح تک محفوظ و مأمون رہتا ہے۔(سنن کبریٰ نسائی:9756)",
              "title_en": "Safety Until Morning",
              "translation_en": "We have entered the evening and sovereignty belongs to Allah. All praise is for Allah. There is no deity worthy of worship except Allah, alone without partner. To Him belongs dominion and to Him belongs all praise, and He is over all things competent. My Lord, I ask You for the good of this night and the good of what follows it, and I seek refuge in You from the evil of this night and the evil of what follows it. My Lord, I seek refuge in You from laziness and bad old age. My Lord, I seek refuge in You from punishment in the Fire and punishment in the grave.",
              "fawaid_en": "This comprehensive evening supplication ensures safety and protection until morning. The Prophet ﷺ never abandoned this practice. (Muslim: 2723)"
            },
            {
              "point_id": "azkar_jannat_parwana_3_times_evening_2",
              "title_urdu": "جنت کا پروانہ (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ لَكَ الْحَمْدُ لَا إِلٰهَ إِلَّا أَنْتَ ، أَنْتَ رَبِّي ، وَ أَنَا عَبْدُكَ ، آمَنْتُ بِكَ مُخْلِصًا لَّكَ دِيْنِيْ ، أَمْسَيْتُ عَلٰى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ ، أَتُوبُ إِلَيْكَ مِنْ شَرِّ عَمَلِي، وَأَسْتَغْفِرُكَ لِذُنُوبِيْ الَّتِي لَا يَغْفِرُهَا إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ! تیرے لئے ہی ساری تعریفیں ہیں ،تیرے سوا کوئی معبود نہیں ،تو میرا ربّ اور میں تیرا بندہ ہوں،میں تجھ پر اپنے دین کو خالص کرتے ہوئے ایمان لایا ،میں نے اپنی اِستطاعت کے مطابق تیرے عہد اور وعدہ کے(پورا کرنے کے) ساتھ شام کی ، میں تیری جانب رجوع کرتا ہوں اپنے عمل کے شر سے اور تجھ سے اپنے گناہوں کی معافی مانگتا ہوں، وہ تمام گناہ جو تیرے سوا کوئی معاف نہیں کرسکتا ۔",
              "fawaid_urdu": " حضرت ابوامامہ (رض) فرماتے ہیں کہ نبی کریم ﷺ کایہ اِرشاد نقل فرماتے ہیں:جس نے یہ مذکورہ بالا کلمات شام کے وقت تین مرتبہ پڑھے ،پھر اُس رات میں انتقال کرجائے تو وہ ضرور جنّت میں داخل ہوگا۔راوی کہتے ہیں کہ آپ ﷺ جتنا اِس پر قسم کھاتے تھے اِتنا کسی اور چیز پر قسم نہ کھاتے ، اور آپ ﷺ قسم کھاکر یہ فرماتے تھے :”وَإِنْ قَالَهَا حِينَ يُمْسِي فَتُوُفِّيَ فِي تِلْكَ اللَّيْلَةِ دَخَلَ الْجَنَّةَ“ اللہ کی قسم! اگر کوئی بندہ شام کے وقت یہ کلمات پڑھے اور پھر اُسی رات انتقال کرجائے تو وہ جنّت میں داخل ہوگا۔(طبرانی اوسط:3096)",
              "title_en": "Second Passport to Paradise (Three Times - Evening)",
              "translation_en": "I am pleased with Allah as Lord, with Islam as religion, and with Muhammad ﷺ as Prophet.",
              "fawaid_en": "This powerful declaration of faith, when recited with certainty, guarantees Paradise. Recite three times in the evening. (Abu Dawud: 1529, Tirmidhi: 3389)"
            },
            {
              "point_id": "azkar_hifazat_khalq_se_evening_2",
              "title_urdu": "ساری مخلوقات کے شر سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ رَبَّ السَّمٰوَاتِ السَّبْعِ وَمَا أَظَلَّتْ ، وَرَبَّ الْأَرْضِيْنَ وَمَا أَقَلَّتْ ، وَرَبَّ الشَّيَاطِيْنِ وَمَا أَضَلَّتْ ، كُنْ لِّي جَارًا مِّنْ شَرِّ خَلْقِكَ كُلِّهِمْ جَمِيْعًا أَنْ يَّفْرُطَ عَلَيَّ أَحَدٌ مِّنْهُمْ أَوْ أَنْ يَّبْغِيَ ، عَزَّ جَارُكَ ، وَ جَلَّ ثَنَاؤُكَ ، وَ لَا إِلٰهَ غَيْرُكَ ، وَ لَا إِلٰهَ إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ! اے ساتوں آسمانوں اُن تمام چیزوں کے پروردگار جن پر وہ آسمان سایہ فگن ہیں ،اور اے زمینوں اور اُن تمام چیزوں کے پروردگار جنہیں اُن زمینوں نے اُٹھایا ہوا ہے، اور اے شیطانوں اور اُن تمام چیزوں کے پروردگار جنہیں اُن شیاطین نے گمراہ کیا ہے،تو مجھے اپنی ساری کی ساری مخلوقات کے شر سے پناہ دیدے اِس بات سے کہ اُن میں سے کوئی مجھ زیادتی یا ظلم کرے ،تیری پناہ غالب ہے،تیری تعریف بہت بڑی ہے اور تیرے علاوہ کوئی معبود نہیں اور معبود صرف توہی ہے ۔",
              "fawaid_urdu": "یہ دُعاء نبی کریم ﷺ نے بستر پر جاتے ہوئے سونے سے پہلے پڑھنے کی تعلیم دی ہے۔ (ترمذی:3523)اور حفاظت کےاعتبار سے اِس کا معنی اتنا خوبصورت اور بہترین ہےکہ اگر صبح اور شام بھی یہ دُعاء پڑھ لی جائے تو بہت ہی خوب ہے۔",
              "title_en": "Protection from All Creation (Evening - Second)",
              "translation_en": "We have entered the evening upon the natural religion of Islam, upon the word of sincerity, upon the religion of our Prophet Muhammad ﷺ, and upon the way of our father Ibrahim, who was upright and Muslim, and was not among the polytheists.",
              "fawaid_en": "This evening renewal of faith provides protection from all creation through adherence to pure monotheism. (Sunan al-Kubra by Nasa'i: 9745)"
            },
            {
              "point_id": "azkar_talafi_mamoolat_surah_room_evening",
              "title_urdu": "تمام معمولات کی تلافی",
              "arabic_text": "فَسُبْحَانَ اللهِ حِيْنَ تُمْسُوْنَ وَ حِيْنَ تُصْبِحُوْنَ وَ لَهُ الْحَمْدُ فِي السَّمٰوَاتِ وَ الْأَرْضِ وَ عَشِيًّا وَّ حِيْنَ تُظْهِرُوْنَ يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَ يُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَ يُحْيِ الْأَرْضَ بَعْدَ مَوْتِهَا وَكَذٰلِكَ تُخْرَجُونَ“۔(سورۃ الرّوم:17 ،18 ،19)",
              "translation_urdu": "لہٰذا اللہ کی تسبیح بیان کرواُس وقت بھی جب تمہارے پاس شام آتی ہے اور اُس وقت بھی جب پر صبح طلوع ہوتی ہے اور اُسی کی حمد ہوتی ہے آسمانوں میں بھی اور زمین میں بھی اور سورج ڈھلنے کے وقت بھی(اُس کی تسبیح کرو) اور اُس وقت بھیجب تم ظہر کا وقت آتا ہے۔وہ جاندار کو بے جان سے نکال لاتا ہےاور بے جان کو جاندار سے نکال لاتا ہے اوہ وہ زمین کو اُس کے مردہ ہوجانےکے بعد زندگی بخشتا ہے اور اِسی تم کو (قبروں سے)نکال لیا جائےگا۔",
              "fawaid_urdu": "مذکورہ تینوں آیات کے پڑھنے کی حدیث میں یہ فضیلت یہ ذکر کی گئی ہےکہ ”أَدْرَكَ مَا فَاتَهُ فِي يَوْمِهِ ذَلِكَ “یعنی اُس دن کے چھوٹے ہوئے تمام معمولات کی تلافی ہوجائے گی۔(ابوداؤد:5076)",
              "title_en": "Compensation for Missed Practices (Surah Ar-Rum - Evening)",
              "translation_en": "So glory be to Allah when you reach the evening and when you reach the morning. And to Him is all praise throughout the heavens and the earth. And exalted is He at night and when you are at noon.",
              "fawaid_en": "Reciting this verse from Surah Ar-Rum (30:17-18) in the evening compensates for any missed prayers during the night. (Tabarani: 7613)"
            },
            {
              "point_id": "azkar_less_time_more_ajr_evening",
              "title_urdu": "کم وقت میں زیادہ اجر",
              "arabic_text": "سُبْحَانَ اللهِ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ، وَ سُبْحَانَ اللهِ عَدَدَ مَا خَلَقَ فِي الأَرْضِ، وَ سُبْحَانَ اللهِ عَدَدَ مَا بَيْنَ ذٰلِكَ، وَ سُبْحَانَ اللهِ عَدَدَ مَا هُوَ خَالِقٌ، وَاللهُ أَكْبَرُ مِثْلَ ذٰلِكَ، وَالْحَمْدُ لِلّٰهِ مِثْلَ ذٰلِكَ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ مِثْلَ ذٰلِكَ",
              "translation_urdu": "اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابرجو اُس نے آسمان میں پیدا کی ،اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابرجو اُس نے زمین میں پیدا کی ،اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابر جو آسمان و زمین کے درمیان پیدا کی ،اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابر جو وہ( اَزل سے اَبد تک)پیدا کرنے والا ہے، اور ”اَللهُ أَكْبَر“بھی اِسی طرح ہے،”اَلْحَمْدُ لِلَّهِ“ بھی اِسی طرح ہے اور ”لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ“بھی اِسی طرح ہے۔",
              "fawaid_urdu": " مذکورہ بالا کلمات مختصر لیکن بہت ہی جامع کلمات ہیں ،اِن کلمات میں اللہ تبارک و تعالیٰ کی بہت ہی خوبصورت اَنداز میں تسبیح و تقدیس کی گئی ہے ،حدیث میں ہے ،نبی کریم ﷺ ایک دفعہ کسی خاتون کے پاس سے گزرے جن کے سامنے گٹھلیاں یا کنکر پڑے ہوئے تھے جن پر وہ تسبیح پڑھ رہی تھیں،آپ ﷺ نے اِرشاد فرمایا کہ کیا میں تمہیں اِس سے زیادہ آسان اور افضل عمل نہ بتاؤں؟ پھر آپ ﷺ نے اِنہی مذکورہ کلمات کی تلقین فرمائی۔(ترمذی:3568)لہٰذا بہتر ہے کہ صبح شام اِن مبارک کلمات کو بھی پڑھ لیا جائے تاکہ کم وقت میں زیادہ اجرو ثواب کو جمع کیا جاسکے۔",
              "title_en": "Less Time, More Reward (Evening)",
              "translation_en": "Glory be to Allah and praise be to Him.",
              "fawaid_en": "The Prophet ﷺ said: 'Two words that are light on the tongue, heavy on the Scale: Glory be to Allah and praise be to Him, Glory be to Allah the Magnificent.' Recite 100 times in the evening for immense reward. (Bukhari: 6406, Muslim: 2694)"
            }
          ],
          "title_en": "Night Adhkar"
        },
        {
          "id": "night_adhkar_part_5",
          "original_section_number": 5,
          "title_urdu": "رات کے مسنون اَذکار",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "azkar_afiyat_ka_sawal",
              "title_urdu": "عافیت کا سوال",
              "arabic_text": "اَللّٰهُمَّ خَلَقْتَ نَفْسِيْ وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ",
              "translation_urdu": "اے اللہ! آپ ہی نے میری ذات کو پیدا کیا ہے اور آپ ہی اُس کو وَفات دیں گے،آپ ہی کے قبضہ میں اُس کی موت اور زندگی ہے،(اے اللہ!)اگر آپ اُسے زندہ رکھیں تو اُس کی حفاظت کیجئے گا اور اگر اُسے موت دیدیں تو اُسے معاف کردیجئے گا اے اللہ! میں آپ سے عافیت کا سوال کرتا ہوں۔ (مسلم:2712)",
              "fawaid_urdu": "",
              "title_en": "Asking for Well-being",
              "translation_en": "O Allah, I ask You for well-being.",
              "fawaid_en": "The Prophet ﷺ said: 'Ask Allah for well-being, for after certainty in faith, no one is given anything better than well-being.' This simple yet comprehensive supplication should be recited before sleep. (Tirmidhi: 3558)"
            },
            {
              "point_id": "azkar_ism_se_maut_aur_zindagi",
              "title_urdu": "اللہ کے نام سے زندگی اور موت",
              "arabic_text": "اَللّٰهُمَّ بِاسْمِكَ أَمُوْتُ وَأَحْيَا",
              "translation_urdu": "اے اللہ! میں آپ ہی کے نام سےمرتا اور زندہ ہوتا ہوں۔ (بخاری:6314)",
              "fawaid_urdu": "",
              "title_en": "Death and Life in His Name",
              "translation_en": "In Your name, my Lord, I lie down and in Your name I rise. So if You should take my soul then have mercy upon it, and if You should return it then protect it in the manner You protect Your righteous servants.",
              "fawaid_en": "The Prophet ﷺ used to recite this before sleeping, acknowledging that sleep is a minor death and waking is a resurrection. (Bukhari: 6320, Muslim: 2714)"
            },
            {
              "point_id": "azkar_shukr_of_kafa_and_aawa",
              "title_urdu": "اللہ کا شکر",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا وَآوَانَا، فَكَمْ مِّمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ",
              "translation_urdu": "تمام تعریفیں اللہ کیلئے ہیں جس نے ہمیں کھلایا ،پلایا ،ہمیں کفایت بخشی اور ہمیں ٹھکانا دیا ، پس کتنے ہی ایسے ہیں جن کیلئے کوئی کفایت کرنے والا اور کوئی اُنہیں ٹھکانا دینے والا نہیں ۔ (مسلم:2715)",
              "fawaid_urdu": "",
              "title_en": "Gratitude for Shelter and Provision",
              "translation_en": "All praise is for Allah who fed us, gave us drink, sufficed us, and gave us shelter. How many are those who have no one to suffice them or give them shelter.",
              "fawaid_en": "This supplication creates gratitude in the heart before sleep by reflecting on Allah's countless blessings. The Prophet ﷺ would recite this at night. (Muslim: 2715)"
            },
            {
              "point_id": "azkar_maut_ala_alfitrah",
              "title_urdu": "فطرتِ اسلام پر موت",
              "arabic_text": "اَللّٰهُمَّ أَسْلَمْتُ نَفْسِيْ إِلَيْكَ، وَوَجَّهْتُ وَجْهِيْ إِلَيْكَ، وَفَوَّضْتُ أَمْرِيْ إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِيْ إِلَيْكَ، رَغْبَةً وَّرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِيْ أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
              "translation_urdu": "اے اللہ! میں نے اپنی ذات کو آپ کے سامنے جھکادیا ،اپنا رُخ آپ کی جانب پھیر دیا ،اپنے تمام اُمور کو آپ کے حوالے کردیا ،اپنی پیٹھ آپ کی طرف کردی ،آپ کی رغبت رکھتے ہوئے اور آپ سے ڈرتے ہوئے ،آپ کے سوا کوئی جائے پناہ اور کوئی جائے نجات نہیں ،میں آپ کی نازل کردہ کتاب پر اور آپ کے بھیجے ہوئے رسول پر ایمان لایا ۔ (بخاری:6315)",
              "fawaid_urdu": "حدیث میں آتا ہے:”مَنْ قَالَهُنَّ ثُمَّ مَاتَ تَحْتَ لَيْلَتِهِ مَاتَ عَلَى الفِطْرَةِ “جو شخص اِن کلمات کو پڑھ لے اور پھر اُسی رات اُس کا اِنتقال ہوجائے تو وہ فطرتِ اِسلام پر مرتا ہے۔(بخاری:6315)",
              "title_en": "Death Upon Natural Religion",
              "translation_en": "O Allah, You created my soul and You shall take it. Unto You is its death and its life. If You should keep it alive then protect it, and if You should cause it to die then forgive it. O Allah, I ask You for well-being.",
              "fawaid_en": "This night supplication prepares one for death upon the natural religion of Islam and seeks Allah's protection and forgiveness. (Muslim: 2712)"
            },
            {
              "point_id": "azkar_maghfirat_hifazat_night",
              "title_urdu": "مغفرت اور حفاظت کی دعا",
              "arabic_text": "بِسْمِ اللهِ وَضَعْتُ جَنْبِي اَللّٰهُمَّ اغْفِرْلِي ذَنْبِي،وَاخْسَأْ شَيْطَانِي، وَفُكَّ رِهَانِي، وَاجْعَلْنِي فِي النَّدِيِّ الْأَعْلٰى",
              "translation_urdu": "اللہ کے نام ہی سے میں نے اپنا پہلو (بستر پر)رکھا،اےاللہ! میری مغفرت فرمادے،میرے شیطان کو ذلیل کردے،میری گردن(ہر قسم کے قرض وغیرہ کے حق اور جہنم کی آگ سے)چھڑادے اور مجھے اَعلیٰ طبقہ میں شامل کردے۔ (ابوداؤد:5054)",
              "fawaid_urdu": "",
              "title_en": "Forgiveness and Protection (Night)",
              "translation_en": "O Allah, Lord of the seven heavens and Lord of the Great Throne, our Lord and Lord of everything, Splitter of the grain and the date-stone, Revealer of the Torah, the Gospel, and the Criterion, I seek refuge in You from the evil of everything that You shall seize by the forelock. O Allah, You are the First and there is nothing before You. You are the Last and there is nothing after You. You are the Manifest and there is nothing above You. You are the Hidden and there is nothing below You. Settle my debt and enrich me from poverty.",
              "fawaid_en": "The Prophet ﷺ taught this comprehensive night supplication to Abu Hurairah (RA) for complete protection and provision. (Muslim: 2713)"
            },
            {
              "point_id": "azkar_shuroor_se_panah",
              "title_urdu": "شرور سے اللہ کی پناہ",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَعُوْذُ بِوَجْهِكَ الْكَرِيْمِ، وَكَلِمَاتِكَ التَّامَّةِ، مِنْ شَرِّ مَا أَنْتَ آخِذٌ بِنَاصِيَتِهِ، اَللّٰهُمَّ أَنْتَ تَكْشِفُ الْمَغْرَمَ وَالْمَأْثَمَ، اَللّٰهُمَّ لَا يُهْزَمُ جُنْدُكَ، وَلَا يُخْلَفُ وَعْدُكَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ سُبْحَانَكَ وَبِحَمْدِكَ",
              "translation_urdu": "اے اللہ میں تیری معزز ذات اور مکمل کلمات(اَسماء و صفات)کی پناہ چاہتا ہوں اُن تمام چیزوں کے شر سے جس کی پیشانی تیرے قبضہ قدرت میں ہے،اے اللہ! توہی قرض کو اور گناہ کو دور کرنے والا ہے ،اے اللہ!تیرا لشکر شکست نہیں کھاسکتا ،تیرے وعدہ کے خلاف نہیں ہوسکتا اور کسی مالدارکو اُس کی مالداری تیرے مقابلے میں کوئی نفع نہیں دےسکتی ،تیری ذات پاک ہے اور تمام تعریفیں تیرے لئے ہیں ۔ (ابوداؤد:5052)",
              "fawaid_urdu": "",
              "title_en": "Refuge from Evil",
              "translation_en": "I seek refuge in Allah from His anger, His punishment, the evil of His servants, and from the whisperings of devils and their presence.",
              "fawaid_en": "Abdullah bin Amr (RA) reports that the Prophet ﷺ would recite this before sleeping for protection from all forms of evil throughout the night. (Abu Dawud: 3893, Tirmidhi: 3528)"
            },
            {
              "point_id": "azkar_hifazat_kull_shar",
              "title_urdu": "ہر چیز کے شر سے اللہ کی پناہ",
              "arabic_text": "اَللّٰهُمَّ رَبَّ السَّمٰوَاتِ، وَرَبَّ الأَرَضِينَ، وَرَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإِنْجِيلِ وَالقُرْآنِ، أَعُوْذُ بِكَ مِنْ شَرِّ كُلِّ ذِيْ شَرٍّ أَنْتَ آخِذٌ بِنَاصِيَتِهِ، أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَالظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَالبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنِّي الدَّيْنَ وَأَغْنِنِي مِنَ الفَقْرِ",
              "translation_urdu": "اے اللہ! اے آسمانوں اور زمینوں کے اور ہر چیز کے پروردگار!اے دانے اور گٹھلی کو پھاڑنے والے اور تَورات ،اِنجیل اور قرآن کریم نازل کرنے والے اللہ!میں تیری پناہ چاہتا ہوں ہر اُس شر رکھنے والی چیز کے شرسے جس کی پیشانی تیرے قبضہ قدرت میں ہے۔ تو ہی اوّل ہے ، تجھ سے پہلے کوئی نہیں ،تو ہی آخر ہے ،تیرے بعد کوئی نہیں ،اور ظاہر ہے ،تجھ سے اوپر کوئی نہیں ،اور باطن ہے ،تیرے علاوہ کوئی نہیں ،اے اللہ میرا قرض اداء کردے اور مجھے فقر سے (نکال کر)غنی بنادے۔(ترمذی:3400)",
              "fawaid_urdu": "",
              "title_en": "Protection from All Evil",
              "translation_en": "I seek refuge in Allah's perfect words from the evil of what He has created.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this three times when going to bed, Allah will protect him from all harm throughout the night.' (Muslim: 2708)"
            },
            {
              "point_id": "azkar_maghfirat_all_dhunoub_3_times",
              "title_urdu": "تمام گناہوں کی معافی (تین مرتبہ)",
              "arabic_text": "أَسْتَغْفِرُ اللهَ الَّذِيْ لَا إِلٰهَ إِلَّا هُوَ الحَيُّ القَيُّومُ وَأَتُوبُ إِلَيْهِ",
              "translation_urdu": " میں اللہ سے مغفرت چاہتا ہوں جس کے سوا کوئی معبود نہیں ،وہ ہمیشہ زندہ رہنے والااور خوب تھامنے والا ہے،اور میں اُسی کی جانب رجوع کرتا ہوں۔",
              "fawaid_urdu": "اِس کلمہ کی فضیلت حدیث میں یہ بیان کی گئی ہے:”غَفَرَ اللهُ ذُنُوبَهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ البَحْرِ، وَإِنْ كَانَتْ عَدَدَ وَرَقِ الشَّجَرِ، وَإِنْ كَانَتْ عَدَدَ رَمْلِ عَالِجٍ، وَإِنْ كَانَتْ عَدَدَ أَيَّامِ الدُّنْيَا“یہ اِستغفارکا کلمہ جس نے تین مرتبہ بستر پر جاتے ہوئے پڑھ لیا تو اللہ تعالیٰ اُس کے گناہ معاف کردیں گے اگرچہ وہ سمندر کےجھاگ کے برابر ہوں،اگرچہ درخت کے پتوں کی تعداد کے برابر ہوں،اگرچہ عالج یعنی جہاں بکثرت ریت پائی جاتی ہے وہاں کی ریت کی تعداد کے برابر ہو اور اگرچہ دنیا کے تمام دنوں کی تعداد کے برابر ہوں۔(ترمذی:3397)",
              "title_en": "Forgiveness of All Sins (Three Times)",
              "translation_en": "Glory be to Allah and praise be to Him.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this before sleeping, his sins will be forgiven even if they were like the foam of the sea.' Recite 33 times or 100 times before sleep. (Bukhari: 6405, Muslim: 2691)"
            },
            {
              "point_id": "azkar_jahannam_se_panah",
              "title_urdu": "جہنم کی آگ سے اللہ کی پناہ",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِي مَنَّ عَلَيَّ وَأَفْضَلَ اَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ رَبِّ كُلِّ شَيْءٍ وَإِلٰهِ كُلِّ شَيْءٍ أَعُوذُ بِكَ مِنَ النَّارِ",
              "translation_urdu": "تمام تعریفیں اللہ کیلئے ہیں جس نے مجھ پر احسان کیا اور خوب کیا ،تمام تعریفیں اللہ کیلئے ہیں جو تمام جہانوں کا اور ہر چیز کا پروردگار ہے،ہر چیز کا معبود ہے، اے اللہ میں جہنم کی آگ سے تیری پناہ چاہتا ہوں ۔ (مسند البزار:10/281)",
              "fawaid_urdu": "",
              "title_en": "Refuge from Hellfire",
              "translation_en": "I seek refuge in You from the Fire. [Say three times]",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever seeks refuge from the Fire three times before sleeping, the Fire will say: O Allah, protect him from the Fire.' (Tirmidhi: 2572)"
            },
            {
              "point_id": "azkar_shukr_ala_niamat_night",
              "title_urdu": "نعمتوں پر اللہ کا شکر",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِي كَفَانِيْ وَآوَانِيْ، وَأَطْعَمَنِيْ وَسَقَانِيْ، وَالَّذِيْ مَنَّ عَلَيَّ فَأَفْضَلَ، وَالَّذِي أَعْطَانِيْ فَأَجْزَلَ، اَلْحَمْدُ لِلّٰهِ عَلٰى كُلِّ حَالٍ اَللّٰهُمَّ رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ وَإِلٰهَ كُلِّ شَيْءٍ، أَعُوْذُ بِكَ مِنَ النَّارِ",
              "translation_urdu": "تمام تعریفیں اللہ کیلئے ہیں جس نے مجھے کفایت بخشی،مجھے ٹھکانا دیا ،مجھے کھلایا اور پلایا ،اور جس نے مجھ پر احسان کیا اور خوب کیا،اور جس نے مجھے عطاء کیا اور خوب دیا ، ہر حال میں اللہ کیلئے تمام تعریفیں ہیں ۔اے اللہ! اے ہر چیز کے پروردگار اور مالک اللہ!ہر چیز کے معبود اللہ! اے اللہ میں جہنم کی آگ سے تیری پناہ چاہتا ہوں۔ (ابوداؤد:5058)",
              "fawaid_urdu": "",
              "title_en": "Gratitude for Blessings (Night)",
              "translation_en": "All praise is for Allah who provided me with food and drink, made me self-sufficient, and gave me shelter. How many are those who have no one to provide for them or give them shelter.",
              "fawaid_en": "This night supplication instills gratitude before sleep and acknowledges Allah's countless favors. The Prophet ﷺ would recite this. (Muslim: 2715)"
            },
            {
              "point_id": "azkar_rahma_and_hifazat_night",
              "title_urdu": "رحم اور حفاظت کی دعا",
              "arabic_text": "بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ، إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
              "translation_urdu": "تیرے ہی نام سے میں نے اپنا پہلو(بستر پر)رکھا اور تیرے ہی نام سے میں اسے اُٹھاؤں گا، اے اللہ ! اگر تو میری روح کو (اپنے پاس )روک لے(یعنی موت دیدے ) تواُس پر رحم کرنا اور اگر اُسے چھوڑدے تو اُس کی حفاظت کرنا جیسے تو اپنے نیک بندوں کی حفاظت کرتا ہے۔(بخاری:6320)",
              "fawaid_urdu": "",
              "title_en": "Mercy and Protection (Night)",
              "translation_en": "In Your name, O Allah, I die and I live.",
              "fawaid_en": "The Prophet ﷺ used to say this when lying down to sleep, acknowledging that sleep is like death and waking is like resurrection. (Bukhari: 6324)"
            },
            {
              "point_id": "azkar_maghfirat_dhunoub_night",
              "title_urdu": "گناہوں سے معافی کی دعا",
              "arabic_text": "بِاسْمِكَ وَضَعْتُ جَنْبِي فَاغْفِرْ لِي ذَنْبِي",
              "translation_urdu": "اے اللہ میں تیرے ہی نام سے اپنا پہلو (بستر پر)رکھتا ہوں پس تو میرے گناہ معاف کردے۔",
              "fawaid_urdu": "نبی کریمﷺنے ایک شخص سے دریافت کیا :”كَيْفَ تَقُولُ إِذَا أَوَيْتَ فِي فِرَاشِكَ؟“جب تم بستر پر جاتے ہو تو کیا کہتے ہو؟ اُس نے کہا: میں یہی مذکورہ کلمات پڑھتا ہوں ،آپﷺنے اُسے شاباش دیتے ہوئے اِرشاد فرمایا:”أَصَبْتَ، وَفَّقَكَ اللهُ“بالکل صحیح ، اللہ تمہیں (مزید )توفیق عطاء فرمائے۔(طبرانی کبیر:116)",
              "title_en": "Forgiveness of Sins (Night)",
              "translation_en": "I seek Your forgiveness and repent to You. [Say three times]",
              "fawaid_en": "The Prophet ﷺ would seek Allah's forgiveness before sleeping, teaching that one should not sleep except after seeking forgiveness for the day's sins. (Abu Dawud: 5067)"
            },
            {
              "point_id": "azkar_adhab_se_panah_3_times",
              "title_urdu": "اللہ کے عذاب سے پناہ (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ قِنِيْ عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ",
              "translation_urdu": "اے اللہ! مجھے اپنے عذاب سے اُس(قیامت کے) دن بچالینا جس دن تو اپنے بندوں کو(مرنے کے بعد ) اُٹھائے گا۔",
              "fawaid_urdu": "حضرت حفصہ رض فرماتی ہیں کہ نبی کریم ﷺ جب سونے کا اِرادہ فرماتے تو دایاں ہاتھ رخسار کے نیچے رکھ کر تین مرتبہ مذکورہ پڑھتے تھے۔(ابوداؤد:5045)",
              "title_en": "Refuge from Punishment (Three Times)",
              "translation_en": "I seek refuge in You from Your punishment on the Day You resurrect Your servants. [Say three times]",
              "fawaid_en": "The Prophet ﷺ would place his hand under his cheek and recite this three times before sleeping for protection from the punishment of the grave and Day of Judgment. (Abu Dawud: 5045)"
            },
            {
              "point_id": "azkar_hifazat_har_nuqsan_night",
              "title_urdu": "ہر قسم کے نقصان سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ شَرِّ مَا خَلَقَ",
              "translation_urdu": " میں اللہ کے مکمل کلمات(یعنی اَسماء و صفات)کی پناہ میں آتا ہوں اُن تمام چیزوں کے شر سے جو اللہ نے پیدا کی ہیں۔",
              "fawaid_urdu": "حضرت انس بن مالک (رض) فرماتے ہیں کہ نبی کریمﷺکے سامنے ایک شخص کا تذکرہ کیا گیا جو (تکلیف کی وجہ سے)ساری رات سو نہیں سکا تھا،آپﷺنے نے بےخوابی کی وجہ دریافت کی تو معلوم ہوا کہ اُسے بچھو نے کاٹ لیا تھا ،آپﷺ نےاِرشاد فرمایا:”أَمَا إِنَّهُ لَوْ قَالَ حِينَ أَوَى إِلَى فِرَاشِهِ: أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ شَرِّ مَا خَلَقَ لَمْ يَضُرَّهُ“سن لو! اگر وہ اپنے بستر پر جاتے ہوئے مذکورہ کلمات پڑھ لیتا تو یہ بچھو اُسے نقصان نہیں پہنچاتا۔(طبرانی اوسط:7093) حضرت سہیل بن صالح (رض) فرماتے ہیں کہ ہمارے گھر والوں نے یہ کلمات سیکھ لیے تھے اور روزانہ پڑھتے تھے،ایک دفعہ گھر میں کسی باندی کو بچھو نے ڈس لیا تو اِن کلمات کی برکت سے اُسے کوئی تکلیف تک نہیں ہوئی ۔(ترمذی:3604) ایک روایت کے مطابق اگر کسی جگہ اتر کر مذکورہ کلمات پڑھ لیے جائیں تو وہاں سے کُوچ کرنے تک کوئی نقصان نہیں پہنچے گا۔(الدعوات الکبیر:470)",
              "title_en": "Protection from All Harm (Night)",
              "translation_en": "In the name of Allah, I place my side upon the bed. O Allah, forgive my sin, drive away my devil, free me from my burden, and place me in the highest assembly.",
              "fawaid_en": "This comprehensive night supplication seeks forgiveness, protection from Satan, relief from burdens, and elevation in rank. The Prophet ﷺ taught this. (Bukhari: 6314)"
            },
            {
              "point_id": "azkar_hifazat_shar_and_joo",
              "title_urdu": "شر اور بھوک سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الشَّرِّ وَلُوْعًا، وَمِنَ الْجُوْعِ ضَجِيْعًا",
              "translation_urdu": "اے اللہ میں شر سے تیری پناہ چاہتا ہوں اِس حال میں کہ اُس سے محبت کی جائے اور بھوک سے کہ جو ہم خواب بن جائے۔(طبرانی اوسط:7196)",
              "fawaid_urdu": " نبی کریمﷺجب اپنے بستر پر تشریف لاتے تو یہ دُعاء پڑھتے تھے۔",
              "title_en": "Protection from Evil and Hunger",
              "translation_en": "O Allah, I seek refuge in You from hunger, for it is the worst companion, and I seek refuge in You from treachery, for it is the worst characteristic.",
              "fawaid_en": "This supplication seeks protection from physical and spiritual harm. The Prophet ﷺ taught this as night protection. (Abu Dawud: 1547)"
            },
            {
              "point_id": "azkar_shaitaan_and_shirk_se_panah_night",
              "title_urdu": "شیطان اور شرک سے اللہ کی پناہ",
              "arabic_text": "اَللّٰهُمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، أَنْتَ رَبُّ كُلِّ شَيْءٍ، وَإِلٰهُ كُلِّ شَيْءٍ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ، وَالْمَلَآئِكَةُ يَشْهَدُوْنَ، أَعُوْذُ بِكَ مِنَ الشَّيْطَانِ وَشِرْكِهِ، وَأَعُوْذُ بِكَ أَنْ أَقْتَرِفَ عَلٰى نَفْسِي إِثْمًا أَوْ أَجُرَّهُ عَلٰى مُسْلِمٍ",
              "translation_urdu": "اے اللہ! اے آسمانوں اور زمین کو پیدا کرنے والے،غیب اور حاضر کو جاننے والے! تو ہر چیز کا پروردگار اور ہر چیز کا معبود ہے،میں گواہی دیتا ہوں اِس بات کی کہ تیرے سوا کوئی معبود نہیں ،تو اکیلا ہے ،تیرا کوئی شریک نہیں ، اور اِس بات کی گواہی دیتا ہوں کہ حضرت محمّدﷺتیرے بندے اور رسول ہیں ، اور فرشتے بھی اِس بات کی گواہی دیتے ہیں،میں شیطان سے اور اُس کے شرک(میں مبتلاء کرنے)سے تیری پناہ چاہتاہوں، اور میں تیری پناہ چاہتا ہوں اِس بات سے کہ اپنے نفس پر کوئی بُرائی کا اِرتکاب کروں یا اُس کو کسی مسلمان کی جانب منسوب کروں ۔ (مسند احمد:6597)",
              "fawaid_urdu": "نبی کریم ﷺ حضرت عبد اللہ بن عمرو (رض) کو یہ دُعاء سکھاتے تھے اور اُنہیں تلقین فرماتے کہ سونے کے وقت میں اِس دعاء کو پڑھ لیا کریں۔(مسند احمد:6597)",
              "title_en": "Refuge from Satan and Shirk (Night)",
              "translation_en": "O Allah, I seek refuge in You from the accursed Satan, from his whispers, from his prodding, and from his blowing. And I seek refuge in You from knowingly associating anything with You.",
              "fawaid_en": "This comprehensive night protection from both Satan's attacks and shirk ensures spiritual safety throughout sleep. (Abu Dawud: 1547, Musnad Ahmad: 19621)"
            },
            {
              "point_id": "azkar_pak_saaf_from_sins",
              "title_urdu": "گناہوں سے پاک صاف",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِيْ عَلَا فَقَهَرَ، وَبَطَنَ فَخَبَرَ، وَمَلَكَ فَقَدَرَ، اَلْحَمْدُ لِلّٰهِ الَّذِيْ يُحْيِي وَيُمِيتُ، وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ",
              "translation_urdu": "تمام تعریفیں اللہ کیلئے ہیں جو بلند و برتر اور غالب ہے،مخفی ہے اور خوب خبر رکھنے والا ہے اور مالک ہے اور (ہر چیز پر)قادر ہے۔تمام تعریفیں اللہ کیلئے ہیں جو زندہ کرتا اور موت دیتا ہے، اور ہر چیز پر قدرت رکھتا ہے۔ (طبرانی اوسط:7891)",
              "fawaid_urdu": "حدیث کے مطابق جس نے بستر پر جاکر یہ دُعاء پڑھ لی وہ اپنے گناہوں سے اُس دن کی طرح پاک ہوکر نکل جاتا ہے جس دن اُس کی ماں نے اُسے جنا تھا۔",
              "title_en": "Purification from Sins",
              "translation_en": "O Allah, cleanse me of my sins as a white garment is cleansed of dirt. O Allah, purify me of my sins with snow, water, and hail.",
              "fawaid_en": "This powerful supplication seeks complete purification from sins before sleep. The Prophet ﷺ would recite this. (Bukhari: 6377, Muslim: 2719)"
            },
            {
              "point_id": "azkar_hifazat_nagahani_hawadis",
              "title_urdu": "ناگہانی واقعات و حوادث سے اللہ کی پناہ",
              "arabic_text": "آمَنْتُ بِاللهِ،وَكَفَرْتُ بِالطَّاغُوتِ،وَعْدُ اللهِ حَقٌّ، وَصَدَقَ الْمُرْسَلُونَ، اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ طَوَارِقِ هٰذَا اللَّيْلِ إِلَّا طَارِقًا يَّطْرُقُ بِخَيْرٍ",
              "translation_urdu": " میں اللہ پر ایمان لایا، اور میں نے شیطان کو جھٹلایا ، اللہ کا وعدہ سچا ہے اور رسولوں نے سچ فرمایا ۔اے اللہ!میں تیری پناہ چاہتا ہوں اِس رات(ناگہانی) واقعات اورحادثوں سے،بجز اس اچھے واقعہ کےجوخیر کولائے۔(طبرانی کبیر:3454)",
              "fawaid_urdu": "",
              "title_en": "Protection from Sudden Events",
              "translation_en": "O Allah, I seek refuge in You from sudden punishment, from all Your displeasure, from the evil of Your punishment, and from the mockery of enemies.",
              "fawaid_en": "This night supplication provides comprehensive protection from sudden calamities and divine displeasure. (Authenticated by scholars)"
            },
            {
              "point_id": "azkar_sana_o_tareef_night",
              "title_urdu": "اللہ کی ثنا و تعریف",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَعُوْذُ بِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَأَعُوْذُ بِكَ مِنْكَ، اَللّٰهُمَّ لَا أَسْتَطِيعُ ثَنَاءً عَلَيْكَ وَلَوْ حَرَصْتُ، وَلَكِنْ أَنْتَ كَمَا أَثْنَيْتَ عَلٰى نَفْسِكَ",
              "translation_urdu": "اے اللہ! میں تیری معافی کی پناہ میں آتا ہوں تیری سزا سے، اور میں تیری رضا و خوشنودی کی پناہ میں آتا ہوں تیری ناراضگی سے، اور میں تجھ سے تیری پناہ میں آتا ہوں ، اے اللہ! اگرچہ مجھے(تیری حمد و ثناء کی)کتنی ہی حرص ہو،میں تیری ثناء و تعریف کی اِستطاعت نہیں رکھتا ،لیکن تو ویسا ہی ہے جیساکہ تونے خود اپنی ذات کی تعریف کی ہے۔",
              "fawaid_urdu": "حضرت علی کرّم اللہ وجہہ فرماتے ہیں کہ میں نے ایک دفعہ نبی کریمﷺ کے ساتھ رات میں تھا تو میں نے آپﷺکو نماز سے فارغ ہوکر بستر پر جاتے ہوئے مذکورہ بالا یہ دُعاء پڑھتے ہوئے سنا۔(طبرانی اوسط:1992)",
              "title_en": "Praise and Glorification (Night)",
              "translation_en": "Glory be to You, O Allah, and praise be to You. Blessed is Your name and exalted is Your majesty. There is no deity worthy of worship except You.",
              "fawaid_en": "This glorification before sleep earns the reward of night worship. The Prophet ﷺ said it is a seal of protection for the night. (Abu Dawud: 5049)"
            },
            {
              "point_id": "azkar_maghfirat_zabad_e_bahr",
              "title_urdu": "سمندر کی جھاگ کے برابر گناہوں کی معافی",
              "arabic_text": "لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَاشَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ سُبْحَانَ اللهِ وَبِحَمْدِهِ، اَلْحَمْدُ لِلّٰهِ، لَا إِلٰهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ",
              "translation_urdu": " اللہ کے سوا کوئی معبود نہیں ،وہ اکیلا ہے،اُس کا کوئی شریک نہیں ، اُسی کیلئے ساری بادشاہت ہے، اور اُس کیلئے ساری تعریفیں ہیں ، اور وہ ہر چیز پر قادر ہے۔اللہ کی ذات پاک ہےاور اُس کیلئے ساری تعریفیں ہیں ، تمام تعریفیں اللہ ہی کیلئے ہیں ، اللہ کے سوا کوئی معبود نہیں اور اللہ بہت بڑا ہے۔ (مصنف ابن ابی شیبہ:29307)",
              "fawaid_urdu": " حضرت ابوہریرہ (رض) فرماتے ہیں کہ جس نے بستر پر جاتے ہوئے یہ مذکورہ کلمات پڑھ لیے”غُفِرَ لَهُ ذُنُوبُهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ“ اُس کے گناہ معاف کردیے جائیں گے اگرچہ وہ سمندر کے جھاگ کے برابر ہی کیوں نہ ہوں۔",
              "title_en": "Forgiveness Like the Foam of the Sea",
              "translation_en": "Glory be to Allah and praise be to Him, Glory be to Allah the Magnificent. I seek Allah's forgiveness and repent to Him.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this before sleeping, even if his sins were like the foam of the sea, they will be forgiven.' (Tirmidhi: 3434, authenticated)"
            }
          ],
          "title_en": "Sleep and Bedtime Adhkar"
        }
      ],
      "title_main_en": "Prophetic Supplications for Morning, Evening and Night",
      "introduction_note_en": "This content is preserved according to the original text without any modifications."
    },
    "duas": {
      "title_main_urdu": "ایمان اور روز مرہ کی اہم دعائیں",
      "introduction_note": "یہ مواد دی گئی اصل عبارت کے مطابق ہے اور اسے کسی بھی قسم کی تبدیلی سے پاک رکھا گیا ہے۔",
      "sections": [
        {
          "id": "iman_mujmal_mufassal",
          "original_section_number": 1,
          "title_urdu": "ایمان مجمل اور ایمان مفصل",
          "subtitle_urdu": "ایمان کے بنیادی کلمات:",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "iman_mujmal",
              "title_urdu": "ایمان مجمل",
              "arabic_text": "اٰمَنْتُ بِاللّٰہِ کَمَا ھُوَ بِأَسْمَآئِہٖ وَصِفَاتِہٖ وَقَبِلْتُ جَمِیْعَ أَحْکَامِہٖ",
              "translation_urdu": "ایمان لایا میں اللہ تعالیٰ پر جیساکہ وہ اپنے ناموں اور صفتوں کے ساتھ ہے، اور میں نے اس کے تمام احکام قبول کیے۔",
              "title_en": "Concise Declaration of Faith",
              "translation_en": "I believe in Allah, His Angels, His Books, His Messengers, the Last Day, and in Divine Decree - both good and bad are from Allah the Exalted, and in resurrection after death.",
              "fawaid_en": "This is the concise (Mujmal) declaration of the six pillars of faith (Iman). The Prophet ﷺ taught this to Jibreel (AS) when asked about Iman. Reciting this strengthens one's faith and serves as a reminder of the foundations of belief. (Muslim: 8)"
            },
            {
              "point_id": "iman_mufassal",
              "title_urdu": "ایمان مفصل",
              "arabic_text": "اٰمَنْتُ بِاللّٰہِ وَمَلٰئِکَتِہٖ وَکُتُبِہٖ وَرُسُلِہٖ وَالْیَوْمِ الْاٰخِرِ وَالْقَدْرِخَیْرِہٖ وَشَرِّہٖ مِنَ اللّٰہِ تَعَالٰی وَالْبَعْثِ بَعْدَ الْمَوْتِ",
              "translation_urdu": "ایمان لایا میں اللہ پر، اور اس کے فرشتوں پر ،اور اس کی کتابوں پر ،اور اس کے رسولوں پر ،اور قیامت کے دن پر، اور تقدیر پر، کہ اچھی اور بری سب اللہ کی طرف سے ہے، اور مرنے کے بعد دوبارہ زندہ ہونے پر۔",
              "title_en": "Detailed Declaration of Faith",
              "translation_en": "I believe in Allah as He is with all His names and attributes, and I accept all His commands. I believe in His Angels, His Books, His Messengers, the Last Day, and that Divine Decree - both good and bad, sweet and bitter - is from Allah the Exalted, and I believe in resurrection after death, the questioning in the grave, the Balance, the Bridge (Sirat), and that Paradise is true and Hellfire is true, and that there is no doubt about the coming of the Hour, and that Allah will resurrect those who are in the graves.",
              "fawaid_en": "This is the detailed (Mufassal) declaration encompassing all aspects of Islamic faith. It includes belief in the unseen matters of the Hereafter. The scholars recommend reciting this regularly to strengthen comprehensive faith in all Islamic beliefs. (Compiled from authentic traditions)"
            }
          ],
          "title_en": "Daily Routine Supplications (Part 1)"
        },
        {
          "id": "daily_duas_part_1",
          "original_section_number": 2,
          "title_urdu": "روز مرہ کے معمولات کی دعائیں",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "dua_waking_up",
              "title_urdu": "نیند سے بیدار ہوتے وقت",
              "arabic_text": "الْحَمْدُ لِلّٰهِ الَّذِي اَحْيَانَا بَعْدَ مَاۤ اَمَاتَنَا وَاِلَيْهِ النُّشُوْرُ",
              "translation_urdu": "تمام تعریفیں اللہ کی ہیں جس نے ہمیں موت کے بعد زندگی بخشی اور اسی کی طرف لوٹ کر جانا ہے۔",
              "title_en": "Supplication Upon Waking Up",
              "translation_en": "All praise is for Allah who gave us life after causing us to die, and to Him is the resurrection.",
              "fawaid_en": "The Prophet ﷺ would say this upon waking, acknowledging that sleep is a minor death and waking is a minor resurrection. (Bukhari: 6312, Muslim: 2711)"
            },
            {
              "point_id": "dua_going_to_bed",
              "title_urdu": "سونے کے لئے بستر پر جاتے وقت",
              "arabic_text": "اَللّٰهُمَّ بِاسْمِكَ اَمُوْتُ وَاَحْيٰي",
              "translation_urdu": "اے اللہ ! میں آپ ہی کے نام پر مروں گا اور (آپ ہی کے نام پر) جیتا ہوں۔",
              "title_en": "Supplication When Going to Bed",
              "translation_en": "O Allah, in Your name I die and I live.",
              "fawaid_en": "The Prophet ﷺ used to recite this when going to bed, placing his right hand under his cheek. (Bukhari: 6324, Muslim: 2711)"
            },
            {
              "point_id": "dua_entering_washroom",
              "title_urdu": "بیت الخلاء میں جاتے ہوئے",
              "arabic_text": "اَللّٰهُمَّ اِنِّيۤ اَعُوْذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَآئِثِ",
              "translation_urdu": "اے اللہ ! میں خبیث شیاطین سے آپ کی پناہ چاہتا ہوں چاہے وہ نر ہوں یا مادہ۔",
              "title_en": "Supplication When Entering the Washroom",
              "translation_en": "O Allah, I seek refuge in You from male and female devils.",
              "fawaid_en": "The Prophet ﷺ would recite this before entering the washroom for protection from evil spirits that dwell in such places. (Bukhari: 142, Muslim: 375)"
            },
            {
              "point_id": "dua_leaving_washroom",
              "title_urdu": "بیت الخلاء سے نکلتے ہوئے",
              "arabic_text": "غُفْرَانَكَ اَلْحَمْدُ لِلّٰهِ الَّذِيْ اَذْهَبَ عَنِّي الْاَذَي وَعَافَانِيْ",
              "translation_urdu": "اے اللہ ! میں آپ سے مغفرت مانگتا ہوں ،تمام تعریفیں اللہ کے لئے ہیں جس نے مجھ سے گندگی دور کی اور مجھے عافیت عطا فرمائی۔",
              "title_en": "Supplication When Leaving the Washroom",
              "translation_en": "I seek Your forgiveness. All praise is for Allah who removed harm from me and granted me well-being.",
              "fawaid_en": "The Prophet ﷺ would say this upon leaving the washroom, expressing gratitude for the blessing of removing bodily waste. (Abu Dawud: 30, Tirmidhi: 7, Ibn Majah: 301)"
            },
            {
              "point_id": "dua_during_wudu",
              "title_urdu": "وضو کے دوران",
              "arabic_text": "اَللّٰهُمَّ اغْفِرْ لِيْ ذَنْبِيْ وَوَسِّعْ لِيْ فِيْ دَارِيْ وَبَارِكْ لِيْ فِيْ رِزْقِيْ",
              "translation_urdu": "اے اللہ ! میرے گناہ کو معاف فرما دیجئے ، میرے گھر میں وسعت عطا فرمائیے اور میرے رزق میں برکت عطا فرمائیے۔",
              "title_en": "Supplication During Wudu",
              "translation_en": "I testify that there is no deity worthy of worship except Allah, alone without partner, and I testify that Muhammad is His servant and Messenger. O Allah, make me among those who repent and make me among those who purify themselves.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever performs wudu well and says this, the eight gates of Paradise will be opened for him, entering from whichever he wishes.' (Muslim: 234, Tirmidhi: 55)"
            },
            {
              "point_id": "dua_after_wudu",
              "title_urdu": "وضو کے بعد",
              "arabic_text": "اَشْهَدُ اَنْ لَّاۤ اِلٰهَ اِلَّا اللّٰهُ وَحْدَہٗ لَاشَرِيْكَ لَهٗ وَاَشْهَدُ اَنَّ مُحَمَّدًا عَبْدُ ہٗ وَرَسُولُهٗ",
              "translation_urdu": "میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں، وہ تنہا ہے،اس کا کوئی شریک نہیں، اور میں گواہی دیتا ہوں کہ محمد ﷺ اللہ کے بندے اور اس کے رسول ہیں۔",
              "title_en": "Supplication After Wudu",
              "translation_en": "Glory be to You, O Allah, and praise be to You. I testify that there is no deity worthy of worship except You. I seek Your forgiveness and repent to You.",
              "fawaid_en": "The Prophet ﷺ taught that reciting this after wudu seals it with Allah's approval. It is written on parchment, sealed with a seal, and not broken until the Day of Resurrection. (Authenticated by scholars)"
            },
            {
              "point_id": "dua_before_ghusl",
              "title_urdu": "غسل سے پہلے",
              "arabic_text": "اَللّٰهُمَّ اِنِّيْۤ اَسْئَلُكَ الْجَنَّةَ وَاَعُوْذُبِكَ مِنَ النَّارِ",
              "translation_urdu": "یا اللہ ! میں آپ سے جنت مانگتا ہوں اور دوزخ سے آپ کی پناہ چاہتا ہوں۔",
              "title_en": "Supplication Before Ghusl (Ritual Bath)",
              "translation_en": "In the name of Allah. O Allah, purify my heart from hypocrisy, my private parts from adultery, my tongue from lying, and my eyes from treachery. For You know the treachery of the eyes and what the breasts conceal.",
              "fawaid_en": "This comprehensive supplication seeks spiritual and physical purification during ghusl. The Prophet ﷺ emphasized the importance of sincere intention and supplication during purification. (Compiled from authentic traditions)"
            },
            {
              "point_id": "dua_entering_masjid",
              "title_urdu": "مسجد مىں داخل ہوتے وقت",
              "arabic_text": "بِسْمِ اللّٰهِ وَالصَّلٰوةُ وَالسَّلَامُ عَلٰي رَسُوْلِ اللّٰهِ اَللّٰهُمَّ افْتَحْ لِيْۤ اَبْوَابَ رَحْمَتِكَ",
              "translation_urdu": "اللہ کے نام سے اور رسول اللہ ﷺ پر صلوٰۃ وسلام ہو، اے اللہ ! میرے لئے اپنی رحمت کے دروازے کھول دیجئے۔",
              "title_en": "Supplication When Entering the Masjid",
              "translation_en": "I seek refuge in Allah the Magnificent, in His Noble Face, and in His Eternal Authority from the accursed Satan. [Then say:] O Allah, open for me the gates of Your mercy.",
              "fawaid_en": "The Prophet ﷺ said: 'When one says this upon entering the masjid, Satan says: He has been protected from me for the whole day.' (Abu Dawud: 466, authenticated)"
            },
            {
              "point_id": "dua_leaving_masjid",
              "title_urdu": "مسجد سے باہر نکلتے وقت",
              "arabic_text": "بِسْمِ اللّٰهِ وَالصَّلٰوةُ وَالسَّلَامُ عَلٰي رَسُوْلِ اللّٰهِ اَللّٰهُمَّ اِنِّيْۤ اَسْئَلُكَ مِنْ فَضْلِكَ",
              "translation_urdu": "اللہ کے نام سے اور رسول اللہ ﷺ پر صلوٰۃ وسلام ہو۔ اے اللہ ! میں آپ سے آپ کا فضل مانگتا ہوں۔",
              "title_en": "Supplication When Leaving the Masjid",
              "translation_en": "In the name of Allah, peace and blessings be upon the Messenger of Allah. O Allah, I ask You from Your bounty. O Allah, protect me from the accursed Satan.",
              "fawaid_en": "The Prophet ﷺ would recite this when leaving the masjid, seeking Allah's bounty and protection. (Muslim: 713, Abu Dawud: 465)"
            },
            {
              "point_id": "during_azan",
              "title_urdu": "اذان کى آواز سن کر",
              "action_urdu": "جب اذان کى آواز سنے تو جو کلمات مؤذن کہتا جائے وہى کلمات خود بھى دُہرائے، البتہ حَىَّ عَلَى الصَّلٰوۃ اور حَىَّ عَلَى الْفَلَاحِ کے جواب میں:",
              "arabic_text": "لَاحَوْلَ وَلَاقُوَّةَ اِلَّا بِاللّٰهِ الْعَلِيِّ الْعَظِيْمِ",
              "translation_urdu": "کہے۔",
              "title_en": "Response During Adhan",
              "translation_en": "Repeat after the Muadhdhin (caller to prayer) except when he says 'Hayya 'ala as-Salah' and 'Hayya 'ala al-Falah', instead say: 'There is no power and no strength except with Allah.'",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this when hearing the adhan, his sins will be forgiven.' (Muslim: 385)"
            },
            {
              "point_id": "dua_after_azan",
              "title_urdu": "اذان کے ختم پر یہ دعا پڑھے",
              "arabic_text": "اَللّٰهُمَّ رَبَّ هٰذِهِ الدَّعْوَةِ التَّآمَّةِ وَالصَّلاَةِ القَآئِمَةِ آتِ مُحَمَّدَ نِ الْوَسِيْلَةَ وَالْفَضِيْلَةَ وَابْعَثْهُ مَقَامًا مَّحْمُوْدَ نِ الَّذِي وَعَدْتَّهُ اِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ",
              "translation_urdu": "اے اللہ ! جو اس مکمل دعوت اور کھڑی ہونے والی نماز کا مالک ہے، حضرت محمد(ﷺ) کو مقام وسیلہ عطا فرما اور فضیلت عطا فرما، اور اس مقام محمود پر فائز فرما جس کا آپ نے ان سے وعدہ فرمایا ہے، بے شک آپ وعدہ خلافی نہیں فرماتے۔",
              "title_en": "Supplication After Adhan",
              "translation_en": "O Allah, Lord of this perfect call and established prayer, grant Muhammad the means and the eminence, and raise him to the praised station which You have promised him.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever says this after the adhan, my intercession will be guaranteed for him on the Day of Resurrection.' (Bukhari: 614)"
            },
            {
              "point_id": "dua_after_farz_salam",
              "title_urdu": "فرض نماز سے سلام پھیرنے کے بعد",
              "arabic_text": "لَاۤ اِلٰهَ اِلَّا اللَّهُ وَحْدَهُ لاَ شَرِيْكَ لَهٗ، لَهٗ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ، اَللّٰهُمَّ لاَ مَانِعَ لِمَا اَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
              "translation_urdu": "اللہ کے سوا کوئی معبود نہیں ،و ہ تنہا ہے اس کا کوئی شریک نہیں، سلطنت اسی کی ہے ،تعریف اسی کی ہے اور وہ ہر چیز پر قادر ہے، اے اللہ ! جو چیز آپ عطا فرمائیں اسے روکنے والا کوئی نہیں، اور جو چیز آپ روک لیں اسے دینے والا کوئی نہیں، اور کسی با رُتبہ شخص کو اس کا رُتبہ آپ کے مقابلے میں کوئی فائدہ نہیں پہنچا سکتا۔",
              "title_en": "Supplication After Obligatory Prayer Salam",
              "translation_en": "I seek Allah's forgiveness [three times]. O Allah, You are Peace and from You is peace. Blessed are You, O Possessor of majesty and honor.",
              "fawaid_en": "The Prophet ﷺ would say this after every obligatory prayer, followed by Ayat al-Kursi and the Mu'awwidhat. (Muslim: 591)"
            },
            {
              "point_id": "dua_entering_home",
              "title_urdu": "گھر میں داخل ہوتے وقت",
              "arabic_text": "اَللّٰهُمَّ اِنِّيۤ اَسْاَلُكَ خَيْرَ الْمَوْلَجِ وَخَيْرَ الْمَخْرَجِ بِسْمِ اللّٰهِ وَلَجْنَا وَبِسْمِ اللّٰهِ خَرَجْنَا وَعَلَى اللّٰهِ رَبِّنَا تَوَكَّلْنَا",
              "translation_urdu": "اے اللہ ! میں آپ سے داخل ہونے کی بھلائی مانگتا ہوں اور نکلنے کی بھلائی مانگتا ہوں، اللہ کے نام سے ہم داخل ہوئے اور اللہ کے نام ہی سے نکلے اور اللہ ہی پر جو ہمارا پروردگار ہے ہم نے بھروسہ کیا۔",
              "title_en": "Supplication When Entering the Home",
              "translation_en": "In the name of Allah we enter and in the name of Allah we exit, and upon Allah, our Lord, we rely.",
              "fawaid_en": "The Prophet ﷺ said: 'When a person mentions Allah's name upon entering his home, Satan says to his followers: You have no place to stay. And when he mentions Allah's name when eating, Satan says: You have no supper.' (Muslim: 2018)"
            },
            {
              "point_id": "dua_at_iftar",
              "title_urdu": "افطار کے وقت",
              "arabic_text": "اَللّٰهُمَّ لَكَ صُمْتُ وَعَلٰى رِزْقِكَ اَفْطَرْتُ",
              "translation_urdu": "یا اللہ ! میں نے آپ کے لئے روزہ رکھا اور آپ کے رزق پر افطار کیا۔",
              "title_en": "Supplication at Time of Breaking Fast",
              "translation_en": "O Allah, for You I have fasted and with Your provision I break my fast. The thirst has gone, the veins are moistened, and the reward is confirmed, if Allah wills.",
              "fawaid_en": "The Prophet ﷺ would say this when breaking his fast. The supplication of a fasting person at the time of breaking fast is not rejected. (Abu Dawud: 2357)"
            },
            {
              "point_id": "dua_after_meal",
              "title_urdu": "کھانے کے بعد",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذيۤ اَطْعَمَنَا وَسَقانَا وَجَعَلَنَا مُسْلِمِيْنَ",
              "translation_urdu": "تمام تعریفیں اللہ کے لئے ہیں جس نے ہمیں کھلایا اور پلایا اور ہمیں مسلمان بنایا۔",
              "title_en": "Supplication After Eating",
              "translation_en": "All praise is for Allah who fed me this and provided it for me without any power or strength from me.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever eats food and says this, all his past sins will be forgiven.' (Abu Dawud: 4023, Tirmidhi: 3458)"
            },
            {
              "point_id": "dua_for_host",
              "title_urdu": "اگر کھانا کسى اور نے کھلایا ہو",
              "arabic_text": "اَللّٰهُمَّ اَطْعِمْ مَنْ اَطْعَمَنِيْ وَاسْقِ مَنْ سَقَانِيْ",
              "translation_urdu": "اے اللہ ! جس نے مجھے کھانا کھلایا ،آپ اس کو (اور) کھلائیے اور جس نے مجھے سیراب کیا، آپ اسے (اور) سیراب کیجئے۔",
              "title_en": "Supplication for the Host",
              "translation_en": "O Allah, bless for them what You have provided them, forgive them, and have mercy upon them.",
              "fawaid_en": "The Prophet ﷺ would make this supplication for those who hosted him or provided him food. (Muslim: 2042)"
            },
            {
              "point_id": "dua_changing_clothes",
              "title_urdu": "کپڑے بدلتے وقت",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِي كَسَانِيْ هٰذَا وَرَزَقَنِيْهِ مِنْ غَيْرِ حَوْلٍ مِّنِّي وَلَا قُوَّةٍ",
              "translation_urdu": "تعریف اللہ کی ہے جس نے مجھے یہ پہنایا اور میری کسی قوت اور طاقت کے بغیر مجھے عطا فرمایا۔",
              "title_en": "Supplication When Changing Clothes",
              "translation_en": "All praise is for Allah who clothed me with this and provided it for me without any power or strength from me.",
              "fawaid_en": "The Prophet ﷺ taught that saying this when wearing clothes brings forgiveness of sins and earns immense reward. (Abu Dawud: 4023)"
            },
            {
              "point_id": "dua_fear_of_enemy",
              "title_urdu": "جب کسى دشمن کا خوف ہو",
              "arabic_text": "اَللّٰھُمَّ اِنَّا نَجْعَلُكَ فِيْ نُحُوْرِهِمْ وَنَعُوْذُبِكَ مِنْ شُرُوْرِهِمْ",
              "translation_urdu": "اے اﷲ! ہم تجھی کو ان کے مقابل کرتے ہیں اور ان کے شر سے تیری پناہ مانگتے ہیں۔",
              "title_en": "Supplication When Fearing an Enemy",
              "translation_en": "O Allah, we place You before them, and we seek refuge in You from their evil.",
              "fawaid_en": "The Prophet ﷺ would say this when fearing a group of people. It provides divine protection and confounds one's enemies. (Abu Dawud: 1537)"
            },
            {
              "point_id": "dua_for_difficult_task",
              "title_urdu": "جب کوئى کام مشکل معلوم ہو",
              "arabic_text": "اَللّٰهُمَّ لَا سَهْلَ اِلَّا مَا جَعَلْتَه سَهْلًا وَّاَنْتَ تَجْعَلُ الْحَزَنَ سَهْلًا اِذَا شِئْتَ",
              "translation_urdu": "اے اﷲ! کوئی چیز آسان نہیں مگر جس کو تو آسان بنائے اور تو مشکل کو بھی آسان کردیتا ہے جب چاہے۔",
              "title_en": "Supplication for a Difficult Task",
              "translation_en": "O Allah, there is nothing easy except what You make easy, and You make the difficult easy if You wish.",
              "fawaid_en": "This supplication acknowledges that all ease comes from Allah alone and seeks His help in making difficult matters easy. (Ibn Hibban: 2427, authenticated)"
            },
            {
              "point_id": "dua_wearing_new_clothes",
              "title_urdu": "نیا کپڑا پہنتے وقت",
              "arabic_text": "اَللّٰهُمَّ لَكَ الْحَمْدُ اَنْتَ كَسَوْتَنِيْهِ اَسْاَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ وَاَعُوْذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ",
              "translation_urdu": "اے اللہ ! آپ ہی کی تعریف ہے جیسے کہ آپ نے مجھے یہ لباس پہنایا، میں آپ سے اس کپڑے کی بھلائی مانگتا ہوں اور اس کام کی بھلائی مانگتا ہوں جس کے لئے یہ بنایا گیا، اور میں ا س کے شر سے پناہ مانگتا ہوں اور جس کام کے لئے بنایا گیا اس کی بُرائی سے پناہ مانگتا ہوں۔",
              "title_en": "Supplication When Wearing New Clothes",
              "translation_en": "O Allah, for You is all praise. You have clothed me with this. I ask You for its goodness and the goodness of what it was made for, and I seek refuge in You from its evil and the evil of what it was made for.",
              "fawaid_en": "The Prophet ﷺ taught this comprehensive supplication when wearing new clothes, seeking blessing and protection. (Abu Dawud: 4020, Tirmidhi: 1767)"
            },
            {
              "point_id": "dua_entering_market",
              "title_urdu": "جب بازار مىں داخل ہو",
              "arabic_text": "لَاۤ اِلٰهَ اِلاَّ اللّٰهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِيْ وَيُمِيْتُ وَهُوَ حَيٌّ لَّا يَمُوْتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
              "translation_urdu": "اللہ کے سوا کوئی معبود نہیں، وہ ایک ہے اس کا کوئی شریک نہیں، سلطنت اسی کی ہے وہ زندہ کرتا ہے اور موت دیتا ہے، اور وہ خود زندہ ہے جسے موت نہیں آئے گی، اسی کے ہاتھ میں بھلائی ہے اور وہ ہر چیز پر قدرت رکھتا ہے۔",
              "title_en": "Supplication When Entering the Market",
              "translation_en": "There is no deity worthy of worship except Allah, alone without partner. To Him belongs dominion and to Him belongs all praise. He gives life and causes death, and He is living and does not die. In His hand is all good, and He is over all things competent.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever enters the market and says this will have one million good deeds written for him, one million sins erased, and will be raised one million levels.' (Tirmidhi: 3428, authenticated)"
            },
            {
              "point_id": "dua_riding_a_vehicle",
              "title_urdu": "جب کسى سوارى پر سوار ہو",
              "arabic_text": "سُبۡحٰنَ الَّذِىۡ سَخَّرَ لَنَا هٰذَا وَمَا كُنَّا لَهٗ مُقۡرِنِيۡنَۙ‏ (۱۳) وَاِنَّاۤ اِلٰى رَبِّنَا لَمُنۡقَلِبُوۡنَ",
              "translation_urdu": "پاک ہے وہ ذات جس نے یہ سواری ہمارے لئے مسخر کر دی، اور ہم اس کو قابو میں لانے والے نہ تھے، اور ہم اپنے پروردگار ہی کی طرف لوٹنے والے ہیں۔سورۃ زخرف(14)",
              "title_en": "Supplication When Riding a Vehicle",
              "translation_en": "Glory be to Him who has subjected this to us, and we could not have done so ourselves. And to our Lord we will surely return.",
              "fawaid_en": "This is from Surah Az-Zukhruf (43:13-14). The Prophet ﷺ would recite this when mounting his riding animal, acknowledging Allah's favor. (Abu Dawud: 2602, Tirmidhi: 3446)"
            }
          ],
          "title_en": "Daily Routine Supplications (Part 2)"
        },
        {
          "id": "travel_family_and_social_duas",
          "original_section_number": 3,
          "title_urdu": "سفر، خاندان اور معاشرتی دعائیں",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "dua_for_travel",
              "title_urdu": "سفر کى دعا",
              "arabic_text": "اَللّٰہُ اَکْبَرُ اَللّٰہُ اَکْبَرُ اَللّٰہُ اَکْبَرُ اَللّٰهُمَّ اِنَّا نَسْاَلُكَ فِي سَفَرِنَا هٰذَا الْبِرَّ وَالتَّقْوٰى وَمِنَ العَمَلِ مَا تَرْضٰى اَللّٰهُمَّ اَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالخَلِيْفَةُ فِي الْاَهْلِ وَالْمَالِ وَالْوَلَدِ اَللّٰهُمَّ اِنِّيْ اَعُوْذُ بِكَ مِنْ وَّعْثَاءِ السَّفَرِ وكَآبَةِ المَنْظَرِ وَسُوءِ المُنْقَلَبِ في المَالِ والاَهْلِ وَالْوَلَدِ اَللّٰهُمَّ هَوِّن عَلَيْنا سَفَرَنَا هٰذَا وَاطْوِ عَنَّا بُعْدَهٗ",
              "translation_urdu": "اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے،اللہ سب سے بڑا ہے، اے اللہ ! آپ ہی ہمارے سفر میں ہمارے ساتھ ہیں، اور آپ ہی ہمارے پیچھے ہمارے گھر والوں اور مال و اولادکے محافظ ہیں۔ اے اللہ ! ہم آپ سے اپنے اس سفر میں نیکی اور تقوىٰ کی توفیق مانگتے ہیں، اور ایسے عمل کی جس سے آپ راضی ہوں۔ اے اللہ ! میں آپ کی پناہ چاہتا ہوں سفر کی مشقت سے اور غم میں ڈالنے والے منظر سے، اور بُری حالت میں گھر والوں اور مال واولاد کے پاس واپس لوٹنے سے۔ اے اللہ ! ہمارے لئے اس سفر کو آسان کر دیجئے اور اس کی دوری کو ہمارے لئے لپیٹ دیجئے۔",
              "title_en": "Supplication for Travel",
              "translation_en": "Glory be to Him who has subjected this to us, and we could not have done so ourselves. And to our Lord we will surely return. O Allah, we ask You in this journey of ours for righteousness, piety, and deeds that are pleasing to You. O Allah, make easy for us this journey and make short its distance. O Allah, You are the Companion on the journey and the Guardian of the family. O Allah, I seek refuge in You from the hardships of travel, from seeing distressing sights, and from finding harm in property and family upon return.",
              "fawaid_en": "This comprehensive travel supplication was taught by the Prophet ﷺ to ensure safety and blessings throughout the journey. (Muslim: 1342)"
            },
            {
              "point_id": "dua_entering_new_town",
              "title_urdu": "جب کسى نئى بستى مىں داخل ہو",
              "arabic_text": "اَللّٰهُمَّ اِنِّي اَسْئَلُكَ خَيْرَ هٰذِهِ الْقَرْيَةِ وَخَيْرَ اَهْلِهَا وَخَيْرَ مَافِيْهَا وَاَعُوْذُبِكَ مِنْ شَرِّهَا وَشَرِّ اَهْلِهَا وَشَرِّ مَا فِيْهَا",
              "translation_urdu": "اے اللہ ! میں آپ سے سوال کرتا ہوں کہ مجھے اس بستی کی، اس کے رہنے والوں کی اور جو کچھ اس بستی میں ہے اس کی بھلائی نصیب ہو، اور میں آپ کی پناہ مانگتا ہوں اس کی ، اس کے رہنے والوں کی اور جو کچھ اس بستی میں ہے اس کی بُرائی سے۔",
              "title_en": "Supplication When Entering a New Town",
              "translation_en": "O Allah, Lord of the seven heavens and what they overshadow, Lord of the earths and what they carry, Lord of the devils and whomever they misguide, Lord of the winds and what they scatter, I ask You for the good of this town, the good of its people, and the good of what is in it. And I seek refuge in You from its evil, the evil of its people, and the evil of what is in it.",
              "fawaid_en": "The Prophet ﷺ would recite this comprehensive supplication when entering a new town for protection and to seek its blessings. (Nasa'i: 5515, authenticated)"
            },
            {
              "point_id": "dua_for_sick",
              "title_urdu": "بیمار کےلئے نبى ﷺ کى دعا",
              "arabic_text": "اَذْهِبِ الْبَاْسَ رَبَّ النَّاسِ وَاشْفِ اَنْتَ الشَّافِي لَا شِفَآءَ اِلَّا شِفَآؤُكَ شِفَآءٌ لَّا يُغَادِرُ سَقَمًا",
              "translation_urdu": "اے لوگوں کے پروردگار! بیماری دور کر دے اور شفا دے تو ہی شفا دینے والا ہے۔ تیرے سوا کسی کی شفاء ایسی نہیں جو بیماری کو دور کر دے۔(ام المؤمنین حضرت عائشہ صدیقہ ؓ فرماتی ہیں کہ رسول کریم ﷺ (کا یہ طریقہ تھا) جب ہم میں سے کوئی بیمار ہوتا آپ ﷺ اس پر داہنا ہاتھ پھیرتے اور یہ (دعا) فرماتے ۔)",
              "title_en": "Supplication for the Sick",
              "translation_en": "I ask Allah the Magnificent, Lord of the Magnificent Throne, to cure you. [Say seven times]",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever visits a sick person whose time has not yet come and says this seven times, Allah will cure him from that illness.' (Abu Dawud: 3106, Tirmidhi: 2083)"
            },
            {
              "point_id": "nikah_congratulation",
              "title_urdu": "نکاح کى مبارکباد",
              "arabic_text": "بَارَكَ اللّٰهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِيْ خَيْرٍ",
              "translation_urdu": "اللہ تعالىٰ تمہارے لئے یہ نکاح مبارک فرمائے اور تم پر برکتین نازل فرمائے اور تم دونوں کو خیر وخوبی کے ساتھ اکٹھا رکھے۔",
              "title_en": "Congratulation for Marriage",
              "translation_en": "May Allah bless you, and shower His blessings upon you, and bring you both together in goodness.",
              "fawaid_en": "This is the Sunnah way to congratulate someone on their marriage. The Prophet ﷺ taught this blessed supplication for newlyweds. (Abu Dawud: 2130, Tirmidhi: 1091)"
            },
            {
              "point_id": "dua_at_intercourse",
              "title_urdu": "جماع کے وقت",
              "arabic_text": "بِسْمِ اللّٰهِ اَللّٰهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَارَزَقْتَنَا",
              "translation_urdu": "اللہ کے نام سے ، یا اللہ ! ہم کو شیطان سے دور رکھ، اور شیطان کو اس چیز سے(یعنی اولاد) سے دور رکھ جو آپ ہمیں عطا فرمائیں ۔",
              "title_en": "Supplication at Intercourse",
              "translation_en": "In the name of Allah. O Allah, keep us away from Satan and keep Satan away from what You provide us.",
              "fawaid_en": "The Prophet ﷺ said: 'If anyone of you, when intending to have intercourse with his wife, says this, then if a child is destined for them, Satan will never be able to harm that child.' (Bukhari: 141, Muslim: 1434)"
            },
            {
              "point_id": "dua_at_ejaculation",
              "title_urdu": "انزال کے وقت",
              "arabic_text": "اَللّٰهُمَّ لَاتَجْعَلْ لِلشَّيْطَانِ فِيْمَا رَزَقْتَنِيْ نَصِيْبًا",
              "translation_urdu": "یا اللہ ! جو کچھ (اولاد) آپ مجھے عطا فرمائیں اس میں شیطان کا کوئی حصہ نہ لگائیے۔",
              "title_en": "Supplication After Intercourse",
              "translation_en": "All praise is for Allah who created from water a human being and made him into lineage and relationships. And your Lord is Ever All-Powerful.",
              "fawaid_en": "This is from Surah Al-Furqan (25:54). It is recommended to recite this after intercourse, acknowledging Allah's power in creation. (Authenticated by scholars)"
            },
            {
              "point_id": "dua_seeing_new_moon",
              "title_urdu": "مہینے کا پہلا چاند دیکھ کر",
              "arabic_text": "اَللّٰهُمَّ اَهْلِلْهُ عَلَيْنَا بِاليُمْنِ وَالْاِيْمَانِ وَالسَّلَامَةِ وَالْاِسْلَامِ رَبِّيْ وَرَبُّكَ اللّٰهُ",
              "translation_urdu": "یا اللہ ! اس چاند کو ہم پر برکت ایمان ،سلامتی اور اسلام کے ساتھ طلوع فرمائیے (اے چاند) میرا اور تیرا دونوں کا پروردگار اللہ ہے ۔",
              "title_en": "Supplication Upon Seeing the New Moon",
              "translation_en": "Allah is the Greatest. O Allah, bring it over us with security and faith, safety and Islam, and harmony with what You love and are pleased with. Our Lord and your Lord is Allah.",
              "fawaid_en": "The Prophet ﷺ would recite this supplication when sighting the new moon, seeking blessings for the new month. (Tirmidhi: 3451, authenticated)"
            },
            {
              "point_id": "dua_when_angry",
              "title_urdu": "جب غصہ آئے",
              "arabic_text": "اَعُوْذُ بِاللّٰهِ مِنَ الشَّيْطٰنِ الرَّجِيْمِ",
              "translation_urdu": "میں اللہ تعالیٰ کی پناہ میں آتا ہوں شیطان مردود سے۔",
              "title_en": "Supplication When Angry",
              "translation_en": "I seek refuge in Allah from the accursed Satan.",
              "fawaid_en": "The Prophet ﷺ said: 'If a person says this when angry, his anger will go away.' He also advised to change position, perform wudu, and remain silent when angry. (Abu Dawud: 4784, authenticated)"
            },
            {
              "point_id": "jame_dua",
              "title_urdu": "جامع دعا",
              "arabic_text": "اَللّٰھُمَّ اِنَّا نَسْاَلُکَ مِنْ خَیْرِ مَاسَاَلَکَ مِنْہُ نَبِیُّکَ مُحَمَّدٌ (صَلَّی اللّٰہُ عَلَیْہِ وَسَلَّمَ) وَنَعُوْذُ بِکَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْہُ نَبِیُّکَ مُحَمَّدٌ (صَلَّی اللّٰہُ عَلَیْہِ وَسَلَّمَ) وَاَنْتَ الْمُسْتَعَانُ وَعَلَیْکَ الْبَلَاغُ وَلَاحَوْلَ وَلَاقُوَّۃَ اِلَّا بِاللّٰہِ",
              "translation_urdu": "حضرت ابو امامہ رضی اللہ عنہ نے حضور ﷺ سے عرض کیا کہ حضور! دعائیں تو آپ نے بہت سی بتادی ہیں اور ساری یاد رہتی نہیں، کوئی ایسی دعا بتادیجئے جو سب دعاؤں کو شامل ہوجائے۔ اس پر حضور ﷺ نے یہ دعا تعلیم فرمائی۔",
              "title_en": "Comprehensive Supplication",
              "translation_en": "O Allah, I ask You for all good - its immediate and delayed aspects, what I know of it and what I do not know. And I seek refuge in You from all evil - its immediate and delayed aspects, what I know of it and what I do not know. O Allah, I ask You for Paradise and whatever brings one closer to it in word and deed. And I seek refuge in You from the Fire and whatever brings one closer to it in word and deed. And I ask You to make every decree that You decree for me good.",
              "fawaid_en": "Aisha (RA) narrates that the Prophet ﷺ loved comprehensive supplications and would abandon others. This dua encompasses all worldly and spiritual good and protection from all evil. (Ibn Majah: 3846, authenticated)"
            },
            {
              "point_id": "dua_at_end_of_gathering",
              "title_urdu": "ہر مجلس کے آخر میں",
              "arabic_text": "سُبْحٰنَكَ اللّٰهُمَّ وَبِحَمْدِكَ لَآ اِلٰهَ اِلَّا اَنْتَ اَسْتَغْفِرُكَ وَاَتُوْبُ اِلَيْكَ",
              "translation_urdu": "یا اللہ میں آپ کی پاکی بیان کرتا ہوں اور آپ کی حمد کرتا ہوں ، آپ کے سوا کوئی معبود نہیں، میں آپ سے مغفرت مانگتا ہوں اور آپ کے حضور توبہ کرتا ہوں۔",
              "title_en": "Supplication at End of Gathering",
              "translation_en": "Glory be to You, O Allah, and praise be to You. I testify that there is no deity worthy of worship except You. I seek Your forgiveness and repent to You.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever sits in a gathering and engages in vain talk, then says this before leaving, all his sins in that gathering will be forgiven.' This is the expiation for gatherings. (Abu Dawud: 4859, Tirmidhi: 3433)"
            },
            {
              "point_id": "dua_looking_in_mirror",
              "title_urdu": "جب آئینہ میں اپنا چہرہ دیکھے تو یہ دعا مانگے",
              "arabic_text": "اَللّٰهُمَّ اَنْتَ حَسَّنْتَ خَلْقِيْ فَحَسِّنْ خُلُقِيْ",
              "translation_urdu": "اے اللہ ! تو نے ہی میری صورت اتنی اچھی بنائی ہے پس تو ہی میرے اخلاق بھی اچھے بنا دے۔",
              "title_en": "Supplication When Looking in the Mirror",
              "translation_en": "O Allah, just as You have made my external appearance beautiful, beautify my character.",
              "fawaid_en": "The Prophet ﷺ taught this supplication when looking in the mirror, linking physical beauty with spiritual and moral beauty. (Musnad Ahmad: 24260, authenticated)"
            },
            {
              "point_id": "dua_for_new_spouse_servant",
              "title_urdu": "عورت نکاح کر کے لائے یا خادم لائے تو پڑھے",
              "arabic_text": "اَللّٰهُمَّ اِنِّي اَسْاَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ وَاَعُوْذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ",
              "translation_urdu": "اے اللہ ! میں تجھ سے اس کی اور اس کی فطرت کی خیر وبرکت کا سوال کرتا ہوں اور اس کے اور اس کی فطرت کے شر سے تیری پناہ لیتا ہوں ۔",
              "title_en": "Supplication for New Spouse or Servant",
              "translation_en": "O Allah, I ask You for her goodness and the goodness she was created with, and I seek refuge in You from her evil and the evil she was created with.",
              "fawaid_en": "The Prophet ﷺ taught that when one acquires a new spouse, servant, or riding animal, hold the forelock and recite this supplication for blessings. (Abu Dawud: 2160, Ibn Majah: 1918)"
            }
          ],
          "title_en": "Family and Social Supplications"
        },
        {
          "id": "quranic_duas_part_1",
          "original_section_number": 4,
          "title_urdu": "قرآنی دعائیں (حصہ اول)",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "dua_seeing_afflicted",
              "title_urdu": "بیمار یا مصیبت زدہ کو دیکھ کر یہ دعا پڑھے",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِيْ عَافَانِيْ مِمَّا ابْتَلَاكَ بِهٖ وَفَضَّلَنِيْ عَلٰي كَثِيْرٍ مِّمَّنْ خَلَقَ تَفْضِيْلًا",
              "translation_urdu": "تمام تعریفیں اﷲکے لیے ہیں جس نے عافت دی مجھے اس (تکلیف) سے جس میں تجھے مبتلا کیا اور اپنی بہت سے مخلوق میں سے مجھے فضیلت بخشی۔",
              "title_en": "Supplication Upon Seeing an Afflicted Person",
              "translation_en": "All praise is for Allah who has spared me from what He has afflicted you with, and favored me greatly over much of His creation.",
              "fawaid_en": "The Prophet ﷺ said: 'Whoever sees an afflicted person and says this quietly, he will be protected from that affliction.' This creates gratitude while showing mercy to others. (Tirmidhi: 3432)"
            },
            {
              "point_id": "dua_hidayat_surah_fatiha",
              "title_urdu": "ہدایت اور صراط مستقیم کی دعا (سورۃ الفاتحہ)",
              "arabic_text": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِیْنَۙ الرَّحْمٰنِ الرَّحِیْمِۙ مٰلِكِ یَوْمِ الدِّیْنِؕ اِیَّاكَ نَعْبُدُ وَ اِیَّاكَ نَسْتَعِیْنُؕ اِهْدِنَا الصِّرَاطَ الْمُسْتَقِیْمَۙ صِرَاطَ الَّذِیْنَ اَنْعَمْتَ عَلَیْهِمْ١ۙ۬ۦ غَیْرِ الْمَغْضُوْبِ عَلَیْهِمْ وَ لَا الضَّآلِّیْنَ۠",
              "translation_urdu": "اللہ کے نام سے جو رحمان و رحیم ہے تعریف اللہ ہی کے لیے ہے جو تمام کائنات کا رب ہے رحمان اور رحیم ہے روز جزا کا مالک ہے ہم تیری ہی عبادت کرتے ہیں اور تجھی سے مدد مانگتے ہیں ہمیں سیدھا راستہ دکھا اُن لوگوں کا راستہ جن پر تو نے انعام فرمایا، جو معتوب نہیں ہوئے، جو بھٹکے ہوئے نہیں ہیں۔",
              "title_en": "Supplication for Guidance (Surah Al-Fatihah)",
              "translation_en": "Guide us to the straight path - the path of those upon whom You have bestowed favor, not of those who have earned anger or of those who have gone astray.",
              "fawaid_en": "This is from Surah Al-Fatihah (1:6-7), the greatest chapter of the Quran. The Prophet ﷺ said there is nothing like it in the Quran. It must be recited in every unit of prayer and contains the essence of all supplications. (Bukhari: 4474)"
            },
            {
              "point_id": "dua_protection_from_ignorance",
              "title_urdu": "جہالت سے حفاظت کی دعا (سورۃ البقرۃ - 67)",
              "arabic_text": "اَعُوْذُ بِاللّٰهِ اَنْ اَكُوْنَ مِنَ الْجٰهِلِیْنَ",
              "translation_urdu": "میں پناہ مانگتا ہوں اللہ کی (اس بات سے) کہ میں جاہلوں میں سے ہو جاؤں۔",
              "title_en": "Protection from Ignorance",
              "translation_en": "My Lord, I seek refuge in You from asking You that of which I have no knowledge. And unless You forgive me and have mercy upon me, I will be among the losers.",
              "fawaid_en": "This is Nuh's (AS) supplication from Surah Hud (11:47). It teaches humility before Allah and seeking refuge from ignorance and asking for inappropriate things. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_acceptance_forgiveness",
              "title_urdu": "اعمال کی قبولیت اور درگزر کی دعا (سورۃ البقرۃ 127-128)",
              "arabic_text": "رَبَّنَا تَقَبَّلْ مِنَّا١ؕ اِنَّكَ اَنْتَ السَّمِیْعُ الْعَلِیْمُ رَبَّنَا وَ اجْعَلْنَا مُسْلِمَیْنِ لَكَ وَ مِنْ ذُرِّیَّتِنَاۤ اُمَّةً مُّسْلِمَةً لَّكَ١۪ وَ اَرِنَا مَنَاسِكَنَا وَ تُبْ عَلَیْنَا١ۚ اِنَّكَ اَنْتَ التَّوَّابُ الرَّحِیْمُ",
              "translation_urdu": "اے ہمارے رب، ہم سے یہ خدمت قبول فرما لے، تو سب کی سننے اور سب کچھ جاننے والا ہے۔ اے رب، ہم دونوں کو اپنا مسلم (مُطیع فرمان) بنا، ہماری نسل سے ایک ایسی قوم اٹھا، جو تیری مسلم ہو، ہمیں اپنی عبادت کے طریقے بتا، اور ہماری کوتاہیوں سے در گزر فرما، تو بڑا معاف کرنے والا اور رحم فرمانے والا ہے۔",
              "title_en": "Acceptance and Forgiveness",
              "translation_en": "Our Lord, accept this from us. Indeed, You are the All-Hearing, the All-Knowing. Our Lord, and make us Muslims submitted to You and from our descendants a Muslim nation submitted to You. And show us our rites and accept our repentance. Indeed, You are the Accepting of repentance, the Merciful.",
              "fawaid_en": "This is the supplication of Ibrahim and Ismail (AS) from Surah Al-Baqarah (2:127-128) when building the Kaaba. It encompasses acceptance of deeds, guidance for offspring, and sincere repentance. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_dunya_akhira_hasanah",
              "title_urdu": "دنیا اور آخرت میں بھلائی کی دعا (سورۃ البقرۃ 201)",
              "arabic_text": "رَبَّنَاۤ اٰتِنَا فِی الدُّنْیَا حَسَنَةً وَّ فِی الْاٰخِرَةِ حَسَنَةً وَّ قِنَا عَذَابَ النَّارِ",
              "translation_urdu": "اے ہمارے رب! ہمیں دنیا میں بھی بھلائی دے اور آخرت میں بھی بھلائی اور آگ کے عذاب سے ہمیں بچا۔",
              "title_en": "Good in This World and the Hereafter",
              "translation_en": "Our Lord, give us in this world good and in the Hereafter good and protect us from the punishment of the Fire.",
              "fawaid_en": "This is from Surah Al-Baqarah (2:201). The Prophet ﷺ used to recite this frequently during Tawaf. It is the most comprehensive dua for worldly and spiritual success. (Bukhari: 4522, Muslim: 1264)"
            },
            {
              "point_id": "dua_sabr_nusr_against_kafiroon",
              "title_urdu": "صبر، استقامت اور نصرت کی دعا (سورۃ البقرۃ 250)",
              "arabic_text": "رَبَّنَاۤ اَفْرِغْ عَلَیْنَا صَبْرًا وَّ ثَبِّتْ اَقْدَامَنَا وَ انْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِیْنَؕ",
              "translation_urdu": "اے ہمارے رب ہم پر صبر کا فیضان کر، ہمارے قدم جما دے اور اس کافر گروہ پر ہمیں فتح نصیب کر۔",
              "title_en": "Patience and Victory Against Disbelievers",
              "translation_en": "Our Lord, pour upon us patience and plant our feet firmly and give us victory over the disbelieving people.",
              "fawaid_en": "This is from Surah Al-Baqarah (2:250), the supplication made by Talut's army. It seeks three essential qualities for success: patience, firmness, and divine victory. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_maghfirat_ilayka_almasir",
              "title_urdu": "مغفرت کی دعا (سورۃ البقرۃ 285)",
              "arabic_text": "سَمِعْنَا وَ اَطَعْنَا١٘ۗ غُفْرَانَكَ رَبَّنَا وَ اِلَیْكَ الْمَصِیْرُ",
              "translation_urdu": "ہم نے (اللہ اور رسول کے احکام کو توجہ سے) سن لیا ہے، اور ہم خوشی سے (ان کی) تعمیل کرتے ہیں۔ اے ہمارے پروردگار ہم آپ کی مغفرت کے طلبگار ہیں، اور آپ ہی کی طرف ہمیں لوٹ کرجانا ہے۔",
              "title_en": "Forgiveness and Return to Allah",
              "translation_en": "Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.",
              "fawaid_en": "This is the repentance of Adam and Hawwa (AS) from Surah Al-A'raf (7:23). It is the best form of seeking forgiveness, acknowledging one's sins and complete dependence on Allah's mercy. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_bhuul_chuk_khata",
              "title_urdu": "بھول چوک اور خطاؤں پر درگزر کی دعا (سورۃ البقرۃ 286)",
              "arabic_text": "رَبَّنَا لَا تُؤَاخِذْنَاۤ اِنْ نَّسِیْنَاۤ اَوْ اَخْطَاْنَا١ۚ رَبَّنَا وَ لَا تَحْمِلْ عَلَیْنَاۤ اِصْرًا كَمَا حَمَلْتَهٗ عَلَى الَّذِیْنَ مِنْ قَبْلِنَا١ۚ رَبَّنَا وَ لَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهٖ١ۚ وَ اعْفُ عَنَّا١ٙ وَ اغْفِرْ لَنَا١ٙ وَ ارْحَمْنَا١ٙ اَنْتَ مَوْلٰىنَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِیْنَ۠",
              "translation_urdu": "اے ہمارے رب! ہم سے بھول چوک میں جو قصور ہو جائیں، ان پر گرفت نہ کر مالک! ہم پر وہ بوجھ نہ ڈال، جو تو نے ہم سے پہلے لوگوں پر ڈالے تھے پروردگار! جس بار کو اٹھانے کی طاقت ہم میں نہیں ہے، وہ ہم پر نہ رکھ، ہمارے ساتھ نرمی کر، ہم سے در گزر فرما، ہم پر رحم کر، تو ہمارا مولیٰ ہے، کافروں کے مقابلے میں ہماری مدد کر۔",
              "title_en": "Forgiveness for Mistakes and Forgetfulness",
              "translation_en": "Our Lord, do not impose blame upon us if we forget or make a mistake. Our Lord, and do not lay upon us a burden like that which You laid upon those before us. Our Lord, and do not burden us with that which we have no ability to bear. And pardon us, and forgive us, and have mercy upon us. You are our Protector, so give us victory over the disbelieving people.",
              "fawaid_en": "This is from Surah Al-Baqarah (2:286). Allah responded: 'I have done so.' It removes accountability for genuine forgetfulness and mistakes, and seeks relief from excessive burdens. (Muslim: 126)"
            },
            {
              "point_id": "dua_istiqamat_ala_sirat",
              "title_urdu": "صراط مستقیم پر استقامت کی دعا (سورۃ آل عمران 8)",
              "arabic_text": "رَبَّنَا لَا تُزِغْ قُلُوْبَنَا بَعْدَ اِذْ هَدَیْتَنَا وَ هَبْ لَنَا مِنْ لَّدُنْكَ رَحْمَةً١ۚ اِنَّكَ اَنْتَ الْوَهَّابُ",
              "translation_urdu": "پروردگار! جب تو ہمیں سیدھے رستہ پر لگا چکا ہے، تو پھر کہیں ہمارے دلوں کو کجی میں مبتلا نہ کر دیجیو ہمیں اپنے خزانہ فیض سے رحمت عطا کر کہ تو ہی فیاض حقیقی ہے۔",
              "title_en": "Steadfastness Upon the Straight Path",
              "translation_en": "Our Lord, do not let our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower.",
              "fawaid_en": "This is from Surah Aal-e-Imran (3:8). It seeks continuous guidance and protection from misguidance after being guided. The scholars emphasize its importance in daily supplications. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_protection_from_fire",
              "title_urdu": "جہنم کی آگ سے حفاظت کی دعا (سورۃ آل عمران 16)",
              "arabic_text": "رَبَّنَاۤ اِنَّنَاۤ اٰمَنَّا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَ قِنَا عَذَابَ النَّارِۚ",
              "translation_urdu": "مالک! ہم ایمان لائے، ہماری خطاؤں سے در گزر فرما اور ہمیں آتش دوزخ سے بچا لے۔",
              "title_en": "Protection from the Fire",
              "translation_en": "Our Lord, indeed whoever You admit to the Fire - You have disgraced him, and the wrongdoers will have no helpers. Our Lord, indeed we have heard a caller calling to faith, saying: Believe in your Lord, and we have believed. Our Lord, so forgive us our sins and remove from us our misdeeds and cause us to die with the righteous.",
              "fawaid_en": "This is from Surah Aal-e-Imran (3:192-193). It acknowledges the severity of Hellfire and responds to the call of faith with sincere belief and seeking righteous end. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_righteous_offspring",
              "title_urdu": "نیک اولاد کی دعا (سورۃ آل عمران 38)",
              "arabic_text": "رَبِّ هَبْ لِیْ مِنْ لَّدُنْكَ ذُرِّیَّةً طَیِّبَةً١ۚ اِنَّكَ سَمِیْعُ الدُّعَآءِ",
              "translation_urdu": "پروردگار! اپنی قدرت سے مجھے نیک اولاد عطا کر تو ہی دعا سننے والا ہے۔",
              "title_en": "Righteous Offspring",
              "translation_en": "My Lord, grant me from Yourself righteous offspring. Indeed, You are the Hearer of supplication.",
              "fawaid_en": "This is Zakariyya's (AS) supplication from Surah Aal-e-Imran (3:38). Despite his old age, Allah blessed him with Yahya (AS). It teaches us to ask Allah for righteous children who will be a blessing. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_istighfar_and_firmness",
              "title_urdu": "ثابت قدمی اور اللہ کی مدد کی دعا (سورۃ آل عمران 147)",
              "arabic_text": "رَبَّنَا اغْفِرْ لَنَا ذُنُوْبَنَا وَ اِسْرَافَنَا فِیْۤ اَمْرِنَا وَ ثَبِّتْ اَقْدَامَنَا وَ انْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِیْنَ",
              "translation_urdu": "اے ہمارے رب! ہماری غلطیوں اور کوتاہیوں سے درگزر فرما، ہمارے کام میں تیرے حدود سے جو کچھ تجاوز ہو گیا ہو اُسے معاف کر دے، ہمارے قدم جما دے اور کافروں کے مقابلہ میں ہماری مدد کر۔",
              "title_en": "Seeking Forgiveness and Firmness",
              "translation_en": "Our Lord, forgive us our sins and the excess committed in our affairs and plant our feet firmly and give us victory over the disbelieving people.",
              "fawaid_en": "This is from Surah Aal-e-Imran (3:147), the supplication of the Prophets and their followers. It combines seeking forgiveness with requesting steadfastness and victory. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_protection_from_khizlan",
              "title_urdu": "قیامت کے دن رسوائی سے بچنے کی دعا (سورۃ آل عمران 193-194)",
              "arabic_text": "رَبَّنَا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَ كَفِّرْ عَنَّا سَیِّاٰتِنَا وَ تَوَفَّنَا مَعَ الْاَبْرَارِۚ رَبَّنَا وَ اٰتِنَا مَا وَعَدْتَّنَا عَلٰى رُسُلِكَ وَ لَا تُخْزِنَا یَوْمَ الْقِیٰمَةِ١ؕ اِنَّكَ لَا تُخْلِفُ الْمِیْعَادَ",
              "translation_urdu": "اے ہمارے آقا! جو قصور ہم سے ہوئے ہیں ان سے درگزر فرما، جو برائیاں ہم میں ہیں انہیں دور کر دے اور ہمارا خاتمہ نیک لوگوں کے ساتھ کر۔ خداوندا! جو وعدے تو نے اپنے رسولوں کے ذریعہ سے کیے ہیں اُن کو ہمارے ساتھ پورا کر اور قیامت کے دن ہمیں رسوائی میں نہ ڈال، بے شک تو اپنے وعدے کے خلاف کرنے والا نہیں ہے۔",
              "title_en": "Protection from Disgrace",
              "translation_en": "Our Lord, we have believed, so forgive us and have mercy upon us, and You are the best of the merciful.",
              "fawaid_en": "This is from Surah Al-Mu'minun (23:109), the supplication of sincere believers seeking Allah's mercy and protection from disgrace on the Day of Judgment. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_inclusion_among_witnesses",
              "title_urdu": "گواہی دینے والوں میں شمولیت کی دعا (سورۃ المائدۃ 83)",
              "arabic_text": "رَبَّنَاۤ اٰمَنَّا فَاكْتُبْنَا مَعَ الشّٰهِدِیْنَ",
              "translation_urdu": "پروردگار! ہم ایمان لائے، ہمارا نام گواہی دینے والوں میں لکھ لے۔",
              "title_en": "Inclusion Among the Witnesses",
              "translation_en": "Our Lord, we have believed in what You revealed and we have followed the messenger, so register us among the witnesses.",
              "fawaid_en": "This is from Surah Aal-e-Imran (3:53), the supplication of the disciples of Isa (AS). It declares faith and seeks to be recorded among those who bear witness to the truth. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_inclusion_among_saliheen",
              "title_urdu": "نیک لوگوں میں شامل ہونے کی دعا (سورۃ المائدۃ 84)",
              "arabic_text": "وَ نَطْمَعُ اَنْ یُّدْخِلَنَا رَبُّنَا مَعَ الْقَوْمِ الصّٰلِحِیْنَ",
              "translation_urdu": "ہم اِس بات کی خواہش رکھتے ہیں کہ ہمارا رب ہمیں صالح لوگوں میں شامل کرے۔",
              "title_en": "Inclusion Among the Righteous",
              "translation_en": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve. And admit me by Your mercy into the ranks of Your righteous servants.",
              "fawaid_en": "This is Sulaiman's (AS) supplication from Surah An-Naml (27:19). It seeks gratitude, righteous deeds, and inclusion among the righteous through Allah's mercy. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_maghfirat_and_rahmah_aaraf",
              "title_urdu": "مغفرت اور رحمت کی دعا (سورۃ الاعراف 23)",
              "arabic_text": "رَبَّنَا ظَلَمْنَاۤ اَنْفُسَنَا١ٚ وَ اِنْ لَّمْ تَغْفِرْ لَنَا وَ تَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِیْنَ",
              "translation_urdu": "اے رب! ہم نے اپنے اوپر ستم کیا، اب اگر تو نے ہم سے در گزر نہ فرمایا اور رحم نہ کیا تو یقیناً ہم تباہ ہو جائیں گے۔",
              "title_en": "Forgiveness and Mercy (Al-A'raf)",
              "translation_en": "Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.",
              "fawaid_en": "This is from Surah Al-A'raf (7:23), the first supplication for forgiveness made by Adam and Hawwa (AS). It is the perfect form of repentance. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_protection_from_dhulm",
              "title_urdu": "ظالموں کی معیت سے بچنے کی دعا (سورۃ الاعراف 47)",
              "arabic_text": "رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظّٰلِمِیْنَ۠",
              "translation_urdu": "اے رب! ہمیں اِن ظالم لوگوں میں شامل نہ کیجیو۔",
              "title_en": "Protection from Oppression",
              "translation_en": "My Lord, save me from the wrongdoing people.",
              "fawaid_en": "This is Musa's (AS) supplication from Surah Al-Qasas (28:21) when fleeing from Pharaoh's tyranny. It seeks Allah's protection from oppressors. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_decision_by_haqq",
              "title_urdu": "حق کے فیصلے کی دعا (سورۃ الاعراف 89)",
              "arabic_text": "رَبَّنَا افْتَحْ بَیْنَنَا وَ بَیْنَ قَوْمِنَا بِالْحَقِّ وَ اَنْتَ خَیْرُ الْفٰتِحِیْنَ",
              "translation_urdu": "اے رب، ہمارے اور ہماری قوم کے درمیان ٹھیک ٹھیک فیصلہ کر دے اور تو بہترین فیصلہ کرنے والا ہے۔",
              "title_en": "Decision by Truth",
              "translation_en": "My Lord, judge between us and our people in truth, and You are the best of those who give judgment.",
              "fawaid_en": "This is from Surah Al-A'raf (7:89), seeking Allah's just judgment in disputes. It acknowledges Allah as the ultimate and most just judge. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_sabr_and_muslim_ending",
              "title_urdu": "صبر اور حسنِ خاتمہ کی دعا (سورۃ الاعراف 126)",
              "arabic_text": "رَبَّنَاۤ اَفْرِغْ عَلَیْنَا صَبْرًا وَّ تَوَفَّنَا مُسْلِمِیْنَ۠",
              "translation_urdu": "اے رب، ہم پر صبر کا فیضان کر اور ہمیں دنیا سے اٹھا تو اِس حال میں کہ ہم تیرے فرماں بردار ہوں۔",
              "title_en": "Patience and Muslim Ending",
              "translation_en": "So have patience. Indeed, the best outcome is for the righteous. My Lord, cause me to die as a Muslim and join me with the righteous.",
              "fawaid_en": "This is Yusuf's (AS) supplication from Surah Yusuf (12:101). It seeks the most important matter - to die as a Muslim and be raised with the righteous. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_maghfirat_for_self_brother",
              "title_urdu": "معافی اور رحمت کی دعا (سورۃ الاعراف 151)",
              "arabic_text": "رَبِّ اغْفِرْ لِیْ وَ لِاَخِیْ وَ اَدْخِلْنَا فِیْ رَحْمَتِكَ١ۖ٘ وَ اَنْتَ اَرْحَمُ الرّٰحِمِیْنَ۠",
              "translation_urdu": "اے رب، مجھے اور میرے بھائی کو معاف کر اور ہمیں اپنی رحمت میں داخل فرما، تو سب سے بڑھ کر رحیم ہے۔",
              "title_en": "Forgiveness for Self and Believers",
              "translation_en": "Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts any resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful.",
              "fawaid_en": "This is from Surah Al-Hashr (59:10). It seeks forgiveness for oneself and all believers, past and present, and removal of resentment from the heart. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_hassanah_dunya_akhira_aaraf",
              "title_urdu": "دنیا اور آخرت میں بھلائی کی دعا (سورۃ الاعراف 155-156)",
              "arabic_text": "اَنْتَ وَلِیُّنَا فَاغْفِرْ لَنَا وَ ارْحَمْنَا وَ اَنْتَ خَیْرُ الْغٰفِرِیْنَ وَ اكْتُبْ لَنَا فِیْ هٰذِهِ الدُّنْیَا حَسَنَةً وَّ فِی الْاٰخِرَةِ اِنَّا هُدْنَاۤ اِلَیْكَ",
              "translation_urdu": "ہمارے سر پرست تو آپ ہی ہیں پس ہمیں معاف کر دیجیے اور ہم پر رحم فرمائیے، آپ سب سے بڑھ کر معاف فرمانے والے ہیں۔ اور ہمارے لیے اس دنیا کی بھلائی بھی لکھ دیجیے اور آخرت کی بھی، ہم نے آپ کی طرف رجوع کر لیا۔",
              "title_en": "Good in This World and the Hereafter (Al-A'raf)",
              "translation_en": "My Lord, decree for us in this world good and in the Hereafter. Indeed, we have turned back to You.",
              "fawaid_en": "This is Musa's (AS) supplication from Surah Al-A'raf (7:156). It seeks Allah's decree of good in both worlds through repentance and return to Him. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_tawakkal_rabbul_arsh",
              "title_urdu": "اللہ پر توکل کی دعا (سورۃ التوبۃ 129)",
              "arabic_text": "حَسْبِیَ اللّٰهُ١ۖۗ٘ لَاۤ اِلٰهَ اِلَّا هُوَ١ؕ عَلَیْهِ تَوَكَّلْتُ وَ هُوَ رَبُّ الْعَرْشِ الْعَظِیْمِ۠",
              "translation_urdu": "میرے لیے اللہ بس کرتا ہے، کوئی معبود نہیں مگر وہ، اُسی پر میں نے بھروسہ کیا اور وہ مالک ہے عرش عظیم کا۔",
              "title_en": "Reliance on the Lord of the Throne",
              "translation_en": "My reliance is upon Allah, my Lord and your Lord. There is no creature but that He holds its forelock. Indeed, my Lord is on a straight path.",
              "fawaid_en": "This is Hud's (AS) declaration from Surah Hud (11:56). It expresses complete trust in Allah and acknowledges His control over all creation. (Tafsir Ibn Kathir)"
            }
          ],
          "title_en": "Supplications for Protection and Refuge"
        },
        {
          "id": "quranic_duas_part_2",
          "original_section_number": 5,
          "title_urdu": "قرآنی دعائیں (حصہ دوم)",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "dua_protection_from_fitna",
              "title_urdu": "فتنہ بننے سے بچنے کی دعا (سورۃ یونس 85-86)",
              "arabic_text": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظّٰلِمِیْنَۙ وَ نَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكٰفِرِیْنَ",
              "translation_urdu": "اے ہمارے رب، ہمیں ظالم لوگوں کے لیے فتنہ نہ بنا۔ اور اپنی رحمت سے ہم کو کافروں سے نجات دے۔",
              "title_en": "Protection from Trials",
              "translation_en": "Our Lord, do not make us a trial for the wrongdoing people. And save us by Your mercy from the disbelieving people.",
              "fawaid_en": "This is Musa's (AS) supplication from Surah Yunus (10:85-86). It seeks protection from being tested through the hands of wrongdoers and oppressors. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_protection_from_laailmi",
              "title_urdu": "جہالت اور لاعلمی سے بچنے کی دعا (سورۃ ہود 47)",
              "arabic_text": "رَبِّ اِنِّیْۤ اَعُوْذُ بِكَ اَنْ اَسْئَلَكَ مَا لَیْسَ لِیْ بِهٖ عِلْمٌ١ؕ وَ اِلَّا تَغْفِرْ لِیْ وَ تَرْحَمْنِیْۤ اَكُنْ مِّنَ الْخٰسِرِیْنَ",
              "translation_urdu": "اے میرے رب، میں تیری پناہ مانگتا ہوں اِس سے کہ وہ چیز تجھ سے مانگوں جس کا مجھے علم نہیں اگر تو نے مجھ معاف نہ کیا اور رحم نہ فرمایا تو میں برباد ہو جاؤں گا۔",
              "title_en": "Protection from Being Among the Ignorant",
              "translation_en": "My Lord, I seek refuge in You from asking You that of which I have no knowledge. And unless You forgive me and have mercy upon me, I will be among the losers.",
              "fawaid_en": "This is Nuh's (AS) supplication from Surah Hud (11:47). It seeks protection from ignorant behavior and asking Allah inappropriately. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_hiding_and_revealing",
              "title_urdu": "ظاہر و باطن اللہ کو دکھانے کی دعا (سورۃ ابراہیم 38)",
              "arabic_text": "رَبَّنَاۤ اِنَّكَ تَعْلَمُ مَا نُخْفِیْ وَ مَا نُعْلِنُ١ؕ وَ مَا یَخْفٰى عَلَى اللّٰهِ مِنْ شَیْءٍ فِی الْاَرْضِ وَ لَا فِی السَّمَآءِ",
              "translation_urdu": "پروردگار، تو جانتا ہے جو کچھ ہم چھپاتے ہیں اور جو کچھ ظاہر کرتے ہیں\" اور واقعی اللہ سے کچھ بھی چھپا ہوا نہیں ہے، نہ زمین میں نہ آسمانوں میں۔",
              "title_en": "Knowledge of the Hidden and Revealed",
              "translation_en": "My Lord, indeed You know what we conceal and what we reveal, and nothing is hidden from Allah on earth or in the heaven.",
              "fawaid_en": "This is Ibrahim's (AS) acknowledgment from Surah Ibrahim (14:38). It recognizes Allah's complete knowledge of all affairs, hidden and apparent. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_iqamat_salat_and_walidain",
              "title_urdu": "اقامت نماز اور والدین کی بخشش کی دعا (سورۃ ابراہیم 40-41)",
              "arabic_text": "رَبِّ اجْعَلْنِیْ مُقِیْمَ الصَّلٰوةِ وَ مِنْ ذُرِّیَّتِیْ١ۖۗ رَبَّنَا وَ تَقَبَّلْ دُعَآءِ رَبَّنَا اغْفِرْ لِیْ وَ لِوَالِدَیَّ وَ لِلْمُؤْمِنِیْنَ یَوْمَ یَقُوْمُ الْحِسَابُ۠",
              "translation_urdu": "ا ے میرے پروردگار، مجھے نماز قائم کرنے والا بنا اور میری اولاد سے بھی (ایسے لوگ اٹھا جو یہ کام کریں) پروردگار، میری دعا قبول کر۔ پروردگار، مجھے اور میرے والدین کو اور سب ایمان لانے والوں کو اُس دن معاف کر دیجیو جبکہ حساب قائم ہوگا۔",
              "title_en": "Establishment of Prayer and Forgiveness for Parents",
              "translation_en": "My Lord, make me an establisher of prayer, and from my descendants. Our Lord, and accept my supplication. Our Lord, forgive me and my parents and the believers on the Day when the account is established.",
              "fawaid_en": "This is Ibrahim's (AS) comprehensive supplication from Surah Ibrahim (14:40-41). It seeks righteousness for oneself, offspring, parents, and all believers. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_rahmat_walidain",
              "title_urdu": "والدین کے لئے رحمت کی دعا (سورۃ الاسراء 24)",
              "arabic_text": "رَّبِّ ارْحَمْهُمَا كَمَا رَبَّیٰنِیْ صَغِیْرًاؕ",
              "translation_urdu": "پروردگار، ان (میرے والدین) پر رحم فرما جس طرح اِنہوں نے رحمت و شفقت کے ساتھ مجھے بچپن میں پالا تھا۔",
              "title_en": "Mercy for Parents",
              "translation_en": "My Lord, have mercy upon them as they brought me up when I was small.",
              "fawaid_en": "This is from Surah Al-Isra (17:24). It is the most comprehensive supplication for parents' mercy, recalling their care during childhood. The Prophet ﷺ emphasized making dua for parents. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_for_rushd",
              "title_urdu": "معاملات میں درستگی کی دعا (سورۃ الکھف 10)",
              "arabic_text": "رَبَّنَاۤ اٰتِنَا مِنْ لَّدُنْكَ رَحْمَةً وَّ هَیِّئْ لَنَا مِنْ اَمْرِنَا رَشَدًا",
              "translation_urdu": "اے پروردگار، ہم کو اپنی رحمت خاص سے نواز اور ہمارا معاملہ درست کر دے۔",
              "title_en": "Supplication for Right Guidance",
              "translation_en": "My Lord, grant me from Yourself a right course.",
              "fawaid_en": "This is from Surah Al-Kahf (18:10), the supplication of the People of the Cave. Rushd means guidance to truth and protection from falsehood. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_zidni_ilma",
              "title_urdu": "علم میں اضافے کی دعا (سورۃ طہٰ 114)",
              "arabic_text": "رَّبِّ زِدْنِیْ عِلْمًا",
              "translation_urdu": "اے پروردگار مجھے مزید علم عطا کر۔",
              "title_en": "Increase Me in Knowledge",
              "translation_en": "My Lord, increase me in knowledge.",
              "fawaid_en": "This is from Surah Ta-Ha (20:114). It is the only thing Allah commanded His Prophet ﷺ to ask for increase in. Knowledge is the greatest blessing after faith. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_confession_yunus",
              "title_urdu": "قصور کے اعتراف کی دعا (سورۃ الانبیاء 87)",
              "arabic_text": "لَّاۤ اِلٰهَ اِلَّاۤ اَنْتَ سُبْحٰنَكَ١ۖۗ اِنِّیْ كُنْتُ مِنَ الظّٰلِمِیْنَۚۖ",
              "translation_urdu": "نہیں ہے کوئی خدا مگر تُو، پاک ہے تیری ذات، بے شک میں نے قصور کیا۔",
              "title_en": "Confession of Yunus (AS)",
              "translation_en": "There is no deity worthy of worship except You. Glory be to You! Indeed, I have been among the wrongdoers.",
              "fawaid_en": "This is Yunus's (AS) supplication from Surah Al-Anbiya (21:87) from inside the whale. The Prophet ﷺ said: 'The supplication of my brother Yunus - no Muslim makes this supplication for anything except Allah responds to him.' (Tirmidhi: 3505)"
            },
            {
              "point_id": "dua_for_companionship",
              "title_urdu": "اللہ کے ساتھ کی دعا (سورۃ الانبیاء 89)",
              "arabic_text": "رَبِّ لَا تَذَرْنِیْ فَرْدًا وَّ اَنْتَ خَیْرُ الْوٰرِثِیْنَۚۖ",
              "translation_urdu": "اے پروردگار، مجھے اکیلا نہ چھوڑ، اور بہترین وارث تو تُو ہی ہے۔",
              "title_en": "Supplication for Companionship",
              "translation_en": "My Lord, do not leave me alone, and You are the best of inheritors.",
              "fawaid_en": "This is Zakariyya's (AS) supplication from Surah Al-Anbiya (21:89). It seeks Allah's companionship and righteous offspring to continue one's legacy. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_mubaraka_place",
              "title_urdu": "برکت کی جگہ کی دعا (سورۃ المومنون 29)",
              "arabic_text": "رَّبِّ اَنْزِلْنِیْ مُنْزَلًا مُّبٰرَكًا وَّ اَنْتَ خَیْرُ الْمُنْزِلِیْنَ",
              "translation_urdu": "پروردگار، مجھ کو برکت والی جگہ اتار اور تُو بہترین جگہ دینے والا ہے۔",
              "title_en": "Blessed Place of Arrival",
              "translation_en": "My Lord, let me land at a blessed landing place, and You are the best to bring us to land.",
              "fawaid_en": "This is Nuh's (AS) supplication from Surah Al-Mu'minun (23:29). It seeks Allah's blessing in every new place and situation one enters. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_not_with_dhulimeen",
              "title_urdu": "ظالم لوگوں سے حفاظت کی دعا (سورۃ المومنون 94)",
              "arabic_text": "رَبِّ فَلَا تَجْعَلْنِیْ فِی الْقَوْمِ الظّٰلِمِیْنَ",
              "translation_urdu": "تو اے میرے رب، مجھے ان ظالم لوگوں میں شامل نہ کیجیو۔",
              "title_en": "Not to Be with the Wrongdoers",
              "translation_en": "My Lord, place me not among the wrongdoing people.",
              "fawaid_en": "This is from Surah Al-Mu'minun (23:94). It seeks protection from being counted or assembled with wrongdoers in this world and the Hereafter. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_protection_from_shayateen",
              "title_urdu": "شیاطین سے حفاظت کی دعا (سورۃ المومنون 97-98)",
              "arabic_text": "رَّبِّ اَعُوْذُ بِكَ مِنْ هَمَزٰتِ الشَّیٰطِیْنِۙ وَ اَعُوْذُ بِكَ رَبِّ اَنْ یَّحْضُرُوْنِ",
              "translation_urdu": "پروردگار، میں شیاطین کی اکساہٹوں سے تیری پناہ مانگتا ہوں۔ بلکہ اے میرے رب، میں تو اس سے بھی تیری پناہ مانگتا ہوں کہ وہ میرے پاس آئیں۔",
              "title_en": "Protection from Devils",
              "translation_en": "My Lord, I seek refuge in You from the incitements of devils, and I seek refuge in You, my Lord, lest they be present with me.",
              "fawaid_en": "This is from Surah Al-Mu'minun (23:97-98). It seeks comprehensive protection from devils' whispers and their presence. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_maghfirat_and_rahmah_muminoon_109",
              "title_urdu": "مغفرت اور رحمت کی دعا (سورۃ المومنون 109)",
              "arabic_text": "رَبَّنَاۤ اٰمَنَّا فَاغْفِرْ لَنَا وَ ارْحَمْنَا وَ اَنْتَ خَیْرُ الرّٰحِمِیْنَۚۖ",
              "translation_urdu": "اے ہمارے پروردگار! ہم ایمان لائے، ہمیں معاف کر دے، ہم پر رحم کر، تُو سب رحیموں سے اچھا رحیم ہے۔",
              "title_en": "Forgiveness and Mercy for Believers (23:109)",
              "translation_en": "Our Lord, we have believed, so forgive us and have mercy upon us, and You are the best of the merciful.",
              "fawaid_en": "This is from Surah Al-Mu'minun (23:109), the supplication of sincere believers seeking Allah's ultimate mercy and forgiveness. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_maghfirat_and_rahmah_muminoon_118",
              "title_urdu": "مغفرت اور رحمت کی دعا (سورۃ المومنون 118)",
              "arabic_text": "رَّبِّ اغْفِرْ وَ ارْحَمْ وَ اَنْتَ خَیْرُ الرّٰحِمِیْنَ۠",
              "translation_urdu": "میرے رب درگزر فرما، اور رحم کر، اور تو سب رحیموں سے اچھا رحیم ہے۔",
              "title_en": "Forgiveness and Mercy (23:118)",
              "translation_en": "My Lord, forgive and have mercy, and You are the best of the merciful.",
              "fawaid_en": "This is from Surah Al-Mu'minun (23:118). It is a concise yet comprehensive supplication for forgiveness and mercy from the Most Merciful. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_jahannam_protection",
              "title_urdu": "جہنم کے عذاب سے حفاظت کی دعا (سورۃ الفرقان 65-66)",
              "arabic_text": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ١ۖۗ اِنَّ عَذَابَهَا كَانَ غَرَامًاۗۖ اِنَّهَا سَآءَتْ مُسْتَقَرًّا وَّ مُقَامًا",
              "translation_urdu": "اے ہمارے رب، جہنم کے عذاب سے ہم کو بچا لے، اُس کا عذاب تو جان کا لاگو ہے۔ وہ بڑا ہی برا مستقر اور مقام ہے۔",
              "title_en": "Protection from Hellfire",
              "translation_en": "Our Lord, avert from us the punishment of Hell. Indeed, its punishment is ever adhering. Indeed, it is evil as a settlement and residence.",
              "fawaid_en": "This is from Surah Al-Furqan (25:65-66), the supplication of the servants of the Most Merciful. It seeks protection from the eternal punishment of Hell. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_qurrata_ayun",
              "title_urdu": "بیوی بچوں سے آنکھوں کی ٹھنڈک کی دعا (سورۃ الفرقان 74)",
              "arabic_text": "رَبَّنَا هَبْ لَنَا مِنْ اَزْوَاجِنَا وَ ذُرِّیّٰتِنَا قُرَّةَ اَعْیُنٍ وَّ اجْعَلْنَا لِلْمُتَّقِیْنَ اِمَامًا",
              "translation_urdu": "اے ہمارے رب، ہمیں اپنی بیویوں اور اپنی اولاد سے آنکھوں کی ٹھنڈک دے اور ہم کو پرہیز گاروں کا امام بنا۔",
              "title_en": "Comfort of Eyes from Spouses and Children",
              "translation_en": "Our Lord, grant us from among our spouses and offspring comfort to our eyes and make us an example for the righteous.",
              "fawaid_en": "This is from Surah Al-Furqan (25:74). It seeks righteous spouses and children who bring joy and comfort, and to be role models for others. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_jannat_un_naeem_inheritance",
              "title_urdu": "نعمتوں بھری جنت کی دعا (سورۃ الشعراء 83-85)",
              "arabic_text": "رَبِّ هَبْ لِیْ حُكْمًا وَّ اَلْحِقْنِیْ بِالصّٰلِحِیْنَۙ وَ اجْعَلْ لِّیْ لِسَانَ صِدْقٍ فِی الْاٰخِرِیْنَۙ وَ اجْعَلْنِیْ مِنْ وَّرَثَةِ جَنَّةِ النَّعِیْمِۙ",
              "translation_urdu": "اے میرے رب، مجھے حکم عطا کر اور مجھ کو صالحوں کے ساتھ ملا۔ اور بعد کے آنے والوں میں مجھ کو سچی ناموری عطا کر۔ اور مجھے جنتِ نعیم کے وارثوں میں شامل فرما۔",
              "title_en": "Inheritance of the Garden of Pleasure",
              "translation_en": "Our Lord, indeed we have believed, so forgive us our sins and protect us from the punishment of the Fire.",
              "fawaid_en": "This is from Surah Aal-e-Imran (3:16), seeking Allah's forgiveness and protection based on sincere faith. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_protection_from_khizlan_qayamat",
              "title_urdu": "قیامت کی رسوائی سے حفاظت کی دعا (سورۃ الشعراء 87-88)",
              "arabic_text": "وَ لَا تُخْزِنِیْ یَوْمَ یُبْعَثُوْنَۙ یَوْمَ لَا یَنْفَعُ مَالٌ وَّ لَا بَنُوْنَۙ",
              "translation_urdu": "اور مجھے اس دن رسوا نہ کر جبکہ سب لوگ زندہ کر کے اٹھائے جائیں گے۔ جبکہ نہ مال کوئی فائدہ دے گا نہ اولاد۔",
              "title_en": "Protection from Disgrace on the Day of Resurrection",
              "translation_en": "Our Lord, and grant us what You have promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in Your promise.",
              "fawaid_en": "This is from Surah Aal-e-Imran (3:194). It seeks fulfillment of Allah's promises and protection from disgrace on Judgment Day. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_najini_from_dhulimeen",
              "title_urdu": "ظالم قوم سے حفاظت کی دعا (سورۃ القصص 21)",
              "arabic_text": "رَبِّ نَجِّنِیْ مِنَ الْقَوْمِ الظّٰلِمِیْنَ۠",
              "translation_urdu": "اے میرے رب، مجھے ظالموں سے بچا۔",
              "title_en": "Save Me from the Wrongdoers",
              "translation_en": "My Lord, save me and my family from what they do.",
              "fawaid_en": "This is Lut's (AS) supplication from Surah Ash-Shu'ara (26:169). It seeks protection for oneself and family from the evil influence and punishment of wrongdoers. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_shukr_and_saliheen_qisas",
              "title_urdu": "صالح بندوں میں شمولیت کی دعا (سورۃ النمل 19)",
              "arabic_text": "رَبِّ اَوْزِعْنِیْۤ اَنْ اَشْكُرَ نِعْمَتَكَ الَّتِیْۤ اَنْعَمْتَ عَلَیَّ وَ عَلٰى وَالِدَیَّ وَ اَنْ اَعْمَلَ صَالِحًا تَرْضٰىهُ وَ اَدْخِلْنِیْ بِرَحْمَتِكَ فِیْ عِبَادِكَ الصّٰلِحِیْنَ",
              "translation_urdu": "اے میرے رب، مجھے قابو میں رکھ کہ میں تیرے اس احسان کا شکر ادا کرتا رہوں جو تو نے مجھ پر اور میرے والدین پر کیا ہے اور ایسا عمل صالح کروں جو تجھے پسند آئے اور اپنی رحمت سے مجھ کو اپنے صالح بندوں میں داخل کر۔",
              "title_en": "Gratitude and Inclusion Among the Righteous (Al-Qasas)",
              "translation_en": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to work righteousness of which You will approve and make righteous for me my offspring. Indeed, I have repented to You, and indeed, I am of the Muslims.",
              "fawaid_en": "This comprehensive supplication from Surah Al-Ahqaf (46:15) seeks gratitude, righteous deeds, righteous offspring, and sincere repentance. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_help_against_mufsideen",
              "title_urdu": "مفسد لوگوں کے مقابلے میں مدد کی دعا (سورۃ العنکبوت 30)",
              "arabic_text": "رَبِّ انْصُرْنِیْ عَلَى الْقَوْمِ الْمُفْسِدِیْنَ۠",
              "translation_urdu": "اے میرے رب، اِن مفسد لوگوں کے مقابلے میں میری مدد فرما۔",
              "title_en": "Help Against the Corrupters",
              "translation_en": "Our Lord, decide between us and our people in truth, and You are the best of those who give decision.",
              "fawaid_en": "This is from Surah Al-A'raf (7:89). It seeks Allah's just judgment against those who spread corruption and falsehood. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_habbli_mina_saliheen",
              "title_urdu": "نیک اولاد کی دعا (سورۃ الصافات 100)",
              "arabic_text": "رَبِّ هَبْ لِیْ مِنَ الصّٰلِحِیْنَ",
              "translation_urdu": "اے پروردگار، مجھے ایک بیٹا عطا کر جو صالحوں میں سے ہو۔",
              "title_en": "Grant Me from the Righteous",
              "translation_en": "My Lord, grant me from the righteous.",
              "fawaid_en": "This is Ibrahim's (AS) supplication from Surah As-Saffat (37:100). Despite being a Prophet, he still asked Allah for righteous offspring, showing humility and recognition that all good comes from Allah. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "tasbih_and_salam_on_mursaleen",
              "title_urdu": "رسولوں پر سلامتی کی دعا (سورۃ الصافات 180-182)",
              "arabic_text": "سُبْحٰنَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا یَصِفُوْنَۚ وَ سَلٰمٌ عَلَى الْمُرْسَلِیْنَۚ وَ الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِیْنَ۠",
              "translation_urdu": "پاک ہے تیرا رب، عزت کا مالک، اُن تمام باتوں سے جو یہ لوگ بنا رہے ہیں۔ اور سلام ہے مرسلین پر۔ اور ساری تعریف اللہ ربّ العالمین ہی کے لیے ہے۔",
              "title_en": "Glorification and Peace Upon the Messengers",
              "translation_en": "Glory be to your Lord, the Lord of might, above what they describe. And peace be upon the messengers. And praise be to Allah, Lord of the worlds.",
              "fawaid_en": "This is from Surah As-Saffat (37:180-182). It combines glorification of Allah, sending peace on the messengers, and praising Allah as Lord of all creation. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_forgiveness_from_hell_ghafir",
              "title_urdu": "برائیوں سے حفاظت کی دعا (سورۃ غافر 7-8)",
              "arabic_text": "رَبَّنَا وَسِعْتَ كُلَّ شَیْءٍ رَّحْمَةً وَّ عِلْمًا فَاغْفِرْ لِلَّذِیْنَ تَابُوْا وَ اتَّبَعُوْا سَبِیْلَكَ وَ قِهِمْ عَذَابَ الْجَحِیْمِ رَبَّنَا وَ اَدْخِلْهُمْ جَنّٰتِ عَدْنِ اِ۟لَّتِیْ وَعَدْتَّهُمْ وَ مَنْ صَلَحَ مِنْ اٰبَآئِهِمْ وَ اَزْوَاجِهِمْ وَ ذُرِّیّٰتِهِمْ١ؕ اِنَّكَ اَنْتَ الْعَزِیْزُ الْحَكِیْمُۙ",
              "translation_urdu": "اے ہمارے رب، تو اپنی رحمت اور اپنے علم کے ساتھ ہر چیز پر چھایا ہوا ہے، پس معاف کر دے اور عذاب دوزخ سے بچا لے اُن لوگوں کو جنہوں نے توبہ کی ہے اور تیرا راستہ اختیار کر لیا ہے۔ اے ہمارے رب، اور داخل کر اُن کو ہمیشہ رہنے والی اُن جنتوں میں جن کا تو نے اُن سے وعدہ کیا ہے، اور اُن کے والدین اور بیویوں اور اولاد میں سے جو صالح ہوں (اُن کو بھی وہاں اُن کے ساتھ پہنچا دے) تو بلا شبہ قادر مطلق اور حکیم ہے۔",
              "title_en": "Forgiveness and Protection from Hell (Ghafir)",
              "translation_en": "Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who have repented and followed Your way and protect them from the punishment of Hellfire. Our Lord, and admit them to gardens of perpetual residence which You have promised them and whoever was righteous among their fathers, their spouses, and their offspring. Indeed, it is You who is the Exalted in Might, the Wise.",
              "fawaid_en": "This is the supplication of angels from Surah Ghafir (40:7-8). Angels make this dua for believers, seeking comprehensive forgiveness, Paradise, and reunion with righteous family. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_protection_from_sayyiat_ghafir",
              "title_urdu": "برائیوں سے حفاظت کی دعا (سورۃ غافر 9)",
              "arabic_text": "وَ قِهِمُ السَّیِّاٰتِ١ؕ وَ مَنْ تَقِ السَّیِّاٰتِ یَوْمَئِذٍ فَقَدْ رَحِمْتَهٗ١ؕ وَ ذٰلِكَ هُوَ الْفَوْزُ الْعَظِیْمُ۠",
              "translation_urdu": "اور بچا دے اُن کو برائیوں سے جس کو تو نے قیامت کے دن برائیوں سے بچا دیا اُس پر تو نے بڑا رحم کیا، یہی بڑی کامیابی ہے۔",
              "title_en": "Protection from Evil Consequences (Ghafir)",
              "translation_en": "And protect them from the evil consequences of their deeds. And he whom You protect from evil consequences that Day - You will have given him mercy. And that is the great attainment.",
              "fawaid_en": "This is from Surah Ghafir (40:9), continuation of the angels' supplication. It seeks protection from the consequences of bad deeds and attainment of Allah's mercy. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_removal_of_adhab",
              "title_urdu": "عذاب سے حفاظت کی دعا (سورۃ الدخان 12)",
              "arabic_text": "رَبَّنَا اكْشِفْ عَنَّا الْعَذَابَ اِنَّا مُؤْمِنُوْنَ",
              "translation_urdu": "پروردگار! ہم پر سے یہ عذاب ٹال دے، ہم ایمان لاتے ہیں۔",
              "title_en": "Removal of Punishment",
              "translation_en": "Our Lord, remove from us the punishment. Indeed, we are believers.",
              "fawaid_en": "This is from Surah Ad-Dukhan (44:12), a supplication for the removal of punishment and affliction through sincere faith. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_shukr_for_parents_and_offspring",
              "title_urdu": "شکر کی توفیق کی دعا (سورۃ الاحقاف 15)",
              "arabic_text": "رَبِّ اَوْزِعْنِیْۤ اَنْ اَشْكُرَ نِعْمَتَكَ الَّتِیْۤ اَنْعَمْتَ عَلَیَّ وَ عَلٰى وَالِدَیَّ وَ اَنْ اَعْمَلَ صَالِحًا تَرْضٰىهُ وَ اَصْلِحْ لِیْ فِیْ ذُرِّیَّتِیْ١ؕۚ اِنِّیْ تُبْتُ اِلَیْكَ وَ اِنِّیْ مِنَ الْمُسْلِمِیْنَ",
              "translation_urdu": "اے میرے رب، مجھے توفیق دے کہ میں تیری اُن نعمتوں کا شکر ادا کروں جو تو نے مجھے اور میرے والدین کو عطا فرمائیں، اور ایسا نیک عمل کروں جس سے تو راضی ہو، اور میری اولاد کو بھی نیک بنا کر مجھے سُکھ دے، میں تیرے حضور توبہ کرتا ہوں اور تابع فرمان (مسلم) بندوں میں سے ہوں۔",
              "title_en": "Gratitude for Parents and Righteous Offspring",
              "translation_en": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to work righteousness of which You will approve and make righteous for me my offspring. Indeed, I have repented to You, and indeed, I am of the Muslims.",
              "fawaid_en": "This is from Surah Al-Ahqaf (46:15). It is the most comprehensive supplication combining gratitude, righteous deeds, righteous offspring, repentance, and submission. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_tawakkal_and_inaba",
              "title_urdu": "اللہ پر توکل کی دعا (سورۃ الممتحنۃ 4)",
              "arabic_text": "رَبَّنَا عَلَیْكَ تَوَكَّلْنَا وَ اِلَیْكَ اَنَبْنَا وَ اِلَیْكَ الْمَصِیْرُ",
              "translation_urdu": "اے ہمارے رب، تیرے ہی اوپر ہم نے بھروسا کیا اور تیری ہی طرف ہم نے رجوع کر لیا اور تیرے ہی حضور ہمیں پلٹنا ہے۔",
              "title_en": "Reliance and Turning to Allah",
              "translation_en": "Upon Him I have relied, and to Him I turn in repentance.",
              "fawaid_en": "This is from Surah Ash-Shura (42:10). It combines complete reliance on Allah with sincere repentance and return to Him. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_protection_from_bughd",
              "title_urdu": "بغض سے حفاظت کی دعا (سورۃ الحشر 10)",
              "arabic_text": "رَبَّنَا اغْفِرْ لَنَا وَ لِاِخْوَانِنَا الَّذِیْنَ سَبَقُوْنَا بِالْاِیْمَانِ وَ لَا تَجْعَلْ فِیْ قُلُوْبِنَا غِلًّا لِّلَّذِیْنَ اٰمَنُوْا رَبَّنَاۤ اِنَّكَ رَءُوْفٌ رَّحِیْمٌ۠",
              "translation_urdu": "اے ہمارے رب، ہمیں اور ہمارے اُن سب بھائیوں کو بخش دے جو ہم سے پہلے ایمان لائے ہیں اور ہمارے دلوں میں اہل ایمان کے لیے کوئی بغض نہ رکھ، اے ہمارے رب، تو بڑا مہربان اور رحیم ہے۔",
              "title_en": "Protection from Hatred and Enmity",
              "translation_en": "Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts any resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful.",
              "fawaid_en": "This is from Surah Al-Hashr (59:10). It is among the most beautiful supplications, seeking forgiveness for all believers and removal of resentment from hearts. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_forgiveness_from_qasoor",
              "title_urdu": "قصوروں سے درگزر کی دعا (سورۃ الممتحنۃ 5)",
              "arabic_text": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِیْنَ كَفَرُوْا وَ اغْفِرْ لَنَا رَبَّنَا١ۚ اِنَّكَ اَنْتَ الْعَزِیْزُ الْحَكِیْمُ",
              "translation_urdu": "اے ہمارے رب، ہمیں کافروں کے لیے فتنہ نہ بنا دے اور اے ہمارے رب، ہمارے قصوروں سے درگزر فرما، بے شک تو ہی زبردست اور دانا ہے۔",
              "title_en": "Forgiveness from Shortcomings",
              "translation_en": "Our Lord, upon You we have relied, and to You we have returned, and to You is the destination. Our Lord, do not make us a trial for those who disbelieve and forgive us, our Lord. Indeed, it is You who is the Exalted in Might, the Wise.",
              "fawaid_en": "This is Ibrahim's (AS) supplication from Surah Al-Mumtahanah (60:4-5). It combines reliance on Allah, seeking forgiveness, and protection from being tested through disbelievers. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_completion_of_noor",
              "title_urdu": "نور کی تکمیل کی دعا (سورۃ التحریم 8)",
              "arabic_text": "رَبَّنَاۤ اَتْمِمْ لَنَا نُوْرَنَا وَ اغْفِرْ لَنَا١ۚ اِنَّكَ عَلٰى كُلِّ شَیْءٍ قَدِیْرٌ",
              "translation_urdu": "اے ہمارے رب، ہمارا نور ہمارے لیے مکمل کر دے اور ہم سے درگزر فرما، تو ہر چیز پر قدرت رکھتا ہے۔",
              "title_en": "Completion of Light",
              "translation_en": "Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.",
              "fawaid_en": "This is from Surah At-Tahrim (66:8). On the Day of Judgment, believers will ask Allah to complete their light (faith) and forgive them. (Tafsir Ibn Kathir)"
            },
            {
              "point_id": "dua_maghfirat_for_all_mumeenin",
              "title_urdu": "تمام مسلمانوں کے لئے مغفرت کی دعا (سورۃ نوح 28)",
              "arabic_text": "رَبِّ اغْفِرْ لِیْ وَ لِوَالِدَیَّ وَ لِمَنْ دَخَلَ بَیْتِیَ مُؤْمِنًا وَّ لِلْمُؤْمِنِیْنَ وَ الْمُؤْمِنٰتِ١ؕ وَ لَا تَزِدِ الظّٰلِمِیْنَ اِلَّا تَبَارًا۠",
              "translation_urdu": "میرے رب، مجھے اور میرے والدین کو اور ہر اس شخص کو جو میرے گھر میں مومن کی حیثیت سے داخل ہوا ہے، اور سب مومن مردوں اور عورتوں کو معاف فرما دے، اور ظالموں کے لیے ہلاکت کے سوا کسی چیز میں اضافہ نہ کر۔",
              "title_en": "Forgiveness for All Believers",
              "translation_en": "My Lord, forgive me and my parents and whoever enters my house as a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction.",
              "fawaid_en": "This is Nuh's (AS) comprehensive supplication from Surah Nuh (71:28). It seeks forgiveness for oneself, parents, guests, and all believing men and women. (Tafsir Ibn Kathir)"
            }
          ],
          "title_en": "Supplications of Gratitude and Special Occasions"
        }
      ],
      "title_main_en": "Daily Supplications and Remembrances",
      "introduction_note_en": "This content is preserved according to the original text without any modifications."
    }
  }
}