{
  "status": "success",
  "data": {
    "azkar": {
      "title_main_urdu": "صبح، شام اور رات کے مسنون اَذکار و دعائیں",
      "introduction_note": "یہ مواد دی گئی اصل عبارت کے مطابق ہے اور اسے کسی بھی قسم کی تبدیلی سے پاک رکھا گیا ہے۔",
      "sections": [
        {
          "id": "morning_adhkar_part_1",
          "original_section_number": 1,
          "title_urdu": "صبح کے مسنون اَذکار (حصہ اول)",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "azkar_be_baha_ajr",
              "title_urdu": "بیش بہا اجر و ثواب",
              "arabic_text": "اللهُ أَكْبَرُ اَلْحَمْدُ لِلّٰهِ سُبْحَانَ اللهِ لَا إِلٰهَ إِلَّا اللهُ",
              "translation_urdu": "اللہ سب سے بڑا ہے سب تعریف اللہ ہی کے لئے ہے۔ اللہ پاک ہے۔ اللہ کے سوا کوئی معبود نہیں۔",
              "fawaid_urdu": "حضرت ابو امامہ (رض) سے مروی ہے کہ نبی کریم ﷺ نے ارشاد فرمایا میرے نزدیک طلوع آفتاب کے وقت اللہ کا ذکر کرنا اللہ اکبر الحمد لللہ لا الہ الا اللہ اور سبحان اللہ کہنا اولاد اسماعیل (علیہ السلام) میں سے چار غلام آزاد کرنے سے زیادہ بہتر ہے اسی طرح نماز عصر سے غروب آفتاب تک اللہ کا ذکر کرنا میرے نزدیک اولاد اسماعیل (علیہ السلام) میں سے اتنے اتنے غلام آزاد کرنے سے زیادہ بہتر ہے۔ (مسند احمد 22194)"
            },
            {
              "point_id": "azkar_hifazat_shaitaan",
              "title_urdu": "پورا دن شیاطین سے حفاظت",
              "arabic_text": "اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ١ۚ اَلْحَیُّ الْقَیُّوْمُ١ۚ۬ لَا تَاْخُذُهٗ سِنَةٌ وَّ لَا نَوْمٌ١ؕ لَهٗ مَا فِی السَّمٰوٰتِ وَ مَا فِی الْاَرْضِ١ؕ مَنْ ذَا الَّذِیْ یَشْفَعُ عِنْدَهٗۤ اِلَّا بِاِذْنِهٖ١ؕ یَعْلَمُ مَا بَیْنَ اَیْدِیْهِمْ وَ مَا خَلْفَهُمْ١ۚ وَ لَا یُحِیْطُوْنَ بِشَیْءٍ مِّنْ عِلْمِهٖۤ اِلَّا بِمَا شَآءَ١ۚ وَسِعَ كُرْسِیُّهُ السَّمٰوٰتِ وَ الْاَرْضَ١ۚ وَ لَا یَئُوْدُهٗ حِفْظُهُمَا١ۚ وَ هُوَ الْعَلِیُّ الْعَظِیْمُ",
              "translation_urdu": "اللہ وہ ذات ہے کہ اس کے سوا کوئی معبود نہیں ،ہمیشہ زندہ رہنے والا ہے ، تمام مخلوق کا سنبھالنے والا ہے، نہ اس کو اونگھ دبا سکتی ہے اور نہ نیند(دبا سکتی ہے) اسی کے مملوک ہیں سب جو کچھ بھی آسمانوں میں (موجودات) ہیں اور جو کچھ زمین میں ہیں، ایسا کون شخص ہے جو اس کے پاس (کسی کی) سفارش کر سکے بدون اس کی اجازت کے، وہ جانتا ہے ان (موجودات) کے تمام حاضر اور غائب حالات کو اور وہ موجودات اس کے معلومات سے کسی چیز کو اپنے علم کے احاطہ میں نہیں لا سکتے، مگر جس قدر (علم دینا) وہی چاہے، اس کی کرسی (اتنی بڑی ہےکہ اس ) نے سب آسمان اور زمین کو اپنے اندر لے رکھا ہے اور اللہ تعالىٰ کو ان دونوں (آسمان اور زمین) کی حفاظت کچھ مشکل نہیں گزرتی، اور وہ ہی عالیشان اور عظیم الشان ہے۔",
              "fawaid_urdu": "جو کوئی اسے رات کو پڑھے وہ صبح تک جنات اور شیاطین سے پناہ میں رہے گا اور جو صبح کو پڑھے وہ رات تک جنات اور شیاطین سے پناہ میں رہے گا۔ (المعجم الکبیر للطبرانی 542)"
            },
            {
              "point_id": "azkar_kafaayat_3_times",
              "title_urdu": "ہر چیز سے کفایت (تین مرتبہ)",
              "arabic_text": "(1)قُلْ هُوَ اللّٰهُ اَحَدٌۚ ۞ اَللّٰهُ الصَّمَدُۚ ۞ لَمْ یَلِدْ١ۙ۬ وَ لَمْ یُوْلَدْۙ ۞ وَ لَمْ یَكُنْ لَّهٗ كُفُوًا اَحَدٌ۠ ۞ (2) قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِۙ ۞ مِنْ شَرِّ مَا خَلَقَۙ ۞ وَ مِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَۙ ۞ وَ مِنْ شَرِّ النَّفّٰثٰتِ فِی الْعُقَدِۙ ۞ وَ مِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ۠ ۞ (1) قُلْ اَعُوْذُ بِرَبِّ النَّاسِۙ ۞ مَلِكِ النَّاسِۙ ۞ اِلٰهِ النَّاسِۙ ۞ مِنْ شَرِّ الْوَسْوَاسِ١ۙ۬ الْخَنَّاسِ۪ۙ ۞ الَّذِیْ یُوَسْوِسُ فِیْ صُدُوْرِ النَّاسِۙ ۞ مِنَ الْجِنَّةِ وَ النَّاسِ۠ ۞",
              "translation_urdu": "(1)تم فرماؤ: وہ اللہ ایک ہے۔اللہ بے نیاز ہے۔نہ اس نے کسی کو جنم دیا اور نہ وہ کسی سے پیدا ہوا۔اور کوئی اس کے برابر نہیں ۔(2) تم فرماؤ: میں صبح کے رب کی پناہ لیتا ہوں ۔اس کی تمام مخلوق کے شر سے۔اورسخت اندھیری رات کے شر سے جب وہ چھاجائے۔اور ان عورتوں کے شر سے جو گرہوں میں پھونکیں مارتی ہیں ۔اور حسد والے کے شر سے جب وہ حسد کرے۔ (3)تم کہو: میں تمام لوگوں کے رب کی پناہ لیتا ہوں ۔تمام لوگوں کا بادشاہ ۔تمام لوگوں کا معبود ۔باربار وسوسے ڈالنے والے، چھپ جانے والے کے شر سے(پناہ لیتا ہوں )۔وہ جو لوگوں کے دلوں میں وسوسے ڈالتا ہے۔جنوں اورانسانوں میں سے۔",
              "fawaid_urdu": "عبداللہ بن خبیب ؓ کہتے ہیں کہ ہم رسول اللہ ﷺ کو بارش کی ایک سخت اندھیری رات میں نماز پڑھانے کے لیے تلاش کرنے نکلے، تو ہم نے آپ کو پا لیا، آپ نے فرمایا: کیا تم لوگوں نے نماز پڑھ لی؟ ہم نے کوئی جواب نہیں دیا، آپ نے فرمایا: کچھ کہو اس پر بھی ہم نے کچھ نہیں کہا، آپ نے پھر فرمایا: کچھ کہو (پھر بھی) ہم نے کچھ نہیں کہا، پھر آپ نے فرمایا: کچھ تو کہو میں نے عرض کیا: اللہ کے رسول! کیا کہوں؟ آپ نے فرمایا: قل هو الله أحد اور معوذتین تین مرتبہ صبح کے وقت، اور تین مرتبہ شام کے وقت کہہ لیا کرو تو یہ تمہیں (ہر طرح کی پریشانیوں سے بچاؤ کے لیے) کافی ہوں گی۔(ابوداؤد:5082)"
            },
            {
              "point_id": "azkar_mizan_heavy_3_times",
              "title_urdu": "میزان میں بھاری کلمات (تین مرتبہ)",
              "arabic_text": "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
              "translation_urdu": "پاک ہے اللہ کی ذات اور اُسی کیلئے ساری تعریف ہے،اُس کی مخلوق کی تعداد کے برابر،اُس کی ذات کی خوشنودی کے برابر،اُس کے عرش کے وزن کے برابر،اور اُس کےکلمات ( صفات) کی سیاہی کے برابر۔",
              "fawaid_urdu": "اُمّ المؤمنین حضرت جُویریہ فرماتی ہیں کہ ایک دفعہ نبی کریم ﷺ اُن کے پاس سے صبح سویرے نماز کیلئے تشریف لے گئے اور وہ مُصلّے پر بیٹھی ہوئی تھیں ،پھر سورج کے نکلنے اور روشن ہوجانے کے بعد تشریف لائے تو دیکھا کہ میں ابھی تک مُصلّےپر بیٹھی ہوئی ہوں،آپ ﷺ نے فرمایا تم ابھی تک اُسی طرح بیٹھی ہوئی ہو؟ میں نے کہا : جی ہاں!آپ ﷺ نے اِرشاد فرمایا:میں نے تمہارے پاس سے جانے کے بعد (مذکورہ بالا)چار کلمات تین مرتبہ کہے ہیں اگر اُن کو تمہارے آج کے تمام اَذکار کے مقابلے میں وزن کیا جائے تو وہ کلمات بھاری ہوجائیں گے۔(مسلم:2726)"
            }
          ]
        },
        {
          "id": "morning_adhkar_part_2",
          "original_section_number": 2,
          "title_urdu": "صبح کے مسنون اَذکار (حصہ دوم)",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "azkar_aafat_se_bachao_3_times",
              "title_urdu": "ناگہانی آفات اور نقصان سے بچاؤ (تین مرتبہ)",
              "arabic_text": "بِسْمِ اللهِ الَّذِيْ لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَ لَا فِي السَّمَاءِ ، وَهُوَ السَّمِيْعُ الْعَلِيْمُ",
              "translation_urdu": "اللہ کے نام سے ابتداء کرتا ہوں جس کے نام کے ساتھ کوئی چیز زمین و آسمان میں نقصان نہیں پہنچاسکتی ، اور وہ سننے والا اور جاننے والا ہے۔",
              "fawaid_urdu": "اِن کلمات کے پڑھنے والے کے بارے میں حدیث میں یہ فضیلت بیا ن کی گئی ہےکہ ”لَمْ يَضُرَّهُ شَيْءٌ فِي ذَلِكَ الْيَوْمِ أَوْ فِي تِلْكَ اللَّيْلَةِ“ اُسے اُس دن یا اُس رات کوئی نقصان نہیں پہنچے گا۔(مسند احمد:474) ایک روایت میں ہے”لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُمْسِيَ“ شام تک اُسے کوئی ناگہانی آفت کا سامنا نہیں ہوگا۔(ابوداؤد:5088) حدیث کے راوی حضرت اَبان بن عُثمان (رض) کے جسم کے ایک حصہ میں فالج گرا ہوا تھا ،اُنہوں نے جب اِس حدیث کو بیان کیا تو سننے والوں میں سے کسی شخص نے اُن کو سوالیہ نگاہوں سے دیکھا جس سے اُس کا مقصود یہ تھا کہ جب آپ اِس دُعاء کو پڑھتے رہے ہیں تو پھر آپ کے جسم میں فالج کیسے گرا ؟ حضرت اَبان (رض) نے فرمایا کہ حدیث میں کوئی شک نہیں ،حدیث یقیناً اُسی طرح ہے جیسے میں نے بیان کی ہے، البتہ تقدیر کے مطابق جس دن مجھ پر اِس فالج کا حملہ ہوا ہے اُس دن میں اِس دُعاء کو پڑھنا بھول گیا تھا۔(ترمذی:3388)"
            },
            {
              "point_id": "azkar_alllah_ki_maiyat",
              "title_urdu": "اللہ تعالیٰ کی معیت",
              "arabic_text": "اَللّٰهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ الْمَصِيْرُ",
              "translation_urdu": "اے اللہ ! تیرے نام ہی سے ہم نے صبح کی اور تیرے ہی نام سے ہم نے شام کی ،تیرے ہی نام سے ہم جیتے ہیں اور تیرے ہی نام سے ہم مرتے ہیں اور تیری ہی جانب ہمیں لوٹ کر آنا ہے۔",
              "fawaid_urdu": "نبی کریم ﷺ صبح کو یہ دعاء پڑھا کرتے تھے۔(ترمذی:3391)"
            },
            {
              "point_id": "azkar_fitrat_par_istiqamat_morning",
              "title_urdu": "اخلاص اور دینِ فطرت پر استقامت",
              "arabic_text": "أَصْبَحْنَا عَلىٰ فِطْرَةِ الْإِسْلَامِ وَكَلِمَةِ الْإِخْلَاصِ، وَعَلىٰ دِيْنِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلىٰ مِلَّةِ أَبِيْنَا إِبْرَاهِيْمَ حَنِيْفًا مُّسْلِمًا، وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
              "translation_urdu": "ہم نے اِسلام کی فطرت اور اِخلاص کے کلمہ پر اور اپنے نبی حضرت محمّدﷺ کے دین پر اور اپنے والد حضرت ابراہیم علیہ السلام کے ملّت پر صبح کی جو سیدھے سادے مسلمان تھے اور وہ کبھی شرک کرنے والوں میں نہ تھے۔",
              "fawaid_urdu": "نبی کریمﷺصبح کو یہ دُعاء پڑھا کرتے تھے۔(سنن کبریٰ نسائی:9745)"
            },
            {
              "point_id": "azkar_ilm_rizq_amal",
              "title_urdu": "نافع علم، پاکیزہ رزق اور مقبول عمل کی دعا",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَسْأَلُك عِلْمًا نَّافِعًا وَّرِزْقًا طَيِّبًا وَّعَمَلًا مُّتَقَبَّلًا",
              "translation_urdu": "اے اللہ!میں تجھ سے نفع دینے والا علم،پاکیزہ رزق اور قبول ہونے والے عمل کا سوال کرتا ہوں۔",
              "fawaid_urdu": "حدیث میں ہے:نبی کریمﷺصبح کی نماز کا سلام پھیرتے تو مذکورہ بالا دعاء پڑھا کرتے تھے۔(شعب الایمان :1645)"
            },
            {
              "point_id": "azkar_nafs_shaitaan_se_panah",
              "title_urdu": "نفس اور شیطان کے شر سے پناہ",
              "arabic_text": "اَللّٰهُمَّ فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَّمَلِيْكَهُ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ",
              "translation_urdu": "اے اللہ!اے آسمانوں اور زمین کو پیدا کرنے والے،غیب و حاضر کی تمام باتوں کو جاننے والے،ہر چیز کےپروردگار اور مالک! میں گواہی دیتا ہوں کہ تیرے سوا کوئی معبود نہیں ،میں تیری پناہ میں آتا ہوں اپنے نفس کے شر سے اور شیطان کے شر اور اُس کے شرک(میں مبتلاء کرنے)سے۔",
              "fawaid_urdu": "یہ وہ مبارک دعاء کے کلمات ہیں جونبی کریم ﷺ نےصبح ، شام اور بستر پر جاتے ہوئے پڑھنے کی تلقین کی ہے۔(ابوداؤد:5067)"
            },
            {
              "point_id": "azkar_poore_din_ki_khair",
              "title_urdu": "پورے دن کی خیر و بھلائی کی دعا",
              "arabic_text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلّٰهِ وَالْحَمْدُ لِلّٰهِ وَلَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ المُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ أَسْأَلُكَ خَيْرَ هٰذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ وَ أَعُوذُ بِكَ مِنْ شَرِّ هٰذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ وَ أَعُوذُ بِكَ مِنَ الكَسَلِ وَ سُوءِ الكِبَرِ وَ أَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ وَعَذَابِ القَبْرِ",
              "translation_urdu": "ہم نے اور ساری سلطنت نے اللہ کیلئے صبح کی اور اللہ کیلئے ساری تعریفیں ہیں اور اللہ کے سوا کوئی معبود نہیں ،وہ اکیلا ہے ،اُس کا کوئی شریک نہیں ، اُسی کیلئے بادشاہت ہے اور اُسی کیلئے ساری تعریف ہے،اور وہ ہر چیز پر قدرت رکھتا ہے ،اے اللہ ! میں تجھ سے اِس دن کی اور اِس کے بعد آنے والےدنوں کی خیر و بھلائی کا سوال کرتا ہوں اور میں اِس دن اور اس کے بعد آنے والے دنوں کے شر سےتیری پناہ چاہتا ہوں، اور میں سستی ،بُرے بڑھاپے سےتیری پناہ چاہتاہوں اور میں جہنم کے اور قبر کے عذاب سے تیری پناہ چاہتا ہوں۔",
              "fawaid_urdu": "نبی کریم ﷺ صبح کو یہ دُعاء پڑھا کرتے تھے۔(ترمذی:3390)"
            },
            {
              "point_id": "azkar_jannat_ka_parwana_3_times",
              "title_urdu": "اللہ کی رضا اور جنت کا پروانہ (تین مرتبہ)",
              "arabic_text": "رَضِيْتُ بِاللهِ رَبًّا وَّ بِالْإِسْلَامِ دِيْنًا وَّ بِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
              "translation_urdu": "میں اللہ کے پروردگار ہونے پر ،اِسلام کے دین ہونے پر اور حضرت محمد ﷺ کے نبی ہونے پر راضی ہوں۔",
              "fawaid_urdu": "اِس کلمہ کی فضیلت حدیث میں یہ ذکر کی گئی ہے: ”كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ“ یعنی اللہ تبارک و تعالیٰ نے اپنے ذمّہ لے لیا ہے کہ اِن کلمات کے پڑھنے والے کو قیامت کے دن راضی کردیں گے۔(مسند احمد:18967) ایک روایت میں ہے”مَنْ قَالَهُنَّ دَخَلَ الْجَنَّةَ“جس نے یہ کلمات کہے وہ جنّت میں داخل ہوگا۔(مسند احمد:11102) ایک اور روایت میں اِن کلمات کے پڑھنے والے کے بارے میں آپ ﷺنے فرمایا: ”ذَاقَ طَعْمَ الْإِيْمَانِ“ یعنی اُسے ایمان کا ذائقہ نصیب ہوگا۔(مسلم:34)"
            },
            {
              "point_id": "azkar_aifiyat_pooray_badan_3_times",
              "title_urdu": "بدنی عافیت کی دعا اور کفروفقر سے حفاظت (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ عَافِنِيْ فِي بَدَنِيْ، اَللّٰهُمَّ عَافِنِيْ فِي سَمْعِيْ، اَللّٰهُمَّ عَافِنِيْ فِي بَصَرِيْ، لَا إِلٰهَ إِلَّا أَنْتَ اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلٰهَ إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ !میرے جسم میں عافیت نصیب فرما۔اے اللہ !میرےکانوں میں عافیت نصیب فرما۔اے اللہ !میری آنکھ میں عافیت نصیب فرما۔تیرے سوا کوئی معبود نہیں ۔اے اللہ! کفر میں مبتلاء ہونے اور فقر کا شکار ہونے سےمیں تیری پناہ چاہتا ہوں، اے اللہ! میں قبر کے عذاب سے تیری پناہ چاہتا ہوں،تیرے سوا کوئی معبود نہیں۔",
              "fawaid_urdu": "نبی کریمﷺصبح شام اِس دُعاء کو پڑھا کرتے تھے۔(ابوداؤد:5090)"
            },
            {
              "point_id": "azkar_islah_e_ahwaal",
              "title_urdu": "تمام احوال کی اصلاح",
              "arabic_text": "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ أَسْتَغِيْثُ، أَصْلِحْ لِيْ شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلىٰ نَفْسِيْ طَرَفَةَ عَيْنٍ",
              "translation_urdu": "اے وہ ذات جو سدا زندہ ہے اور ساری کائنات سنبھالے ہوئے ہے!میں تیری رحمت ہی سے فریاد طلب کرتا ہوں ،میرے تمام اَحوال کی اِصلاح فرما اور ایک پلک جھپکنے کے برابر بھی مجھے میرےنفس کے حوالہ نہ فرما۔",
              "fawaid_urdu": "نبی کریم ﷺ نے اپنی بیٹی حضرت فاطمہ (رض) کویہ کلمات سکھائے تھے اور اُنہیں اِن کلمات کو صبح شام پڑھنے کی وصیت کی تھی۔(مستدرکِ حاکم:2000) حضرت انس (رض) فرماتے ہیں کہ ہم (فجر کی نماز کے بعد) نبی کریم ﷺ کے ساتھ مسجد میں تھے یہاں تک کہ سورج طلوع ہوگیا ، ہم آپ ﷺ کے ساتھ نکلے،آپ ﷺ نے حضرت فاطمہ (رض) کے پاس تشریف لے گئے تو دیکھا وہ سورہی ہیں ،آپ ﷺ نے اِرشاد فرمایا:”مَا يُنِيْمُكِ فِيْ هٰذِهِ السَّاعَةِ؟“اِس وقت کیوں سورہی ہو؟ اُنہوں نے فرمایا: یا رسول اللہ! مجھے کل رات سے بخار ہے،آپ ﷺ نےارشاد فرمایا: وہ دُعا ء کیوں نہیں پڑھی جو میں نے سکھائی تھی ؟حضرت فاطمہ (رض) نے فرمایا : میں بھول گئی ہوں، آپ ﷺ نے اُنہیں اِن کلمات کی تلقین فرمائی ۔(طبرانی اوسط:3565) ایک روایت میں ہے کہ نبی کریم ﷺ کو جب کوئی تکلیف پیش آتی تو آپ یہ کلمہ پڑھا کرتے تھے:”يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ“ اے وہ ذات جو سدا زندہ ہے اور ساری کائنات سنبھالے ہوئے ہے!تیری رحمت ہی سے فریاد طلب کرتا ہوں ۔(ترمذی:3524)"
            },
            {
              "point_id": "azkar_sayyad_ul_istighfar_morning",
              "title_urdu": "جنت اور شہادت کا پروانہ",
              "arabic_text": "اَللّٰهُمَّ أَنْتَ رَبِّي لاَ إِلٰهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأَبُوْءُ لَكَ بِذَنْبِيْ فَاغْفِرْ لِيْ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ ! آپ ہی میرے پالنہار ہیں ، آپ کے سوا کوئی عبادت کے لائق نہیں ہے۔ آپ ہی نے مجھے پیدا کیا اور میں آپ کا حقیقی غلام ہوں ، اور جہاں تک میرے بس میں ہے مَیں آپ سے کئے ہوئے عہد اور وعدے پر قائم ہوں ، آپ کی پناہ چاہتا ہوں ان تمام بُرے کاموں کے وبال سے جو مَیں نے کئے ہیں، میں آپ کے سامنے آپ کی ان نعمتوں کا اقرار کرتا ہوں جو مجھ پر ہیں ، اور مجھے اعتراف ہے اپنے گناہ کا، اس لئے میرے گناہوں کو معاف کر دیجئے، کیونکہ آپ کے سوا کوئی گناہوں کو نہیں بخشتا۔",
              "fawaid_urdu": "یہ سیّد الاِستغفار کے کلمات ہیں، جس کو حدیث کے اندر صبح شام پڑھنے کی تلقین کی گئی ہے اور اِس کی فضیلت حدیث میں یہ ذکر کی گئی ہے: ”مَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا،فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ“ یعنی جس نے پورے یقین کے ساتھ یہ کلمات دن کو پڑھے اور شام سے پہلے اُس کی موت آگئی تو وہ اہلِ جنّت میں سے ہے۔(بخاری:6306) ایک روایت میں ہے : ”فَإِنْ مَاتَ مِنْ يَوْمِهِ مَاتَ شَهِيدًا“ اِن کلمات کو کہنے والا اُس دن مرگیا تو شہادت کی موت مرے گا۔(ابن سنی :43)"
            },
            {
              "point_id": "azkar_aifiyat_dunya_akhira",
              "title_urdu": "ہر طرح کی عافیت کی دعا",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اَللّٰهُمَّ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِيْنِيْ وَ دُنْيَايَ وَأَهْلِي وَمَالِيْ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، وَاحْفَظْنِي مِنْم بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِيْ، وَعَنْ شِمَالِيْ، وَمِنْ فَوْقِيْ، وَ أَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
              "translation_urdu": "اے اللہ! میں تجھ سے دنیا و آخرت میں عفو و درگزر اور عافیت کا سوال کرتا ہوں،اے اللہ! میں تجھ سے اپنے دین ، دنیا ،اہل اور مال میں عفو و درگزر اور عافیت کا سوال کرتاہوں۔اے اللہ! میرے عیوب کی پردہ پوشی فرما،میرے خوف کو اَمن میں تبدیل فرما اور حفاظت فرمامیرے سامنےسے،میرے پیچھے سے،میرے دائیں جانب سے اور میری بائیں جانب سے اور میرے اوپر سے ، اور میں تیری عظمت کی پناہ چاہتا ہوں اِس بات سے کہ میں اپنے نیچے کی جانب سے ہلاک کیا جاؤں۔",
              "fawaid_urdu": "مذکورہ بالا کلمات کو صبح و شام اہتمام سے پڑھنا چاہیئے۔ حدیث میں آتا ہے:”لَمْ يَكُنْ رَسُولُ اللهِ ﷺيَ دَعُ هَؤُلَاءِ الدَّعَوَاتِ حِينَ يُمْسِي، وَحِينَ يُصْبِحُ“نبی کریم ﷺ صبح شام اِن کلمات کو کبھی ترک نہیں فرمایا کرتے تھے۔(ابن ماجہ:3871)"
            },
            {
              "point_id": "azkar_khalq_ke_shar_se_hifazat",
              "title_urdu": "ہر قسم کے نقصان سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
              "translation_urdu": "میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں اُس کی پیدا کردہ تمام چیزوں کے شر سے۔",
              "fawaid_urdu": "اِن کلمات کے پڑھنے والے کوکوئی مُوذی چیز نہیں کاٹے گی۔(ترمذی:3604) نبی کریم ﷺکے پاس ایک شخص کو لایا گیا گیا جسے بچھو نے کاٹ لیا تھا ،آپ ﷺنے فرمایا اگر یہ مذکورہ کلمات پڑھ لیتا تو اِسے بچھو نقصان نہیں پہنچاتا ۔(ابوداؤد:3899) حدیث کے راوی حضرت سہیل بن صالح (رض) فرماتے ہیں کہ ہمارے گھر والوں نے یہ کلمات سیکھ لیے تھے اور روزانہ پڑھتے تھے،ایک دفعہ گھر میں کسی باندی کو بچھو نے ڈس لیا تو اِن کلمات کی برکت سے اُسے کوئی تکلیف تک نہیں ہوئی ۔(ترمذی:3604) اگر کسی جگہ اتر کر مذکورہ کلمات پڑھ لیے جائیں تو وہاں سے کُوچ کرنے تک کوئی نقصان نہیں پہنچے گا۔(الدعوات الکبیر:470)"
            },
            {
              "point_id": "azkar_seven_great_virtues_10_times",
              "title_urdu": "سات عظیم فضیلتیں (دس مرتبہ)",
              "arabic_text": "لَا إِلٰهَ إِلَّا اللهُ، وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، يُحْيِيْ وَيُمِيْتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلىٰ كُلِّ شَيْءٍ قَدِيْرٌ",
              "translation_urdu": "اللہ کے سوا کوئی معبود نہیں ،وہ اکیلا ہے ،اُس کا کوئی شریک نہیں ،اُسی کیلئے بادشاہت ہےاور اُسی کیلئے تعریف ہے، ،وہی زندہ کرتا اور وہی موت دیتا ہے، اُسی کے ہاتھ میں ساری بھلائی ہے اور وہ ہر چیز پر قادر ہے۔",
              "fawaid_urdu": "جو شخص مغرب اور فجر کی نماز بعد رخ پھیرنے اور پاؤں موڑنے سے پہلے دس مرتبہ یہ کلمات پڑھ لےاُس کیلئے ہر کلمہ کے بدلہ میں دس نیکیاں لکھی جاتی ہیں ، دس گناہ مٹادیے جاتے ہیں اور دس درجے بلند کیے جاتے ہیں اور یہ کلمات اُس کیلئےہر ناپسندیدہ چیز اور شیطانِ مردود سے بچاؤ کا ذریعہ بن جاتے ہیں اور شرک کے علاوہ کسی گناہ کی مجال نہیں ہوتی کہ اُس کو ہلاک کرڈالے ، اور وہ (کلمات پڑھنے والا )لوگوں میں عمل کے اعتبار سے سب سے افضل ہوتاہے، سوائے اُس شخص کے جو اُس سے آگے بڑھ جائے یعنی اُس سے زیادہ یہ کلمات کہے۔(مسند احمد :17990) خلاصہ یہ ہے کہ اِس کلمے کو دس مرتبہ پڑھنے سے سات عظیم فضیلتیں حاصل ہوتی ہیں : (1)سو نیکیاں ۔ (2)سو گناہ معاف ۔(3)سودرجات بلند۔ (4)ہر قسم کی آفات سے حفاظت۔ (5)شیطان مردود سے حفاظت۔ (6)سوائے شرک کے کوئی گناہ اُس کو ہلاک نہ کر سکے گا ۔(7)وہ اُس دن سب سے افضل عمل کرنے والا ہوگا ۔ سوائے اُس شخص کے جو اُس سے بھی زیادہ پڑھے۔"
            },
            {
              "point_id": "azkar_jahannam_se_azadi_7_times",
              "title_urdu": "جہنم سے آزادی کا پروانہ (سات مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ أَجِرْنِيْ مِنَ النَّارِ",
              "translation_urdu": "اے اللہ مجھے آگ(جہنم )سے پناہ عطاء فرما۔",
              "fawaid_urdu": "فجر اور مغرب کی نماز کے بعد سات مرتبہ اِن کلمات کا کہنے والا اُس دن اگر مرجائے تو جہنم سے بری ہوجائےگا ۔(ابواداؤد:5079)"
            },
            {
              "point_id": "azkar_shukr_of_niamat_morning",
              "title_urdu": "اللہ کی نعمتوں کا شکر",
              "arabic_text": "اَللّٰهُمَّ مَا أَصْبَحَ بِيْ مِنْ نِّعْمَةٍ أَوْ بِأَحَدٍ مِّنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ ، لَا شَرِيْكَ لَكَ ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
              "translation_urdu": "اے اللہ! جو بھی نعمت میرے پاس یا تیری مخلوق میں سے کسی کے پاس بھی صبح کے وقت موجود ہے تو وہ صرف تنہا تیری ہی جانب سے ہے،(اُن میں)، تیرا کوئی شریک نہیں،پس تیرے لئے ہی ساری تعریف اور شکر ہے۔",
              "fawaid_urdu": "جس نے مذکورہ کلمات صبح اور شام پڑھ لیے تو اُس کی جانب سے اُس دن اوراُس رات کا شکر اداء ہوجائے گا۔(شعب الایمان:4059)(ابوداؤد:5073)"
            }
          ]
        },
        {
          "id": "morning_adhkar_part_3",
          "original_section_number": 3,
          "title_urdu": "صبح کے مسنون اَذکار (حصہ سوم)",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "azkar_most_virtuous_100_times",
              "title_urdu": "سب سے افضل عمل (سو مرتبہ)",
              "arabic_text": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
              "translation_urdu": "اللہ پاک ہے اور اسی کی تعریف ہے۔",
              "fawaid_urdu": "محمد بن عبدالملک اموی عبدالعزیز بن مختار سہیل بن سمی ابوصالح حضرت ابوہریرہ (رض) سے روایت ہے کہ رسول اللہ ﷺ نے ارشاد فرمایا جو آدمی صبح و شام سو مرتبہ (یہ دعا) پڑھتا ہے قیامت کے دن کوئی اس سے زیادہ افضل عمل نہیں لاسکتا سوائے اس کے جس نے اس کے برابر یا اس سے زیادہ پڑھا ہو۔ (صحیح مسلم 6843)"
            },
            {
              "point_id": "azkar_maghfirat_parwana_morning",
              "title_urdu": "گناہوں کی معافی کا پروانہ",
              "arabic_text": "اَللّٰهُمَّ إِنِّيْ أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَ مَلَائِكَتَكَ وَ جَمِيْعَ خَلْقِكَ ، أَنَّكَ أَنْتَ اللهُ لَا إِلٰهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ",
              "translation_urdu": "اے اللہ میں نے صبح کی ،میں تجھے ،تیرے عرش کو اُٹھانے والے فرشتوں اورتمام فرشتوں کو اور تیری تمام مخلوقات کو اِس بات پر گواہ بناتا ہوں کہ بیشک تو ہی اللہ ہے ،تیرے سوا کوئی معبود نہیں ،تو اکیلا ہے،تیرا کوئی شریک نہیں ، اور (اِس بات پر گواہ بناتا ہوں کہ )حضرت محمّدﷺتیرے بندے اور تیرے رسُول ہیں ۔",
              "fawaid_urdu": "اِن کلمات کی فضیلت یہ ہے:”غُفِرَ لَهُ مَا أَصَابَ فِي يَوْمِهِ ذَلِكَ مِنْ ذَنْبٍ“یعنی پڑھنے والے کے اُس دن کے گناہ معاف ہوجائیں گے۔(ابواداؤد:5078) ایک اور روایت میں ہے”أَعْتَقَ اللهُ رُبُعَهُ مِنَ النَّارِ“ یعنی ایک دفعہ مذکورہ کلمات کہنے پر جسم کا چوتھائی حصہ جہنم سے آزاد ہوجائے گا، اور چار مرتبہ کہنے سے مکمل جسم آزاد ہوجائے گا ۔(ابواداؤد:5069)"
            },
            {
              "point_id": "azkar_itmaam_e_niamat_3_times",
              "title_urdu": "اللہ کی نعمتوں کی تکمیل (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَصْبَحْتُ مِنْكَ فِي نِعْمَةٍ وَّ عَافِيَةٍ وَّ سِتْرٍ ، فَأَتِمَّ عَلَيَّ نِعْمَتَكَ وَعَافِيَتَكَ وَسِتْرَكَ فِي الدُّنْيَا وَالْآخِرَةِ",
              "translation_urdu": "اے اللہ ! میں نے تیری جانب سے نعمت،عافیت اورپردہ پوشی کی حالت میں صبح کی ، پس تو مجھ پر اپنی نعمت،عافیت اور پردہ پوشی کو دنیا و آخرت میں مکمل فرما۔",
              "fawaid_urdu": " صبح کے وقت تین مرتبہ پڑھنے والے کے بارے میں آپ ﷺ نے اِرشاد فرمایا:”كَانَ حَقًّا عَلَى اللهِ عَزَّ وَجَلَّ أَنْ يُتِمَّ عَلَيْهِ نِعْمَتَهُ“اللہ نے اپنے ذمّہ لازم کیا ہے کہ اُس کے اوپر اپنی نعمتیں مکمل فرمادیں گے۔(ابن سنی:55)"
            },
            {
              "point_id": "azkar_best_rizq",
              "title_urdu": "بہترین رزق کی دعا",
              "arabic_text": "مَا شَاءَ اللهُ ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ ، أَشْهَدُ أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
              "translation_urdu": "اللہ جو چاہے،گناہوں سے بچنے کی طاقت اور نیک کام کرنے کی قوّت صرف اللہ تعالیٰ ہی کی جانب سے ہے، میں گواہی دیتا ہوں کہ اللہ چیز پر قدرت رکھنے والا ہے۔",
              "fawaid_urdu": " مذکورہ بالا کلمات صبح کے وقت پڑھنے والے کے بارے میں آپﷺ نے اِرشاد فرمایا:رُزِقَ خَيْرَ ذَلِكَ الْيَوْمِ، وَصُرِفَ عَنْهُ شَرُّهُ“ یعنی اُسے اُس دن کا بہترین رزق عطاء کیا جائے گا اور اُس دن کے شرکو اُس سے دور کردیا جائےگا ۔(ابن السنی:53)"
            },
            {
              "point_id": "azkar_maghfirat_ka_parwana",
              "title_urdu": "مغفرت کا پروانہ",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ رَبِّيْ لَا أُشْرِكُ بِهِ شَيْئًا ، وَأَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا اللهُ",
              "translation_urdu": "تمام تعریفیں اللہ ہی کیلئے ہیں جو میرا پروردگار ہے،میں اُس کے ساتھ کسی بھی چیز کو شریک نہیں ٹہراتا، اور میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں ہے۔",
              "fawaid_urdu": " مذکورہ کلمات صبح کے وقت میں پڑھنے والے کے بارے میں آپﷺنے اِرشاد فرمایا:”ظَلَّ يُغْفَرُ لَهُ ذُنُوبُهُ حَتَّى يُمْسِيَ“یعنی وہ شام ہونے تک دن بھر اِس حالت میں گزارتا ہے کہ اُس کی مغفرت کردی جاتی ہے ۔(طبرانی کبیر:635)"
            },
            {
              "point_id": "azkar_hifazat_nazar_e_bad",
              "title_urdu": "نظرِ بد سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَّهَامَّةٍ، وَّمِنْ كُلِّ عَيْنٍ لَّامَّةٍ",
              "translation_urdu": "میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں ہر شیطان اور ڈسنے والے جانور سے اور ہر ملامت کرنے والی آنکھ سے۔",
              "fawaid_urdu": "مذکورہ کلمات نظرِ بد سے حفاظت کیلئے بہترین کلمات ہیں ،نبی کریم ﷺ حضرت حسن و حُسین (رض) کو مذکورہ کلمات کے ذریعہ اللہ تعالیٰ کی پناہ میں دیتے تھے، اور فرماتے تھے کہ حضرت ابراہیم علیہ السلام بھی اپنے بیٹوں حضرت اسحاق اور حضرت اِسماعیل علیہ السلام کو اِنہی کلمات کے ذریعہ اللہ کی پناہ میں دیتے تھے۔(بخاری:3371)"
            },
            {
              "point_id": "azkar_hifazat_khauf_ghabrahat",
              "title_urdu": "خوف و گھبراہٹ سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ ، وَمِنْ هَمَزَاتِ الشَّيَاطِيْنِ وَ أَنْ يَّحْضُرُونِ",
              "translation_urdu": " میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں اُس کے غضب وغصہ سےاوراس کے عذاب سے اور اس کےبندوں کے شرسے اورشیاطین کے وسوسوں سےاور اے میرے پروردگار میں تیری پناہ چاہتا ہوں اس سےکہ وہ (شیطان) میرےپاس بھی آئیں۔",
              "fawaid_urdu": "مذکورہ کلمات خوف و گھبراہٹ سے حفاظت اور اُس کیفیت کو دور کرنے کیلئے بڑے مفید اور بہترین ہیں ،نبی کریم ﷺ خوف و گھبراہٹ کی حالت میں اور بالخصوص نیند میں ڈرجانے اور خوف و گھبراہٹ کا شکار ہوجانے کی صورت میں اِن کلمات کو پڑھنے کی تلقین فرمایا کرتے تھے۔(ابوداؤد: 3893)(ترمذی:3528) حضرت عبد اللہ بن عمرو بن العاص (رض) کے بارے میں آتا ہے کہ وہ اپنی بالغ اولاد کو اِن کلمات کے پڑھنے کی تلقین فرمایا کرتے تھے اور نابالغ کم سِن اولاد کے گلے میں یہ کلمات لکھ کر ڈال دیا کرتے تھے۔(ترمذی:3528)"
            },
            {
              "point_id": "azkar_hifazat_shaitain_jinnat",
              "title_urdu": "شیاطین و جنات سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ وَّ لَا فَاجِرٌ مِنْ شَرِّ مَا خَلَقَ، وَ ذَرَأَ وَ بَرَأَ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ ، وَمِنْ شَرِّ مَا يَعْرُجُ فِيهَا، وَمِنْ شَرِّ مَا ذَرَأَ فِي الْأَرْضِ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقًا يَّطْرُقُ بِخَيْرٍ يَّا رَحْمٰنُ",
              "translation_urdu": "میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں جن سے نہ کوئی نیک آگے بڑھ سکتا ہے نہ گناہ گار، ہراُس چیزکےشرسےجس کو اللہ نے پیدا کیا ، پھیلایا اور وجود دیا،اور ہر اُس چیز کے شر سے جوآسمان سے اترتی ہےاورجوآسمان پرچڑھتی ہےاورہر اس چیزکےشرسےجوزمین کےاندرپیداہوتی ہےاورجوزمین سے (پھوٹ کر) نکلتی ہےاوررات دن کےفتنوں کےشرسےاوررات دن کے (ناگہانی) واقعات اورحادثوں کےشرسے،بجز اس اچھے واقعہ کےجوخیر کولائے (کہ وہ تو سراسر رحمت ہے) اے بہت رحم کرنے والے۔",
              "fawaid_urdu": "حضرت جبریل علیہ السلام نےشیاطین و جنّات کے نقصان سے بچنے کیلئے مذکورہ کلمات نبی کریم ﷺکو سکھائے تھے۔(مسند احمد:15461)"
            },
            {
              "point_id": "azkar_hifazat_jadoo_sehar",
              "title_urdu": "جادو اور سحر سے حفاظت",
              "arabic_text": "أَعُوذُ بِوَجْهِ اللهِ الْعَظِيْمِ الَّذِيْ لَيْسَ شَيْءٌ أَعْظَمَ مِنْهُ ، وَ بِكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِيْ لاَ يُجَاوِزُهُنَّ بَرٌّ وَّ لاَ فَاجِرٌ، وَ بِأَسْمَاءِ اللهِ الْحُسْنٰى كُلِّهَا مَا عَلِمْتُ مِنْهَا وَمَا لَمْ أَعْلَمْ، مِنْ شَرِّ مَا خَلَقَ وَ ذَرَأَ وَ بَرَأَ",
              "translation_urdu": "میں اللہ عظیم کی پناہ میں آتا ہوں جس سے کوئی چیز بڑی نہیں ، اور اُس کےتمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں جن سے نہ کوئی نیک بچ سکتا ہے نہ بد، اور اللہ تعالیٰ کےتمام بہترین ناموں کی (پناہ میں آتا ہوں) جن کو میں جانتا ہوں اور جن کو میں نہیں جانتا، ہراُس چیزکےشرسےجس کو اللہ نے پیدا کیا ،پھیلایا اور وجود دیا۔",
              "fawaid_urdu": " مذکورہ کلمات جادو اور سحر کے اَثرات سے بچنے کیلئے بہت ہی مفید اور بہترین کلمات ہیں،حضرت کعب اَحبار (رض) اِن کلمات کو پڑھتے اور فرماتے تھے: ”لَوْلاَ كَلِمَاتٌ أَقُولُهُنَّ لَجَعَلَتْنِي يَهُودُ حِمَارًا“اگر میں اِن کلمات کو نہ پڑھتا تو یہود(جادو کے ذریعہ) مجھے گدھا بنادیتے۔(مؤطا مالک:2002)"
            },
            {
              "point_id": "azkar_hifazat_shirk_3_times",
              "title_urdu": "شرک سے حفاظت (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
              "translation_urdu": " اے اللہ میں تیری پناہ میں آتا ہوں اِس سے کہ میں جانتے بوجھتے ہوئے تیرے ساتھ کسی کو شریک ٹہراؤں اور میں تجھ سے مغفرت چاہتاہوں اُس (شرک)سے جس کو میں نہیں جانتا۔",
              "fawaid_urdu": "اِس اُمّت کے اندر چیونٹی کی آہٹ سے بھی زیادہ مخفی اور پوشیدہ شرک رکھا گیا ہے، اور اُس چھوٹے بڑے تمام طرح کے شرک سے بچنے کیلئے نبی کریم ﷺ نے مذکورہ کلمات تین مرتبہ روزانہ پڑھنے کی تلقین فرمائی ہے۔(مسند ابویعلیٰ موصلی:58)"
            },
            {
              "point_id": "azkar_hifazat_shaitaan_samee_ul_aleem_3_times",
              "title_urdu": "شیطان سے حفاظت (تین مرتبہ)",
              "arabic_text": "أَعُوْذُ بِاللهِ السَّمِيْعِ العَلِيْمِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
              "translation_urdu": " میں شیطان مَردود سےاللہ تعالیٰ کی پناہ میں آتا ہوں جو سننے اور جاننے والا ہے ۔",
              "fawaid_urdu": "حدیث کے مطابق مذکورہ تعوّذ صبح کے وقت پڑھنے والا شام تک شیطان سے محفوظ ہوجاتا ہے۔(عمل الیوم و اللیلۃ لابن السنی:49) اور اگر تعوّذ کے اِنہی کلمات کو تین مرتبہ پڑھنے کےبعد سورۃ الحشر کی آخری تین آیات یعنی ﴿هُوَ اللهُ الَّذِيْ لَا إِلٰهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ﴾ سے سورت کے آخر تک پڑھ لی جائیں تو حدیث کے مطابق اگر صبح کے وقت پڑھا تو شام تک ستر ہزار فرشتے اُس کیلئے رحمت کی دُعاء کرتے رہتے ہیں اور اگر وہ اُس دن مرجائے تو شہادت کی موت مرتا ہے۔(ترمذی:2922)"
            },
            {
              "point_id": "azkar_hifazat_masaib_morning",
              "title_urdu": "مصائب و حوادث سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ أَنْتَ رَبِّي، لَا إِلٰهَ إِلَّا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْكَرِيمِ، مَا شَاءَ اللهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، أَعْلَمُ أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ، وَ أَنَّ اللهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا إِنَّ رَبِّي عَلٰى صِرَاطٍ مُّسْتَقِيمٍ",
              "translation_urdu": "اے اللہ! تو میرا پروردگارہے،تیرے سوا کوئی معبود نہیں ،میں نے تجھ ہی پر بھروسہ کیا اور تو بزرگی والے عرش کا ربّ ہے،جو اللہ نے چاہا وہ ہوگیا اور جو نہیں چاہا نہیں ہوا،گناہوں سے بچنے کی طاقت اور نیک کام کرنے کی قوّت صرف اللہ ہی کی جانب سے ہے جو عظمت والا بلند و برتر ہے۔میں جانتا ہوں کہ اللہ ہر چیز پر قدرت رکھتا ہےاور بیشک اللہ تعالیٰ نے علم کے اعتبار سے ہر چیز کا اِحاطہ کررکھا ہے۔اے اللہ میں آپ کی پناہ چاہتا ہوں اپنے نفس کے شر سے اور ہر اُس زمین پر چلنے والے جاندار کے شرّ سے جس کی پیشانی آپ کے قبضہ میں ہے، بیشک میرا ربّ سیدھی راہ پر ہے۔",
              "fawaid_urdu": "یہ دُعاءِ ابی درداء کے کلمات ہیں، جو مصائب و حوادث سے حفاظت کیلئے ایک بہترین دُعاء ہے ،صبح شام اِس کے پڑھنے کا اہتمام کرنا چاہیئے ،حدیث کے مطابق یہ کلمات اگر کوئی صبح کے وقت پڑھ لے تو ”لَمْ تُصِبْهُ مُصِيْبَةٌ حَتَّى يُمْسِيَ“یعنی شام ہونے تک اُسے کوئی مصیبت نہ پہنچی گی۔(الدعاء للطبرانی:343)(ابن السنی:57)"
            },
            {
              "point_id": "azkar_hifazat_gham_o_fikr_morning",
              "title_urdu": "غم اور فکر سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ رَبَّ السَّمٰوَاتِ السَّبْعِ وَ رَبَّ الْعَرْشِ الْعَظِيمِ، اِكْفِنِيْ كُلَّ مُهِمٍّ مِّنْ حَيْثُ شِئْتَ ، وَ كَيْفَ شِئْتَ، وَ مِنْ أَيْنَ شِئْتَ. حَسْبِيَ اللهُ لِدِيْنِيْ، حَسْبِيَ اللهُ لِدُنْيَايَ حَسْبِيَ اللهُ لِمَا أَهَمَّنِيْ، حَسْبِيَ اللهُ لِمَنْ بَغٰى عَلَيَّ، حَسْبِيَ اللهُ لِمَنْ حَسَدَنِيْ حَسْبِيَ اللهُ لِمَنْ كَادَنِيْ بِسُوْءٍ، حَسْبِيَ اللهُ عِنْدَ الْمَوْتِ، حَسْبِيَ اللهُ عِنْدَ الْمَسْأَلَةِ فِي الْقَبْرِ، حَسْبِيَ اللهُ عِنْدَ الْمِيْزَانِ، حَسْبِيَ اللهُ عِنْدَ الصِّرَاطِ، حَسْبِيَ اللهُ لَا إِلٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
              "translation_urdu": "اے اللہ !اے ساتوں آسمانوں اور عظیم عرش کے پروردگار!میرے ہر اہم کام کیلئے کافی ہوجاجس طرح تو چاہے،جس جگہ سے تو چاہے اورجہاں کہیں تو چاہے۔ اللہ میرے دین کیلئے کافی ہے، اللہ میری دنیاکیلئے کافی ہے،اللہ میری فکروں کیلئے کافی ہے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو مجھ پر زیادتی کرے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو مجھ سے حسد کرے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو میرے خلاف بُری چال چلے،اللہ میرے لئے کافی ہے موت کے وقت،اللہ میرے لئے کافی ہےقبر میں(مُنکَر نکیر کے) سوال کے وقت،اللہ میرے لئے کافی ہےنامہ عمل تُلنے کے وقت،اللہ میرے لئے کافی ہےپُل صِراط(پر سے گزرنے)کے وقت، اللہ میرے لئے کافی ہے،اُس کے سوا کوئی معبود نہیں ،اُسی پر میں نے بھروسہ کیا اور وہ عرشِ عظیم کا مالک ہے۔",
              "fawaid_urdu": "اِس دُعاء کےابتدائی کلمات یعنی ”وَ مِنْ أَيْنَ شِئْتَ“تک کے الفاظ کے بارے میں حدیث میں یہ فضیلت ذکر کی گئی ہے کہ جو یہ کلمات پڑھ لے اللہ تبارک وتعالیٰ اُس کے غم اور فکر کو دور کردیتے ہیں۔(مکارم الاخلاق للخرائطی:1037) اور”حَسْبِيَ اللهُ“سے آگے کےکلمات کی فضیلت حدیث میں یہ ذکر کی گئی ہےکہ: جو شخص نمازوں کے بالخصوص فجر کی نماز کے بعد مذکورہ کلمات پڑھ لے تو اللہ تبارک و تعالیٰ اُس کیلئے دنیا و آخرت کے وہ تمام مراحل جو اِس دُعاء میں ذکر کیے گئے ہیں اُن میں کافی ہوجاتے ہیں۔(نوادرالأصول ،حکیم ترمذی:2/274)(الدر المنثور:2/390)"
            },
            {
              "point_id": "azkar_kifayat_har_kaam_7_times",
              "title_urdu": "ہر کام میں کفایت (سات مرتبہ)",
              "arabic_text": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ، عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ",
              "translation_urdu": "مجھے اللہ کافی ہے اس کے سواکوئی معبود نہیں ، میں نے اسی پر بھروسہ کیا اور وہ عرش عظیم کا مالک ہے۔",
              "fawaid_urdu": "مذکورہ کلمات صبح شام پڑھنے والے کے بارے میں منقول ہے:”كَفَاهُ اللَّهُ مَا أَهَمَّهُ“یعنی اُس کے ہر اہم کام کیلئے کفایت ہوجائے گی۔(ابوداؤد:5081)"
            },
            {
              "point_id": "azkar_jannat_parwana_3_times_morning",
              "title_urdu": "جنت کا پروانہ (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ لَكَ الْحَمْدُ لَا إِلٰهَ إِلَّا أَنْتَ ، أَنْتَ رَبِّي ، وَ أَنَا عَبْدُكَ ، آمَنْتُ بِكَ مُخْلِصًا لَّكَ دِيْنِيْ، أَصْبَحْتُ عَلٰى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أَتُوبُ إِلَيْكَ مِنْ شَرِّ عَمَلِي، وَأَسْتَغْفِرُكَ لِذُنُوبِيْ الَّتِي لَا يَغْفِرُهَا إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ! تیرے لئے ہی ساری تعریفیں ہیں ،تیرے سوا کوئی معبود نہیں ،تو میرا ربّ اور میں تیرا بندہ ہوں،میں تجھ پر اپنے دین کو خالص کرتے ہوئے ایمان لایا ،میں نے اپنی اِستطاعت کے مطابق تیرے عہد اور وعدہ کے(پورا کرنے کے) ساتھ صبح کی ، میں تیری جانب رجوع کرتا ہوں اپنے عمل کے شر سے اور تجھ سے اپنے گناہوں کی معافی مانگتا ہوں، وہ تمام گناہ جو تیرے سوا کوئی معاف نہیں کرسکتا ۔",
              "fawaid_urdu": " حضرت ابوامامہ (رض) فرماتے ہیں کہ نبی کریم ﷺ کایہ اِرشاد نقل فرماتے ہیں: جس نے یہ مذکورہ بالا کلمات صبح کے وقت تین مرتبہ پڑھے ،پھر اُس دن میں انتقال کرجائے تو وہ ضرور جنّت میں داخل ہوگا۔راوی کہتے ہیں کہ آپ ﷺ جتنا اِس پر قسم کھاتے تھے اِتنا کسی اور چیز پر قسم نہ کھاتے ، اور آپ ﷺ قسم کھاکر یہ فرماتے تھے :”وَاللهِ مَا قَالَهَا عَبْدٌ حِينَ يُصْبِحُ ثَلَاثَ مَرَّاتٍ فَيَمُوتُ فِي ذَلِكَ الْيَوْمِ إِلَّا دَخَلَ الْجَنَّةَ“اللہ کی قسم! کوئی بندہ صبح کے وقت یہ کلمات تین مرتبہ پڑھے اور پھر اُسی دن انتقال کرجائے تو وہ جنّت میں داخل ہوگا۔ (طبرانی اوسط:3096)"
            },
            {
              "point_id": "azkar_hifazat_khalq_se",
              "title_urdu": "ساری مخلوقات کے شر سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ رَبَّ السَّمٰوَاتِ السَّبْعِ وَمَا أَظَلَّتْ ، وَرَبَّ الْأَرْضِيْنَ وَمَا أَقَلَّتْ ، وَ رَبَّ الشَّيَاطِيْنِ وَمَا أَضَلَّتْ ، كُنْ لِّيْ جَارًا مِّنْ شَرِّ خَلْقِكَ كُلِّهِمْ جَمِيْعًا أَنْ يَّفْرُطَ عَلَيَّ أَحَدٌ مِّنْهُمْ أَوْ أَنْ يَّبْغِيَ ، عَزَّ جَارُكَ ، وَ جَلَّ ثَنَاؤُكَ ، وَ لَا إِلٰهَ غَيْرُكَ ، وَ لَا إِلٰهَ إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ! اے ساتوں آسمانوں اُن تمام چیزوں کے پروردگار جن پر وہ آسمان سایہ فگن ہیں ،اور اے زمینوں اور اُن تمام چیزوں کے پروردگار جنہیں اُن زمینوں نے اُٹھایا ہوا ہے، اور اے شیطانوں اور اُن تمام چیزوں کے پروردگار جنہیں اُن شیاطین نے گمراہ کیا ہے،تو مجھے اپنی ساری کی ساری مخلوقات کے شر سے پناہ دیدے اِس بات سے کہ اُن میں سے کوئی مجھ پر زیادتی یا ظلم کرے ،تیری پناہ غالب ہے،تیری تعریف بہت بڑی ہے اور تیرے علاوہ کوئی معبود نہیں اور معبود صرف توہی ہے ۔",
              "fawaid_urdu": "یہ دُعاء نبی کریم ﷺ نے بستر پر جاتے ہوئے سونے سے پہلے پڑھنے کی تعلیم دی ہے۔(ترمذی:3523) اور حفاظت کےاعتبار سے اِس کا معنی اتنا خوبصورت اور بہترین ہےکہ اگر صبح اور شام بھی یہ دُعاء پڑھ لی جائے تو بہت ہی خوب ہے۔"
            },
            {
              "point_id": "azkar_talafi_mamoolat_surah_room",
              "title_urdu": "تمام معمولات کی تلافی",
              "arabic_text": "فَسُبْحَانَ اللهِ حِيْنَ تُمْسُوْنَ وَحِيْنَ تُصْبِحُونَ وَلَهُ الْحَمْدُ فِي السَّمٰوَاتِ وَالْأَرْضِ وَعَشِيًّا وَحِيْنَ تُظْهِرُونَ يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَيُحْيِ الْأَرْضَ بَعْدَ مَوْتِهَا وَكَذٰلِكَ تُخْرَجُونَ“۔(سورۃ الرّوم:17 ،18 ،19)",
              "translation_urdu": "لہٰذا اللہ کی تسبیح بیان کرواُس وقت بھی جب تمہارے پاس شام آتی ہے اور اُس وقت بھی جب پر صبح طلوع ہوتی ہے اور اُسی کی حمد ہوتی ہے آسمانوں میں بھی اور زمین میں بھی اور سورج ڈھلنے کے وقت بھی(اُس کی تسبیح کرو) اور اُس وقت بھیجب تم ظہر کا وقت آتا ہے۔وہ جاندار کو بے جان سے نکال لاتا ہےاور بے جان کو جاندار سے نکال لاتا ہے اوہ وہ زمین کو اُس کے مردہ ہوجانےکے بعد زندگی بخشتا ہے اور اِسی تم کو (قبروں سے)نکال لیا جائےگا۔",
              "fawaid_urdu": "مذکورہ تینوں آیات کے پڑھنے کی حدیث میں یہ فضیلت یہ ذکر کی گئی ہے: ”أَدْرَكَ مَا فَاتَهُ فِي يَوْمِهِ ذَلِكَ “یعنی اُس دن کے چھوٹے ہوئے تمام معمولات کی تلافی ہوجائے گی۔(ابوداؤد:5076)"
            },
            {
              "point_id": "azkar_one_lakh_hasanat",
              "title_urdu": "ایک لاکھ نیکیاں",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِيْ تَوَاضَعَ كُلُّ شَيْءٍ لِعَظَمَتِهِ، وَالْحَمْدُ لِلّٰهِ الَّذِيْ ذَلَّ كُلُّ شَيْءٍ لِعِزَّتِهِ، وَالْحَمْدُ لِلّٰهِ الَّذِيْ أَخْضَعَ كُلُّ شَيْءٍ لِمُلْكِهِ",
              "translation_urdu": "تمام تعریفیں اللہ کیلئے ہیں جس کی عظمت کے سامنے ہر چیز جھکی ہوئی ہے،اور تمام تعریفیں اللہ کیلئےہیں ہیں جس کی عزّت کے سامنے ہر چیز ذلیل ہے،اور تمام تعریفیں اللہ کیلئےہیں جس کی سلطنت کے سامنے ہر چیز عاجز ہے۔",
              "fawaid_urdu": "حضرت اُمِّ سلمہ (رض) سے نبی کریم ﷺ کا یہ اِرشاد نقل فرماتی ہیں :جو شخص صبح کے وقت یہ دُعاء پڑھ لے اُس کیلئے ایک لاکھ نیکیاں لکھی جاتی ہیں اور اگر اُس دن اُس کا اِنتقال ہوجائے تو اُس کی روح کو سبز پرندوں کی شکل دے کرجنّت میں چھوڑ دیا جائےگا جو جنّت میں جہاں چاہیں گے چَرتے پھریں گے۔(الدّعاء للطبرانی:325)"
            },
            {
              "point_id": "azkar_less_time_more_ajr",
              "title_urdu": "کم وقت میں زیادہ اجر",
              "arabic_text": "سُبْحَانَ اللهِ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ، وَ سُبْحَانَ اللهِ عَدَدَ مَا خَلَقَ فِي الأَرْضِ، وَ سُبْحَانَ اللهِ عَدَدَ مَا بَيْنَ ذٰلِكَ، وَ سُبْحَانَ اللهِ عَدَدَ مَا هُوَ خَالِقٌ ، وَاللهُ أَكْبَرُ مِثْلَ ذٰلِكَ ، وَالْحَمْدُ لِلّٰهِ مِثْلَ ذٰلِكَ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ مِثْلَ ذٰلِكَ",
              "translation_urdu": "اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابرجو اُس نے آسمان میں پیدا کی ،اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابرجو اُس نے زمین میں پیدا کی ، اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابر جو آسمان و زمین کے درمیان پیدا کی ،اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابر جو وہ( اَزل سے اَبد تک)پیدا کرنے والا ہے، اور ”اَللهُ أَكْبَر“بھی اِسی طرح ہے،”اَلْحَمْدُ لِلّٰهِ“ بھی اِسی طرح ہے اور ”لَاحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ“بھی اِسی طرح ہے۔",
              "fawaid_urdu": "یہ مختصر لیکن بہت ہی جامع کلمات ہیں ،جن میں بہت ہی خوبصورت اَنداز میں تسبیح و تقدیس کی گئی ہے ، نبی کریم ﷺ کسی خاتون کے پاس سے گزرے جن کے سامنے گٹھلیاں یا کنکر پڑے ہوئے تھے جن پر وہ تسبیح پڑھ رہی تھیں،آپ ﷺ نے اِرشاد فرمایا :کیا میں تمہیں اِس سے زیادہ آسان اور افضل عمل نہ بتاؤں؟ پھر آپ ﷺ نے اِنہی مذکورہ کلمات کی تلقین فرمائی۔(ترمذی:3568) لہٰذا بہتر ہے کہ صبح شام اِن مبارک کلمات کو بھی پڑھ لیا جائے تاکہ کم وقت میں زیادہ اجر کو جمع کیا جاسکے۔"
            },
            {
              "point_id": "azkar_five_diseases_protection_3_times",
              "title_urdu": "پانچ بڑی بیماریوں سے حفاظت (تین مرتبہ)",
              "arabic_text": "سُبْحَانَ الله ِالْعَظِيْمِ وَبِحَمْدِهِ ، وَلَاحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
              "translation_urdu": "پاک ہے اللہ کی ذات جو عظمت والی ہے اور اُسی کیلئے ساری تعریف ہے،اور گناہوں سے بچنے کی طاقت اور نیک کام کرنے کی قوّت صرف اللہ ہی جانب سے ہے۔",
              "fawaid_urdu": " فجر کی نماز کے بعد تین مرتبہ یہ کلمات پڑھنے کی برکت سے اللہ تبارک و تعالیٰ پانچ بڑی بیماریوں یعنی جنون،جُذام،اندھا پن ، برص اور فالج سے حفاظت فرمادیتے ہیں۔(عمل الیوم و اللیلۃ لابن السنی:133 ، 134)"
            },
            {
              "point_id": "azkar_kifayat_dunya_akhira_morning",
              "title_urdu": "دنیا و آخرت کے معاملات میں کفایت",
              "arabic_text": "اَللّٰهُمَّ رَبَّ السَّمٰوَاتِ السَّبْعِ وَ رَبَّ الْعَرْشِ الْعَظِيمِ، اِكْفِنِيْ كُلَّ مُهِمٍّ مِّنْ حَيْثُ شِئْتَ ، وَ كَيْفَ شِئْتَ، وَ مِنْ أَيْنَ شِئْتَ. حَسْبِيَ اللهُ لِدِيْنِيْ، حَسْبِيَ اللهُ لِدُنْيَايَ حَسْبِيَ اللهُ لِمَا أَهَمَّنِيْ، حَسْبِيَ اللهُ لِمَنْ بَغٰى عَلَيَّ، حَسْبِيَ اللهُ لِمَنْ حَسَدَنِيْ حَسْبِيَ اللهُ لِمَنْ كَادَنِيْ بِسُوْءٍ، حَسْبِيَ اللهُ عِنْدَ الْمَوْتِ، حَسْبِيَ اللهُ عِنْدَ الْمَسْأَلَةِ فِي الْقَبْرِ، حَسْبِيَ اللهُ عِنْدَ الْمِيْزَانِ، حَسْبِيَ اللهُ عِنْدَ الصِّرَاطِ، حَسْبِيَ اللهُ لَا إِلٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
              "translation_urdu": "اے اللہ !اے ساتوں آسمانوں اور عظیم عرش کے پروردگار!میرے ہر اہم کام کیلئے کافی ہوجاجس طرح تو چاہے،جس جگہ سے تو چاہے اورجہاں کہیں تو چاہے۔ اللہ میرے دین کیلئے کافی ہے، اللہ میری دنیاکیلئے کافی ہے،اللہ میری فکروں کیلئے کافی ہے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو مجھ پر زیادتی کرے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو مجھ سے حسد کرے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو میرے خلاف بُری چال چلے،اللہ میرے لئے کافی ہے موت کے وقت،اللہ میرے لئے کافی ہےقبر میں(مُنکَر نکیر کے) سوال کے وقت،اللہ میرے لئے کافی ہےنامہ عمل تُلنے کے وقت،اللہ میرے لئے کافی ہےپُل صِراط(پر سے گزرنے)کے وقت، اللہ میرے لئے کافی ہے،اُس کے سوا کوئی معبود نہیں ،اُسی پر میں نے بھروسہ کیا اور وہ عرشِ عظیم کا مالک ہے۔",
              "fawaid_urdu": "اِس دُعاء کےابتدائی کلمات یعنی ”وَ مِنْ أَيْنَ شِئْتَ“تک کے الفاظ کے بارے میں حدیث میں یہ فضیلت ذکر کی گئی ہے کہ جو یہ کلمات پڑھ لے اللہ تبارک وتعالیٰ اُس کے غم اور فکر کو دور کردیتے ہیں۔(مکارم الاخلاق للخرائطی:1037) اور”حَسْبِيَ اللهُ“سے آگے کےکلمات کی فضیلت حدیث میں یہ ذکر کی گئی ہےکہ: جو شخص نمازوں کے بالخصوص فجر کی نماز کے بعد مذکورہ کلمات پڑھ لے تو اللہ تبارک و تعالیٰ اُس کیلئے دنیا و آخرت کے وہ تمام مراحل جو اِس دُعاء میں ذکر کیے گئے ہیں اُن میں کافی ہوجاتے ہیں۔(نوادرالأصول ،حکیم ترمذی:2/274)(الدر المنثور:2/390)"
            }
          ]
        },
        {
          "id": "evening_adhkar_part_4",
          "original_section_number": 4,
          "title_urdu": "شام کے مسنون اَذکار (حصہ چہارم)",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "azkar_be_baha_ajr_evening",
              "title_urdu": "بیش بہا اجر و ثواب",
              "arabic_text": "اللهُ أَكْبَرُ اَلْحَمْدُ لِلّٰهِ سُبْحَانَ اللهِ لَا إِلٰهَ إِلَّا اللهُ",
              "translation_urdu": "اللہ سب سے بڑا ہے سب تعریف اللہ ہی کے لئے ہے۔ اللہ پاک ہے۔ اللہ کے سوا کوئی معبود نہیں۔",
              "fawaid_urdu": "حضرت ابو امامہ (رض) سے مروی ہے کہ نبی کریم ﷺ نے ارشاد فرمایا میرے نزدیک طلوع آفتاب کے وقت اللہ کا ذکر کرنا اللہ اکبر الحمد لللہ لا الہ الا اللہ اور سبحان اللہ کہنا اولاد اسماعیل (علیہ السلام) میں سے چار غلام آزاد کرنے سے زیادہ بہتر ہے اسی طرح نماز عصر سے غروب آفتاب تک اللہ کا ذکر کرنا میرے نزدیک اولاد اسماعیل (علیہ السلام) میں سے اتنے اتنے غلام آزاد کرنے سے زیادہ بہتر ہے۔ (مسند احمد 22194)"
            },
            {
              "point_id": "azkar_hifazat_shaitaan_evening",
              "title_urdu": "پورا دن شیاطین سے حفاظت",
              "arabic_text": "اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ١ۚ اَلْحَیُّ الْقَیُّوْمُ١ۚ۬ لَا تَاْخُذُهٗ سِنَةٌ وَّ لَا نَوْمٌ١ؕ لَهٗ مَا فِی السَّمٰوٰتِ وَ مَا فِی الْاَرْضِ١ؕ مَنْ ذَا الَّذِیْ یَشْفَعُ عِنْدَهٗۤ اِلَّا بِاِذْنِهٖ١ؕ یَعْلَمُ مَا بَیْنَ اَیْدِیْهِمْ وَ مَا خَلْفَهُمْ١ۚ وَ لَا یُحِیْطُوْنَ بِشَیْءٍ مِّنْ عِلْمِهٖۤ اِلَّا بِمَا شَآءَ١ۚ وَسِعَ كُرْسِیُّهُ السَّمٰوٰتِ وَ الْاَرْضَ١ۚ وَ لَا یَئُوْدُهٗ حِفْظُهُمَا١ۚ وَ هُوَ الْعَلِیُّ الْعَظِیْمُ",
              "translation_urdu": "اللہ وہ ذات ہے کہ اس کے سوا کوئی معبود نہیں ،ہمیشہ زندہ رہنے والا ہے ، تمام مخلوق کا سنبھالنے والا ہے، نہ اس کو اونگھ دبا سکتی ہے اور نہ نیند(دبا سکتی ہے) اسی کے مملوک ہیں سب جو کچھ بھی آسمانوں میں (موجودات) ہیں اور جو کچھ زمین میں ہیں، ایسا کون شخص ہے جو اس کے پاس (کسی کی) سفارش کر سکے بدون اس کی اجازت کے، وہ جانتا ہے ان (موجودات) کے تمام حاضر اور غائب حالات کو اور وہ موجودات اس کے معلومات سے کسی چیز کو اپنے علم کے احاطہ میں نہیں لا سکتے، مگر جس قدر (علم دینا) وہی چاہے، اس کی کرسی (اتنی بڑی ہےکہ اس ) نے سب آسمان اور زمین کو اپنے اندر لے رکھا ہے اور اللہ تعالىٰ کو ان دونوں (آسمان اور زمین) کی حفاظت کچھ مشکل نہیں گزرتی، اور وہ ہی عالیشان اور عظیم الشان ہے۔ (بیان القرآن)",
              "fawaid_urdu": "جو کوئی اسے رات کو پڑھے وہ صبح تک جنات اور شیاطین سے پناہ میں رہے گا اور جو صبح کو پڑھے وہ رات تک جنات اور شیاطین سے پناہ میں رہے گا۔ (المعجم الکبیر للطبرانی 542)"
            },
            {
              "point_id": "azkar_mizan_heavy_3_times_evening",
              "title_urdu": "میزان میں بھاری کلمات (تین مرتبہ)",
              "arabic_text": "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
              "translation_urdu": "پاک ہے اللہ کی ذات اور اُسی کیلئے ساری تعریف ہے،اُس کی مخلوق کی تعداد کے برابر،اُس کی ذات کی خوشنودی کے برابر،اُس کے عرش کے وزن کے برابر،اور اُس کےکلمات ( صفات) کی سیاہی کے برابر۔",
              "fawaid_urdu": "اُمّ المؤمنین حضرت جُویریہ (رض) فرماتی ہیں کہ ایک دفعہ نبی کریم ﷺ اُن کے پاس سے صبح سویرے نماز کیلئے تشریف لے گئے اور وہ مُصلّے پر بیٹھی ہوئی تھیں ،پھر سورج کے نکلنے اور روشن ہوجانے کے بعد تشریف لائے تو دیکھا کہ میں ابھی تک مُصلّےپر بیٹھی ہوئی ہوں،آپ ﷺ نے فرمایا تم ابھی تک اُسی طرح بیٹھی ہوئی ہو؟ میں نے کہا : جی ہاں!آپ ﷺ نے اِرشاد فرمایا:میں نے تمہارے پاس سے جانے کے بعد (مذکورہ بالا)چار کلمات تین مرتبہ کہے ہیں اگر اُن کو تمہارے آج کے تمام اَذکار کے مقابلے میں وزن کیا جائے تو وہ کلمات بھاری ہوجائیں گے۔(مسلم:2726)"
            },
            {
              "point_id": "azkar_aafat_se_bachao_3_times_evening",
              "title_urdu": "ناگہانی آفات اور نقصان سے بچاؤ (تین مرتبہ)",
              "arabic_text": "بِسْمِ اللهِ الَّذِيْ لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَ لَا فِي السَّمَاءِ ، وَهُوَ السَّمِيْعُ الْعَلِيْمُ",
              "translation_urdu": "اللہ کے نام سے ابتداء کرتا ہوں جس کے نام کے ساتھ کوئی چیز زمین و آسمان میں نقصان نہیں پہنچاسکتی ، اور وہ سننے والا اور جاننے والا ہے۔",
              "fawaid_urdu": "اِن کلمات کے پڑھنے والے کے بارے میں حدیث میں یہ فضیلت بیا ن کی گئی ہےکہ ”لَمْ يَضُرَّهُ شَيْءٌ فِي ذَلِكَ الْيَوْمِ أَوْ فِي تِلْكَ اللَّيْلَةِ“ اُسے اُس دن یا اُس رات کوئی نقصان نہیں پہنچے گا۔(مسند احمد:474) ایک روایت میں ہے”لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُصْبِحَ“ صبح ہونے تک اُسے کوئی ناگہانی آفت کا سامنا نہیں ہوگا۔(ابوداؤد:5088)"
            },
            {
              "point_id": "azkar_alllah_ki_maiyat_evening",
              "title_urdu": "اللہ تعالیٰ کی معیت",
              "arabic_text": "اَللّٰهُمَّ بِكَ أَمْسَيْنَا وَبِكَ أَصْبَحْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُوْرُ",
              "translation_urdu": "اے اللہ ! تیرے نام ہی سے ہم نے شام کی اور تیرے ہی نام سے ہم نے صبح کی ، تیرے ہی نام سے ہم جیتے ہیں اور تیرے ہی نام سے ہم مرتے ہیں اور تیری ہی جانب ہمیں لوٹ کر آنا ہے۔",
              "fawaid_urdu": "نبی کریم ﷺ شام کو یہ دعاء پڑھا کرتے تھے۔(ترمذی:3391)"
            },
            {
              "point_id": "azkar_fitrat_par_istiqamat_evening",
              "title_urdu": "اخلاص اور دینِ فطرت پر استقامت",
              "arabic_text": "أَمْسَيْنَا عَلىٰ فِطْرَةِ الْإِسْلَامِ وَكَلِمَةِ الْإِخْلَاصِ، وَعَلىٰ دِيْنِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلىٰ مِلَّةِ أَبِيْنَا إِبْرَاهِيْمَ حَنِيْفًا مُّسْلِمًا، وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
              "translation_urdu": "ہم نے شام کی اِسلام کی فطرت اور اِخلاص کے کلمہ پر اور اپنے نبی حضرت محمّد ﷺ کے دین پر اور اپنے والد حضرت ابراہیم علیہ السلام کے ملّت پر جو سیدھے سادے مسلمان تھے اور وہ کبھی شرک کرنے والوں میں نہ تھے۔",
              "fawaid_urdu": "نبی کریم ﷺ شام کو یہ دُعاء پڑھا کرتے تھے۔(سنن کبریٰ نسائی:9745)"
            },
            {
              "point_id": "azkar_nafs_shaitaan_se_panah_evening",
              "title_urdu": "نفس اور شیطان کے شر سے پناہ",
              "arabic_text": "اَللّٰهُمَّ فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَّمَلِيْكَهُ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ",
              "translation_urdu": "اے اللہ!اے آسمانوں اور زمین کو پیدا کرنے والے،غیب و حاضر کی تمام باتوں کو جاننے والے،ہر چیز کےپروردگار اور مالک! میں گواہی دیتا ہوں کہ تیرے سوا کوئی معبود نہیں ،میں تیری پناہ میں آتا ہوں اپنے نفس کے شر سے اور شیطان کے شر اور اُس کے شرک(میں مبتلاء کرنے)سے۔",
              "fawaid_urdu": "یہ وہ مبارک دعاء کے کلمات ہیں جونبی کریم ﷺ نےصبح ، شام اور بستر پر جاتے ہوئے پڑھنے کی تلقین کی ہے۔(ابوداؤد:5067)"
            },
            {
              "point_id": "azkar_poore_raat_ki_khair",
              "title_urdu": "پوری رات کی خیر و بھلائی کی دعا",
              "arabic_text": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلّٰهِ وَالْحَمْدُ لِلّٰهِ وَلَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلىٰ كُلِّ شَيْءٍ قَدِيْرٌ أَسْأَلُكَ خَيْرَ مَا فِي هٰذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوْذُ بِكَ مِنْ شَرِّ هٰذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا وَ أَعُوْذُ بِكَ مِنَ الكَسَلِ وَ سُوْءِ الْكِبَرِ وَ أَعُوْذُ بِكَ مِنْ عَذَابِ النَّارِ وَعَذَابِ القَبْرِ",
              "translation_urdu": "ہم نے اور ساری سلطنت نے اللہ کیلئے شام کی اور اللہ کیلئے ساری تعریفیں ہیں اور اللہ کے سوا کوئی معبود نہیں ،وہ اکیلا ہے ،اُس کا کوئی شریک نہیں ، اُسی کیلئے بادشاہت ہے اور اُسی کیلئے ساری تعریف ہے،اور وہ ہر چیز پر قدرت رکھتا ہے ،اے اللہ ! میں تجھ سے اِس رات کی اور اِس کے بعد کی خیر و بھلائی کا سوال کرتا ہوں اور میں اِس دن اور اس کے بعد کے شر سےتیری پناہ چاہتا ہوں، اور میں سستی ،بُرے بڑھاپے سےتیری پناہ چاہتاہوں اور میں جہنم کے اور قبر کے عذاب سے تیری پناہ چاہتا ہوں۔",
              "fawaid_urdu": "نبی کریم ﷺ شام کو یہ دُعاء پڑھا کرتے تھے۔(ترمذی:3390) اِسی سے ملتی جلتی ایک اور بھی دُعاء حدیث میں نقل کی گئی ہے : ” أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلّٰهِ وَالْحَمْدُ لِلّٰهِ ، كُلُّهُ لِلّٰهِ ، أَعُوذُ بِاللهِ الَّذِيْ يُمْسِكُ السَّمَاءَ أَنْ تَقَعَ عَلَى الْأَرْضِ إِلَّا بِإِذْنِهِ مِنْ شَرِّ مَا خَلَقَ وَ ذَرَأَ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ“ ترجمہ:ہم نے اور ساری سلطنت نے اللہ کیلئے شام کی اور اللہ کیلئے ساری تعریفیں ہیں،ساری کی ساری تعریفیں صرف اللہ ہی کیلئے ہیں، میں اللہ کی پناہ چاہتا ہوں جس نے آسمان کو زمین پر اپنے حکم کے بغیرگرنے سے روک رکھا ہے،اُن تمام چیزوں کے شر سے جس کو اللہ نے پیدا کیا اور پھیلایا، اور شیطان کے شر سے اور اُس کے شرک(میں مبتلاء کرنے)سے۔ فائدہ:جس نے مذکورہ کلمات شام کو تین مرتبہ کہے وہ صبح تک ہر طرح کے شیطان،کاہن اور ساحر سے محفوظ رہے گا۔(عمل الیوم و اللیلۃ لابن السنی:67)"
            },
            {
              "point_id": "azkar_jannat_ka_parwana_3_times_evening",
              "title_urdu": "اللہ کی رضا اور جنت کا پروانہ (تین مرتبہ)",
              "arabic_text": "رَضِيْتُ بِاللهِ رَبًّا وَّ بِالْإِسْلَامِ دِيْنًا وَّ بِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
              "translation_urdu": "میں اللہ کے پروردگار ہونے پر ،اِسلام کے دین ہونے پر اور حضرت محمد ﷺ کے نبی ہونے پر راضی ہوں۔",
              "fawaid_urdu": "”كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ“ اللہ تبارک و تعالیٰ نے اپنے ذمّہ لے لیا ہے کہ قیامت کے دن اُسے راضی کردیں گے۔(مسند احمد:18967) ایک روایت میں ہے”مَنْ قَالَهُنَّ دَخَلَ الْجَنَّةَ“ جس نے یہ تین کلمات کہے وہ جنّت میں داخل ہوگا۔(مسند احمد:11102) ایک اور روایت میں اِس کلمہ کو پڑھنے والے کے بارے میں فرمایا: ”ذَاقَ طَعْمَ الْإِيْمَانِ“ یعنی اُسے ایمان کا ذائقہ نصیب ہوگا۔(مسلم:34)"
            },
            {
              "point_id": "azkar_aifiyat_pooray_badan_3_times_evening",
              "title_urdu": "بدنی عافیت کی دعا اور کفروفقر سے حفاظت (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ عَافِنِيْ فِي بَدَنِيْ، اَللّٰهُمَّ عَافِنِيْ فِي سَمْعِيْ، اَللّٰهُمَّ عَافِنِيْ فِي بَصَرِيْ، لَا إِلٰهَ إِلَّا أَنْتَ اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلٰهَ إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ !میرے جسم میں عافیت نصیب فرما۔اے اللہ !میرےکانوں میں عافیت نصیب فرما۔اے اللہ !میری آنکھ میں عافیت نصیب فرما۔تیرے سوا کوئی معبود نہیں ۔اے اللہ! کفر میں مبتلاء ہونے اور فقر کا شکار ہونے سےمیں تیری پناہ چاہتا ہوں، اے اللہ! میں قبر کے عذاب سے تیری پناہ چاہتا ہوں،تیرےسوا کوئی معبود نہیں۔",
              "fawaid_urdu": "نبی کریم ﷺ صبح شام اِس دُعاء کو پڑھا کرتے تھے۔(ابوداؤد:5090)"
            },
            {
              "point_id": "azkar_islah_e_ahwaal_evening",
              "title_urdu": "تمام احوال کی اصلاح",
              "arabic_text": "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِي كُلَّهُ ، وَلَا تَكِلْنِيْ إِلىٰ نَفْسِيْ طَرَفَةَ عَيْنٍ",
              "translation_urdu": "اے وہ ذات جو سدا زندہ ہے اور ساری کائنات سنبھالے ہوئے ہے!میں تیری رحمت ہی سے فریاد طلب کرتا ہوں ،میرے تمام اَحوال کی اِصلاح فرما اور ایک پلک جھپکنے کے برابر بھی مجھے میرےنفس کے حوالہ نہ فرما۔",
              "fawaid_urdu": " نبی کریم ﷺ نے اپنی بیٹی حضرت فاطمہ (رض) کویہ کلمات سکھائے تھے اور اُنہیں اِن کلمات کو صبح شام پڑھنے کی وصیت کی تھی۔(مستدرکِ حاکم:2000) حضرت انس﷜فرماتے ہیں کہ ہم (فجر کی نماز کے بعد)نبی کریم ﷺ کے ساتھ مسجد میں تھے یہاں تک کہ سورج طلوع ہوگیا ، ہم آپ ﷺ کے ساتھ نکلے،آپ ﷺ نے حضرت فاطمہ (رض) کے پاس تشریف لے گئے تو دیکھا وہ سورہی ہیں ،آپ ﷺ نے اِرشاد فرمایا:”مَا يُنِيْمُكِ فِيْ هٰذِهِ السَّاعَةِ؟“ اِس وقت کیوں سورہی ہو؟ اُنہوں نے فرمایا: یا رسول اللہ! مجھے کل رات سے بخار ہے،آپ ﷺ نےارشاد فرمایا: وہ دُعا ء کیوں نہیں پڑھی جو میں نے سکھائی تھی ؟حضرت فاطمہ (رض) نے فرمایا : میں بھول گئی ہوں، آپ ﷺ نے اُنہیں اِن کلمات کی تلقین فرمائی ۔(طبرانی اوسط:3565) ایک روایت میں ہے کہ نبی کریم ﷺ کو جب کوئی تکلیف پیش آتی تو آپ یہ کلمہ پڑھا کرتے تھے:”يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ“ اے وہ ذات جو سدا زندہ ہے اور ساری کائنات سنبھالے ہوئے ہے!تیری رحمت ہی سے فریاد طلب کرتا ہوں ۔(ترمذی:3524)"
            },
            {
              "point_id": "azkar_sayyad_ul_istighfar_evening",
              "title_urdu": "جنت اور شہادت کا پروانہ",
              "arabic_text": "اَللّٰهُمَّ أَنْتَ رَبِّي لاَ إِلٰهَ إِلَّا أَنْتَ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ ، وَأَنَا عَلٰى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَ أَبُوْءُ لَكَ بِذَنْبِيْ فَاغْفِرْ لِيْ ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
              "translation_urdu": " اے اللہ ! آپ ہی میرے پالنہار ہیں ، آپ کے سوا کوئی عبادت کے لائق نہیں ہے۔ آپ ہی نے مجھے پیدا کیا اور میں آپ کا حقیقی غلام ہوں ، اور جہاں تک میرے بس میں ہے مَیں آپ سے کئے ہوئے عہد اور وعدے پر قائم ہوں ، آپ کی پناہ چاہتا ہوں ان تمام بُرے کاموں کے وبال سے جو مَیں نے کئے ہیں، میں آپ کے سامنے آپ کی ان نعمتوں کا اقرار کرتا ہوں جو مجھ پر ہیں ، اور مجھے اعتراف ہے اپنے گناہ کا، اس لئے میرے گناہوں کو معاف کر دیجئے، کیونکہ آپ کے سوا کوئی گناہوں کو نہیں بخشتا۔",
              "fawaid_urdu": " یہ سیّد الاِستغفار کے کلمات ہیں، جسےحدیث کے اندر صبح شام پڑھنے کی تلقین کی گئی ہے اور اِس کی فضیلت حدیث میں یہ ذکر کی گئی ہے: فائدہ: ”مَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ“ جس نے پورے یقین کے ساتھ رات کو پڑھا اورصبح ہونے سے پہلے اُس کی موت آگئی وہ اہلِ جنّت میں سے ہے۔(بخاری:6306) ایک روایت میں ہے :”إِنْ مَاتَ مِنْ لَيْلَتِهِ مَاتَ شَهِيدًا“ اِن کلمات کو کہنے والا اُس رات کو مرگیا تو شہادت کی موت مرے گا۔(عمل الیوم و اللیلۃ:43)"
            },
            {
              "point_id": "azkar_aifiyat_dunya_akhira_evening",
              "title_urdu": "ہر طرح کی عافیت کی دعا",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اَللّٰهُمَّ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِيْنِيْ وَ دُنْيَايَ وَأَهْلِي وَمَالِيْ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، وَاحْفَظْنِيْ مِنْم بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِيْنِيْ، وَعَنْ شِمَالِيْ، وَمِنْ فَوْقِيْ، وَ أَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
              "translation_urdu": "اے اللہ! میں تجھ سے دنیا و آخرت میں عفو و درگزر اور عافیت کا سوال کرتا ہوں،اے اللہ! میں تجھ سے اپنے دین ، دنیا ،اہل اور مال میں عفو و درگزر اور عافیت کا سوال کرتاہوں۔اے اللہ! میرے عیوب کی پردہ پوشی فرما،میرے خوف کو اَمن میں تبدیل فرما اور حفاظت فرمامیرے سامنےسے،میرے پیچھے سے،میرے دائیں جانب سے اور میری بائیں جانب سے اور میرے اوپر سے ، اور میں تیری عظمت کی پناہ چاہتا ہوں اِس بات سے کہ میں اپنے نیچے کی جانب سے ہلاک کیا جاؤں۔",
              "fawaid_urdu": "اِن مذکورہ کلمات کا صبح و شام اہتمام کرنا چاہیئے،حدیث میں آتا ہے:نبی کریم ﷺ صبح شام اِن کلمات کو کبھی ترک نہیں فرمایا کرتے تھے۔(ابن ماجہ:3871)"
            },
            {
              "point_id": "azkar_khalq_ke_shar_se_hifazat_evening",
              "title_urdu": "ہر قسم کے نقصان سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
              "translation_urdu": "میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں اُس کی پیدا کردہ تمام چیزوں کے شر سے۔",
              "fawaid_urdu": "اِن کلمات کے پڑھنے والے کوکوئی مُوذی چیز نہیں کاٹے گی۔(ترمذی:3604) نبی کریم ﷺکے پاس ایک شخص کو لایا گیا گیا جسے بچھو نے کاٹ لیا تھا ،آپ ﷺنے فرمایا اگر یہ مذکورہ کلمات پڑھ لیتا تو اِسے بچھو نقصان نہیں پہنچاتا ۔(ابوداؤد:3899) حدیث کے راوی حضرت سہیل بن صالح (رض) فرماتے ہیں : ہمارے گھر والوں نے یہ کلمات سیکھ لیے تھے اور روزانہ پڑھتے تھے،ایک دفعہ گھر میں کسی باندی کو بچھو نے ڈس لیا تو اِن کلمات کے پڑھنے کی برکت سے اُسے کوئی درد اور تکلیف تک نہیں ہوئی ۔(ترمذی:3604) اگر کسی جگہ اتر کر مذکورہ کلمات پڑھ لیے جائیں تو وہاں سے کُوچ کرنے تک کوئی نقصان نہیں پہنچے گا۔(الدعوات الکبیر:470)"
            },
            {
              "point_id": "azkar_seven_great_virtues_10_times_evening",
              "title_urdu": "سات عظیم فضیلتیں (دس مرتبہ)",
              "arabic_text": "لَا إِلٰهَ إِلَّا اللهُ، وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، يُحْيِيْ وَيُمِيْتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلىٰ كُلِّ شَيْءٍ قَدِيْرٌ",
              "translation_urdu": "اللہ کے سوا کوئی معبود نہیں ،وہ اکیلا ہے ،اُس کا کوئی شریک نہیں ،اُسی کیلئے بادشاہت ہےاور اُسی کیلئے تعریف ہے، ،وہی زندہ کرتا اور وہی موت دیتا ہے، اُسی کے ہاتھ میں ساری بھلائی ہے اور وہ ہر چیز پر قادر ہے۔",
              "fawaid_urdu": "جو شخص مغرب اور فجر کی نماز بعد رخ پھیرنے اور پاؤں موڑنے سے پہلے دس مرتبہ یہ کلمات پڑھ لےاُس کیلئے ہر کلمہ کے بدلہ میں دس نیکیاں لکھی جاتی ہیں ، دس گناہ مٹادیے جاتے ہیں اور دس درجے بلند کیے جاتے ہیں اور یہ کلمات اُس کیلئےہر ناپسندیدہ چیز اور شیطانِ مردود سے بچاؤ کا ذریعہ بن جاتے ہیں اور شرک کے علاوہ کسی گناہ کی مجال نہیں ہوتی کہ اُس کو ہلاک کرڈالے ، اور وہ (کلمات پڑھنے والا )لوگوں میں عمل کے اعتبار سے سب سے افضل ہوتاہے، سوائے اُس شخص کے جو اُس سے آگے بڑھ جائے یعنی اُس سے زیادہ یہ کلمات کہے۔(مسند احمد :17990) خلاصہ یہ ہے کہ اِس کلمے کو دس مرتبہ پڑھنے سے سات عظیم فضیلتیں حاصل ہوتی ہیں : (1) سو نیکیاں ۔ (2) سو گناہ معاف ۔(3) سودرجات بلند۔ (4) ہر قسم کی آفات سے حفاظت۔ (5) شیطان مردود سے حفاظت۔ (6) سوائے شرک کے کوئی گناہ اُس کو ہلاک نہ کر سکے گا ۔(7) وہ اُس دن سب سے افضل عمل کرنے والا ہوگا ۔ سوائے اُس شخص کے جو اُس سے بھی زیادہ پڑھے۔"
            },
            {
              "point_id": "azkar_jahannam_se_azadi_7_times_evening",
              "title_urdu": "جہنم سے آزادی کا پروانہ (سات مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ أَجِرْنِيْ مِنَ النَّارِ",
              "translation_urdu": "اے اللہ مجھے آگ (جہنم )سے پناہ عطاء فرما۔",
              "fawaid_urdu": " فجر اور مغرب کی نماز کے بعد سات مرتبہ اِن کلمات کا کہنے والا اُس دن اگر مرجائے تو جہنم سے بری ہوجائےگا ۔(ابواداؤد:5079)"
            },
            {
              "point_id": "azkar_shukr_of_niamat_evening",
              "title_urdu": "اللہ کی نعمتوں کا شکر",
              "arabic_text": "اَللّٰهُمَّ مَا أَمْسٰى بِيْ مِنْ نِّعْمَةٍ أَوْ بِأَحَدٍ مِّنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ ، لَا شَرِيْكَ لَكَ ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
              "translation_urdu": " اے اللہ! جو بھی نعمت میرے پاس یا تیری مخلوق میں سے کسی کے پاس بھی شام کے وقت موجود ہے تو وہ صرف تنہا تیری ہی جانب سے ہے،(اُن میں)، تیرا کوئی شریک نہیں،پس تیرے لئے ہی ساری تعریف اور شکر ہے۔",
              "fawaid_urdu": "جس نے مذکورہ کلمات صبح اور شام پڑھ لیے تو اُس کی جانب سے اُس دن اوراُس رات کا شکر اداء ہوجائے گا۔(شعب الایمان:4059)(ابوداؤد:5073)"
            },
            {
              "point_id": "azkar_maghfirat_parwana_evening",
              "title_urdu": "گناہوں کی معافی کا پروانہ",
              "arabic_text": "اَللّٰهُمَّ إِنِّيْ أَمْسَيْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَ مَلَآئِكَتَكَ وَجَمِيْعَ خَلْقِكَ ، أَنَّكَ أَنْتَ اللهُ لَا إِلٰهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ",
              "translation_urdu": " اے اللہ میں نے شام کی ،میں تجھے ،تیرے عرش کو اُٹھانے والے فرشتوں اور تمام فرشتوں کو اور تیری تمام مخلوقات کو اِس بات پر گواہ بناتا ہوں کہ بیشک تو ہی اللہ ہے ،تیرے سوا کوئی معبود نہیں ،تو اکیلا ہے،تیرا کوئی شریک نہیں ، اور (اِس بات پر گواہ بناتا ہوں کہ )حضرت محمّد ﷺ تیرے بندے اور تیرے رسُول ہیں ۔",
              "fawaid_urdu": " ”غُفِرَ لَهُ مَا أَصَابَ تِلْكَ اللَّيْلَةَ“ اِن کلمات کے پڑھنے والے کےاُس رات کے گناہ معاف ہوجائیں گے۔(ابواداؤد:5078) ”أَعْتَقَ اللهُ رُبُعَهُ مِنَ النَّارِ“ایک دفعہ کہنے پر چوتھائی جسم جہنم سے آزاد ہوجائے گا، اور چار مرتبہ کہنے سے مکمل جسم آزاد ہوجائے گا ۔(ابواداؤد:5069)"
            },
            {
              "point_id": "azkar_most_virtuous_100_times_evening",
              "title_urdu": "سب سے افضل عمل (سو مرتبہ)",
              "arabic_text": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
              "translation_urdu": " اللہ پاک ہے اور اسی کی تعریف ہے۔",
              "fawaid_urdu": "محمد بن عبدالملک اموی عبدالعزیز بن مختار سہیل بن سمی ابوصالح حضرت ابوہریرہ (رض) سے روایت ہے کہ رسول اللہ ﷺ نے ارشاد فرمایا جو آدمی صبح و شام سو مرتبہ (یہ دعا) پڑھتا ہے قیامت کے دن کوئی اس سے زیادہ افضل عمل نہیں لاسکتا سوائے اس کے جس نے اس کے برابر یا اس سے زیادہ پڑھا ہو۔ (صحیح مسلم 6843)"
            },
            {
              "point_id": "azkar_itmaam_e_niamat_3_times_evening",
              "title_urdu": "اللہ کی نعمتوں کی تکمیل (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَمْسَيْتُ مِنْكَ فِي نِعْمَةٍ وَّعَافِيَةٍ وَّسِتْرٍ، فَأَتِمَّ عَلَيَّ نِعْمَتَكَ وَ عَافِيَتَكَ وَ سِتْرَكَ فِي الدُّنْيَا وَالْآخِرَةِ",
              "translation_urdu": " اے اللہ ! میں نے تیری جانب سے نعمت،عافیت اورپردہ پوشی کی حالت میں شام کی ، پس تو مجھ پر اپنی نعمت،عافیت اور پردہ پوشی کو دنیا و آخرت میں مکمل فرما۔",
              "fawaid_urdu": "شام کو تین مرتبہ پڑھنے والے کے بارے میں آپ ﷺ نے اِرشاد فرمایا: ”كَانَ حَقًّا عَلَى اللهِ عَزَّ وَجَلَّ أَنْ يُتِمَّ عَلَيْهِ نِعْمَتَهُ“ اللہ نے اپنے ذمّہ لازم کیا ہے کہ اُس کے اوپر اپنی نعمتیں مکمل فرمادیں گے۔(ابن سنی:55)"
            },
            {
              "point_id": "azkar_best_rizq_evening",
              "title_urdu": "بہترین رزق کی دعا",
              "arabic_text": "مَا شَاءَ اللهُ ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ ، أَشْهَدُ أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
              "translation_urdu": " اللہ جو چاہے،گناہوں سے بچنے کی طاقت اور نیک کام کرنے کی قوّت صرف اللہ تعالیٰ ہی کی جانب سے ہے، میں گواہی دیتا ہوں کہ اللہ چیز پر قدرت رکھنے والا ہے۔",
              "fawaid_urdu": " شام کے وقت مذکورہ کلمات پڑھنے والے کے بارے میں آپ ﷺ نے اِرشاد فرمایا:”رُزِقَ خَيْرَ تِلْكَ اللَّيْلَةِ وَصُرِفَ عَنْهُ شَرُّهَا“ یعنی اُسے اُس رات کا بہترین رزق عطاء کیا جائے گا اور اُس رات کے شرکو اُس سے دور کردیا جائےگا ۔(عمل الیوم و اللیلۃ لابن السنی:53)"
            },
            {
              "point_id": "azkar_maghfirat_ka_parwana_evening",
              "title_urdu": "مغفرت کا پروانہ",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ رَبِّيْ لَا أُشْرِكُ بِهِ شَيْئًا، وَأَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا اللهُ",
              "translation_urdu": "تمام تعریفیں اللہ ہی کیلئے ہیں جو میرا پروردگار ہے،میں اُس کے ساتھ کسی بھی چیز کو شریک نہیں ٹہراتا، اور میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں ہے۔",
              "fawaid_urdu": " مذکورہ کلمات شام کے وقت میں پڑھنے والے کے بارے میں آپ ﷺ نے اِرشاد فرمایا: ”بَاتَ يُغْفَرُ لَهُ ذُنُوبُهُ حَتَّى يُصْبِحَ“ یعنی وہ صبح ہونے تک رات بھر اِس حالت میں گزارتا ہے کہ اُس کی مغفرت کردی جاتی ہے۔(طبرانی کبیر:635)"
            },
            {
              "point_id": "azkar_hifazat_nazar_e_bad_evening",
              "title_urdu": "نظرِ بد سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَّهَامَّةٍ، وَّمِنْ كُلِّ عَيْنٍ لَّامَّةٍ",
              "translation_urdu": "میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں ہر شیطان اور ڈسنے والے جانور سے اور ہر ملامت کرنے والی آنکھ سے۔",
              "fawaid_urdu": "مذکورہ کلمات نظرِ بد سے حفاظت کیلئے بہترین کلمات ہیں ،نبی کریم ﷺ حضرت حسن و حُسین (رض) کو مذکورہ کلمات کے ذریعہ اللہ تعالیٰ کی پناہ میں دیتے تھے، اور فرماتے تھے کہ حضرت ابراہیم علیہ السلام بھی اپنے بیٹوں حضرت اسحاق اور حضرت اِسماعیل علیہ السلام کو اِنہی کلمات کے ذریعہ اللہ کی پناہ میں دیتے تھے۔(بخاری:3371)"
            },
            {
              "point_id": "azkar_hifazat_khauf_ghabrahat_evening",
              "title_urdu": "خوف و گھبراہٹ سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ ، وَمِنْ هَمَزَاتِ الشَّيَاطِيْنِ وَ أَنْ يَّحْضُرُونِ",
              "translation_urdu": " میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں اُس کے غضب وغصہ سےاوراس کے عذاب سے اور اس کےبندوں کے شرسے اورشیاطین کے وسوسوں سےاور اے میرے پروردگار میں تیری پناہ چاہتا ہوں اس سےکہ وہ (شیطان) میرےپاس بھی آئیں۔",
              "fawaid_urdu": " مذکورہ کلمات خوف و گھبراہٹ سے حفاظت اور اُس کیفیت کو دور کرنے کیلئے بڑے مفید اور بہترین ہیں ،نبی کریم ﷺ خوف و گھبراہٹ کی حالت میں اور بالخصوص نیند میں ڈرجانے اور خوف و گھبراہٹ کا شکار ہوجانے کی صورت میں اِن کلمات کو پڑھنے کی تلقین فرمایا کرتے تھے۔(ابوداؤد: 3893)(ترمذی:3528) حضرت عبد اللہ بن عمرو بن العاص (رض) کے بارے میں آتا ہے کہ وہ اپنی بالغ اولاد کو اِن کلمات کے پڑھنے کی تلقین فرمایا کرتے تھے اور نابالغ کم سِن اولاد کے گلے میں یہ کلمات لکھ کر ڈال دیا کرتے تھے۔(ترمذی:3528)"
            },
            {
              "point_id": "azkar_hifazat_shaitain_jinnat_evening",
              "title_urdu": "شیاطین و جنات سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ وَّ لَا فَاجِرٌ مِنْ شَرِّ مَا خَلَقَ، وَ ذَرَأَ وَ بَرَأَ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ ، وَمِنْ شَرِّ مَا يَعْرُجُ فِيهَا، وَمِنْ شَرِّ مَا ذَرَأَ فِي الْأَرْضِ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقًا يَّطْرُقُ بِخَيْرٍ، يَّا رَحْمٰنُ",
              "translation_urdu": " میں اللہ تعالیٰ کے تمام کلمات (یعنی اَسماء و صفات) کی پناہ میں آتا ہوں جن سے نہ کوئی نیک آگے بڑھ سکتا ہے نہ گناہ گار، ہراُس چیزکےشرسےجس کو اللہ نے پیدا کیا ، پھیلایا اور وجود دیا،اور ہر اُس چیز کے شر سے جوآسمان سے اترتی ہےاورجوآسمان پرچڑھتی ہےاورہر اس چیزکےشرسےجوزمین کےاندرپیداہوتی ہےاورجوزمین سے (پھوٹ کر) نکلتی ہےاوررات دن کےفتنوں کےشر سے اور رات دن کے (ناگہانی) واقعات اورحادثوں کےشرسے،بجز اس اچھے واقعہ کےجوخیر کولائے (کہ وہ تو سراسر رحمت ہے) اے بہت رحم کرنے والے۔",
              "fawaid_urdu": "حضرت جبریل علیہ السلام نےشیاطین و جنّات کے نقصان سے بچنے کیلئے مذکورہ کلمات نبی کریم ﷺ کو سکھائے تھے۔(مسند احمد:15461)"
            },
            {
              "point_id": "azkar_hifazat_jadoo_sehar_evening",
              "title_urdu": "جادو اور سحر سے حفاظت",
              "arabic_text": "أَعُوذُ بِوَجْهِ اللهِ الْعَظِيْمِ الَّذِيْ لَيْسَ شَيْءٌ أَعْظَمَ مِنْهُ ، وَ بِكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِيْ لاَ يُجَاوِزُهُنَّ بَرٌّ وَّ لاَ فَاجِرٌ، وَ بِأَسْمَاءِ اللهِ الْحُسْنٰى كُلِّهَا مَا عَلِمْتُ مِنْهَا وَمَا لَمْ أَعْلَمْ، مِنْ شَرِّ مَا خَلَقَ وَ ذَرَأَ وَ بَرَأَ",
              "translation_urdu": "میں اللہ عظیم کی پناہ میں آتا ہوں جس سے کوئی چیز بڑی نہیں ، اور اُس کےتمام کلمات(یعنی اَسماء و صفات) کی پناہ میں آتا ہوں جن سے نہ کوئی نیک بچ سکتا ہے نہ بد، اور اللہ تعالیٰ کےتمام بہترین ناموں کی(پناہ میں آتا ہوں) جن کو میں جانتا ہوں اور جن کو میں نہیں جانتا، ہراُس چیزکےشرسےجس کو اللہ نے پیدا کیا ،پھیلایا اور وجود دیا۔",
              "fawaid_urdu": " مذکورہ کلمات جادو اور سحر کے اَثرات سے بچنے کیلئے بہت ہی مفید اور بہترین کلمات ہیں۔ حضرت کعب اَحبار (رض) اِن کلمات کو پڑھتے اور فرماتے تھے: ”لَوْلاَ كَلِمَاتٌ أَقُولُهُنَّ لَجَعَلَتْنِي يَهُودُ حِمَارًا“ اگر میں اِن مذکورہ کلمات کو نہ پڑھتا تو یہود(جادو کے ذریعہ) مجھے گدھا بنادیتے۔(مؤطا مالک:2002)"
            },
            {
              "point_id": "azkar_hifazat_shirk_3_times_evening",
              "title_urdu": "شرک سے حفاظت (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
              "translation_urdu": " اے اللہ میں تیری پناہ میں آتا ہوں اِس سے کہ میں جانتے بوجھتے ہوئے تیرے ساتھ کسی کو شریک ٹہراؤں اور میں تجھ سے مغفرت چاہتاہوں اُس (شرک) سے جس کو میں نہیں جانتا۔",
              "fawaid_urdu": " اِس اُمّت کے اندر چیونٹی کی آہٹ سے بھی زیادہ مخفی اور پوشیدہ شرک رکھا گیا ہے، اور اُس چھوٹے بڑے تمام طرح کے شرک سے بچنے کیلئے نبی کریم ﷺ نے مذکورہ کلمات تین مرتبہ روزانہ پڑھنے کی تلقین فرمائی ہے۔(مسند ابویعلیٰ موصلی:58)"
            },
            {
              "point_id": "azkar_hifazat_shaitaan_samee_ul_aleem_3_times_evening",
              "title_urdu": "شیطان سے حفاظت (تین مرتبہ)",
              "arabic_text": "أَعُوْذُ بِاللهِ السَّمِيْعِ العَلِيْمِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
              "translation_urdu": " میں شیطان مَردود سےاللہ تعالیٰ کی پناہ میں آتا ہوں جو سننے اور جاننے والا ہے ۔",
              "fawaid_urdu": "حدیث کے مطابق مذکورہ تعوّذ صبح کو پڑھنے والا شام تک شیطان سے محفوظ ہوجاتا ہے۔(عمل الیوم و اللیلۃ لابن السنی:49) اور اگر تعوّذ کے اِنہی کلمات کو تین مرتبہ پڑھنے کےبعد سورۃ الحشر کی آخری تین آیات یعنی ”هُوَ اللهُ الَّذِيْ لَا إِلٰهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ“ سے سورت کے آخر تک پڑھ لی جائیں تو حدیث کے مطابق اگر صبح کے وقت پڑھا تو شام تک ستر ہزار فرشتے اُس کیلئے رحمت کی دُعاء کرتے رہتے ہیں اور اگر وہ اُس دن مرجائے تو شہادت کی موت مرتا ہے۔(ترمذی:2922)"
            },
            {
              "point_id": "azkar_hifazat_masaib_evening",
              "title_urdu": "مصائب و حوادث سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ أَنْتَ رَبِّي، لَا إِلٰهَ إِلَّا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْكَرِيمِ، مَا شَاءَ اللهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، أَعْلَمُ أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ، وَأَنَّ اللهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا ، اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا إِنَّ رَبِّي عَلٰى صِرَاطٍ مُّسْتَقِيمٍ",
              "translation_urdu": "اے اللہ!تو میرا پروردگارہے،تیرے سوا کوئی معبود نہیں ،میں نے تجھ ہی پر بھروسہ کیا اور تو بزرگی والے عرش کا ربّ ہے،جو اللہ نے چاہا وہ ہوگیا اور جو نہیں چاہا نہیں ہوا،گناہوں سے بچنے کی طاقت اور نیک کام کرنے کی قوّت صرف اللہ ہی کی جانب سے ہے جو عظمت والا بلند و برتر ہے۔میں جانتا ہوں کہ اللہ ہر چیز پر قدرت رکھتا ہےاور بیشک اللہ تعالیٰ نے علم کے اعتبار سے ہر چیز کا اِحاطہ کررکھا ہے۔اے اللہ میں آپ کی پناہ چاہتا ہوں اپنے نفس کے شر سے اور ہر اُس زمین پر چلنے والے جاندار کے شرّ سے جس کی پیشانی آپ کے قبضہ میں ہے، بیشک میرا ربّ سیدھی راہ پر ہے۔",
              "fawaid_urdu": " یہ دُعاءِ ابی درداء کے کلمات ہیں، جو مصائب و حوادث سے حفاظت کیلئے ایک بہترین دُعاء ہے ،صبح شام اِس کے پڑھنے کا اہتمام کرنا چاہیئے ،حدیث کے مطابق یہ کلمات اگر کوئی شام کے وقت پڑھ لے تو ”لَمْ تُصِبْهُ مُصِيْبَةٌ حَتَّى يُصْبِحَ“ یعنی صبح ہونے تک اُسے کوئی مصیبت نہ پہنچی گی۔(الدعاء للطبرانی:343) (ابن السنی:57)"
            },
            {
              "point_id": "azkar_hifazat_gham_o_fikr_evening",
              "title_urdu": "غم اور فکر سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ رَبَّ السَّمٰوَاتِ السَّبْعِ وَ رَبَّ الْعَرْشِ الْعَظِيمِ، اِكْفِنِيْ كُلَّ مُهِمٍّ مِّنْ حَيْثُ شِئْتَ ، وَ كَيْفَ شِئْتَ، وَ مِنْ أَيْنَ شِئْتَ. حَسْبِيَ اللهُ لِدِيْنِيْ، حَسْبِيَ اللهُ لِدُنْيَايَ حَسْبِيَ اللهُ لِمَا أَهَمَّنِيْ، حَسْبِيَ اللهُ لِمَنْ بَغٰى عَلَيَّ، حَسْبِيَ اللهُ لِمَنْ حَسَدَنِيْ حَسْبِيَ اللهُ لِمَنْ كَادَنِيْ بِسُوْءٍ، حَسْبِيَ اللهُ عِنْدَ الْمَوْتِ، حَسْبِيَ اللهُ عِنْدَ الْمَسْأَلَةِ فِي الْقَبْرِ، حَسْبِيَ اللهُ عِنْدَ الْمِيْزَانِ، حَسْبِيَ اللهُ عِنْدَ الصِّرَاطِ، حَسْبِيَ اللهُ لَا إِلٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
              "translation_urdu": "اے اللہ !اے ساتوں آسمانوں اور عظیم عرش کے پروردگار!میرے ہر اہم کام کیلئے کافی ہوجاجس طرح تو چاہے،جس جگہ سے تو چاہے اورجہاں کہیں تو چاہے۔ اللہ میرے دین کیلئے کافی ہے، اللہ میری دنیاکیلئے کافی ہے،اللہ میری فکروں کیلئے کافی ہے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو مجھ پر زیادتی کرے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو مجھ سے حسد کرے،اللہ میری جانب سے اُس شخص کیلئے کافی ہے جو میرے خلاف بُری چال چلے،اللہ میرے لئے کافی ہے موت کے وقت،اللہ میرے لئے کافی ہےقبر میں(مُنکَر نکیر کے) سوال کے وقت،اللہ میرے لئے کافی ہےنامہ عمل تُلنے کے وقت،اللہ میرے لئے کافی ہےپُل صِراط(پر سے گزرنے)کے وقت، اللہ میرے لئے کافی ہے،اُس کے سوا کوئی معبود نہیں ،اُسی پر میں نے بھروسہ کیا اور وہ عرشِ عظیم کا مالک ہے۔",
              "fawaid_urdu": "اِس دُعاء کےابتدائی کلمات یعنی ”وَ مِنْ أَيْنَ شِئْتَ“ تک کے الفاظ کے بارے میں حدیث میں یہ فضیلت ذکر کی گئی ہے کہ جو یہ کلمات پڑھ لے اللہ تبارک و تعالیٰ اُس کے غم اور فکر کو دور کردیتے ہیں۔(مکارم الاخلاق للخرائطی:1037) اور”حَسْبِيَ اللهُ“سے آگے کےکلمات کی فضیلت حدیث میں یہ ذکر کی گئی ہےکہ: جو شخص نمازوں کے بالخصوص فجر کی نماز کے بعد مذکورہ کلمات پڑھ لے تو اللہ تبارک و تعالیٰ اُس کیلئے دنیا و آخرت کے وہ تمام مراحل جو اِس دُعاء میں ذکر کیے گئے ہیں اُن میں کافی ہوجاتے ہیں۔(نوادرالأصول ،حکیم ترمذی:2/274) (الدر المنثور:2/390)"
            },
            {
              "point_id": "azkar_hifazat_aafat",
              "title_urdu": "آفات سے حفاظت",
              "arabic_text": "بِسْمِ اللهِ عَلٰى نَفْسِيْ وَدِيْنْي بِسْمِ اللهِ عَلٰى اَهْلِيْ وَ مَالِيْ وَ وَلَدِيْ بِسْمِ اللهِ عَلٰى مَا اَعطَانِيْ، اَللهُ اَللهُ رَبِّيْ لَا اُشْرِكُ بِهِ شَيْئاً اَللهُ أَكْبَرُ اَللهُ أَكْبَرُ اَللهُ أَكْبَرُ وَ أَعَزُّ وَ أَجَلُّ مِمَّا أَخَافُ وَ أَحْذَرُ عَزَّ جَارُكَ وَ جَلَّ ثَنَاؤُكَ وَ لَا اِلٰهَ غَيْرُكَ اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِيْ وَ مِنْ شَرِّ كُلِّ شَيْطَانٍ مَّرِيْدٍ وَ مِنْ شَرِّ كُلِّ جَبّارٍ عَنِيْدٍ ، فَإِنْ تَوَلَّوْا فَقُلْ حَسْبِيَ اللهُ لَا إِلٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ إِنَّ وَلِيِّيَ اللهُ الَّذِيْ نَزَّلَ الْكِتَابَ وَهُوَ يَتَوَلَّى الصَّالِحِيْنَ",
              "translation_urdu": "اللہ تعالیٰ کے نام کے ساتھ میری جان اور دین کی حفاظت ہے،اللہ تعالیٰ ہی کے نام سے میرے اہل و مال اور اولاد کی حفاظت ہے،اللہ تعالیٰ ہی کے نام اُن سب نعمتوں کی حفاظت ہےجو میرے پروردگار نے مجھے عطاء فرمائی ہوئی ہیں ،اللہ تعالیٰ ہی میرا پروردگار ہے،میں اُس کے ساتھ کسی بھی چیز کو شریک نہیں کرتا ۔اللہ تعالیٰ سب سے بڑا ہے،اللہ تعالیٰ سب سے بڑا ہے،اللہ تعالیٰ سب سے بڑا ہے،اللہ تعالیٰ ہر اُس چیز پر غالب اور بلند مرتبہ ہےجس سے میں خوف کھاتا اور ڈرتا ہوں۔آپ کا پناہ دیا ہو امعزّز ہے اور آپ کی تعریف بلند ہے،آپ کے سوا کوئی معبود نہیں ۔ اے اللہ! میں آپ کی پناہ لیتا ہوں اپنے نفس کے شر سے ،اور سرکش شیطان کے شر سے اور ہر ظالم ،ضدی کے شر سے ۔پھر بھی اگر یہ لوگ منہ موڑیں تو (اے رسول!ان سے )کہہ دو کہ میرے لیے اللہ ہی کافی ہے،اس کے سوا کوئی معبود نہیں ،اُسی پر میں نے بھروسہ کیا ہے اور وہی عرشِ عظیم کا مالک ہے۔بےشک میرا پروردگار اللہ تعالیٰ ہےجس نے کتاب کو اُتارا اور وہی نیک لوگوں کا مددگار ہے۔",
              "fawaid_urdu": "یہ حفاظت کی ایک بہترین دُعاء ہےجس میں بہت ہی جامع اور خوبصورت انداز میں حفاظت کی دعائیں جمع کی گئی ہیں ، اور اس کا کچھ حصہ روایات میں بھی ہے ، مثلاً حدیث میں ہے :کسی شخص نےآپ ﷺ سے اپنے اوپر پیش آنے والی آفات کا تذکرہ کیا تو آپ ﷺ نے فرمایا کہ صبح کے وقت میں یہ کلمات:”بِسْمِ اللهِ عَلٰى نَفْسِي وَأَهْلِي وَمَالِي“پڑھ لیا کرو،اُس شخص نے اِن کلمات کا اہتمام کیا تو اُس کی آفات دور ہوگئیں۔(ابن سنی:51) اوریہی وہ کلمات ہیں جو نبی کریم ﷺ نےمعیشت کے تنگ ہونے پر گھر سے نکلتے ہوئے پڑھنے کی تعلیم دی ہے۔(ابن سنی:350) اس کے علاوہ دُعاء میں مذکورہ کلمات”اَللهُ اللهُ رَبِّيْ لَا اُشْرِكُ بِهِ شَيْئاً“ وہ مبارک کلمات ہیں جن کو نبی کریم ﷺ نےحضرت اَسماء بنت عُمیس (رض) کو مصیبت و پریشانی کے موقع پر پڑھنے کی تلقین فرمائی تھی۔(ابوداؤد:1525)"
            },
            {
              "point_id": "azkar_safe_till_morning",
              "title_urdu": "صبح تک مامون و محفوظ",
              "arabic_text": "رَبِّيَ اللهُ الَّذِيْ لَا إِلٰهَ إِلَّا هُوَ الْعَلِيُّ الْعَظِيْمُ، تَوَكَّلْتُ عَلَى اللهِ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ، مَا شَاءَ اللهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، أَعْلَمُ أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ وَّ أَنَّ اللهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا",
              "translation_urdu": "میرا پروردگار اللہ ہے،جس کے سوا کوئی معبود نہیں ،وہ بلند و برتر اور عظمت والا ہے،اللہ پر ہی میں نے بھروسہ کیا اور وہ عرشِ عظیم کا مالک ہے،جو اللہ نے چاہا وہ ہوا اور جو اُس نے نہیں چاہا وہ نہیں ہوا،میں جانتا ہوں کہ اللہ ہرچیز پر قادر ہے،اور یہ کہ اللہ تعالیٰ نے ہر چیز کا علم کے اعتبار سے اِحاطہ کررکھا ہے۔",
              "fawaid_urdu": "اِن کلمات کی فضیلت یہ ذکر کی گئی ہے کہ اِن کو صبح شام کہنے والا اُس دن مرجائے تو جنّت میں داخل ہوگا۔(عمل الیوم و اللیلۃ لابن السنی:42) اِسی سے ملتے جلتے الفاظ پر مشتمل ایک اور بھی دُعاء حدیث میں ذکر کی گئی ہے ،اُسے بھی پڑھ لینا چاہیئے: ”سُبْحَانَ اللهِ وَبِحَمْدِهِ، وَلَا قُوَّةَ إِلَّا بِاللهِ ، مَا شَاءَ اللهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، أَعْلَمُ أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ، وَّ أَنَّ اللهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا“ ترجمہ:اللہ کی ذات پاک ہےاور تمام تعریفیں اُسی کیلئے ہے،اور قوّت صرف اللہ ہی کی جانب سے ہے،جو اللہ نے چاہا وہ ہوگیا اور جو اُس نے نہیں چاہا وہ نہیں ہوا،میں جانتا ہوں کہ اللہ ہرچیز پر قادر ہے،اور یہ کہ اللہ تعالیٰ نے ہر چیز کا علم کے اعتبار سے اِحاطہ کررکھا ہے۔ فائدہ:”مَنْ قَالَهُنَّ حِينَ يُمْسِيَ،حُفِظَ حَتَّى يُصْبِحَ“ اِن کلمات کوشام کو کہنے والا صبح تک محفوظ و مأمون رہتا ہے۔(سنن کبریٰ نسائی:9756)"
            },
            {
              "point_id": "azkar_jannat_parwana_3_times_evening_2",
              "title_urdu": "جنت کا پروانہ (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ لَكَ الْحَمْدُ لَا إِلٰهَ إِلَّا أَنْتَ ، أَنْتَ رَبِّي ، وَ أَنَا عَبْدُكَ ، آمَنْتُ بِكَ مُخْلِصًا لَّكَ دِيْنِيْ ، أَمْسَيْتُ عَلٰى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ ، أَتُوبُ إِلَيْكَ مِنْ شَرِّ عَمَلِي، وَأَسْتَغْفِرُكَ لِذُنُوبِيْ الَّتِي لَا يَغْفِرُهَا إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ! تیرے لئے ہی ساری تعریفیں ہیں ،تیرے سوا کوئی معبود نہیں ،تو میرا ربّ اور میں تیرا بندہ ہوں،میں تجھ پر اپنے دین کو خالص کرتے ہوئے ایمان لایا ،میں نے اپنی اِستطاعت کے مطابق تیرے عہد اور وعدہ کے(پورا کرنے کے) ساتھ شام کی ، میں تیری جانب رجوع کرتا ہوں اپنے عمل کے شر سے اور تجھ سے اپنے گناہوں کی معافی مانگتا ہوں، وہ تمام گناہ جو تیرے سوا کوئی معاف نہیں کرسکتا ۔",
              "fawaid_urdu": " حضرت ابوامامہ (رض) فرماتے ہیں کہ نبی کریم ﷺ کایہ اِرشاد نقل فرماتے ہیں:جس نے یہ مذکورہ بالا کلمات شام کے وقت تین مرتبہ پڑھے ،پھر اُس رات میں انتقال کرجائے تو وہ ضرور جنّت میں داخل ہوگا۔راوی کہتے ہیں کہ آپ ﷺ جتنا اِس پر قسم کھاتے تھے اِتنا کسی اور چیز پر قسم نہ کھاتے ، اور آپ ﷺ قسم کھاکر یہ فرماتے تھے :”وَإِنْ قَالَهَا حِينَ يُمْسِي فَتُوُفِّيَ فِي تِلْكَ اللَّيْلَةِ دَخَلَ الْجَنَّةَ“ اللہ کی قسم! اگر کوئی بندہ شام کے وقت یہ کلمات پڑھے اور پھر اُسی رات انتقال کرجائے تو وہ جنّت میں داخل ہوگا۔(طبرانی اوسط:3096)"
            },
            {
              "point_id": "azkar_hifazat_khalq_se_evening_2",
              "title_urdu": "ساری مخلوقات کے شر سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ رَبَّ السَّمٰوَاتِ السَّبْعِ وَمَا أَظَلَّتْ ، وَرَبَّ الْأَرْضِيْنَ وَمَا أَقَلَّتْ ، وَرَبَّ الشَّيَاطِيْنِ وَمَا أَضَلَّتْ ، كُنْ لِّي جَارًا مِّنْ شَرِّ خَلْقِكَ كُلِّهِمْ جَمِيْعًا أَنْ يَّفْرُطَ عَلَيَّ أَحَدٌ مِّنْهُمْ أَوْ أَنْ يَّبْغِيَ ، عَزَّ جَارُكَ ، وَ جَلَّ ثَنَاؤُكَ ، وَ لَا إِلٰهَ غَيْرُكَ ، وَ لَا إِلٰهَ إِلَّا أَنْتَ",
              "translation_urdu": "اے اللہ! اے ساتوں آسمانوں اُن تمام چیزوں کے پروردگار جن پر وہ آسمان سایہ فگن ہیں ،اور اے زمینوں اور اُن تمام چیزوں کے پروردگار جنہیں اُن زمینوں نے اُٹھایا ہوا ہے، اور اے شیطانوں اور اُن تمام چیزوں کے پروردگار جنہیں اُن شیاطین نے گمراہ کیا ہے،تو مجھے اپنی ساری کی ساری مخلوقات کے شر سے پناہ دیدے اِس بات سے کہ اُن میں سے کوئی مجھ زیادتی یا ظلم کرے ،تیری پناہ غالب ہے،تیری تعریف بہت بڑی ہے اور تیرے علاوہ کوئی معبود نہیں اور معبود صرف توہی ہے ۔",
              "fawaid_urdu": "یہ دُعاء نبی کریم ﷺ نے بستر پر جاتے ہوئے سونے سے پہلے پڑھنے کی تعلیم دی ہے۔ (ترمذی:3523)اور حفاظت کےاعتبار سے اِس کا معنی اتنا خوبصورت اور بہترین ہےکہ اگر صبح اور شام بھی یہ دُعاء پڑھ لی جائے تو بہت ہی خوب ہے۔"
            },
            {
              "point_id": "azkar_talafi_mamoolat_surah_room_evening",
              "title_urdu": "تمام معمولات کی تلافی",
              "arabic_text": "فَسُبْحَانَ اللهِ حِيْنَ تُمْسُوْنَ وَ حِيْنَ تُصْبِحُوْنَ وَ لَهُ الْحَمْدُ فِي السَّمٰوَاتِ وَ الْأَرْضِ وَ عَشِيًّا وَّ حِيْنَ تُظْهِرُوْنَ يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَ يُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَ يُحْيِ الْأَرْضَ بَعْدَ مَوْتِهَا وَكَذٰلِكَ تُخْرَجُونَ“۔(سورۃ الرّوم:17 ،18 ،19)",
              "translation_urdu": "لہٰذا اللہ کی تسبیح بیان کرواُس وقت بھی جب تمہارے پاس شام آتی ہے اور اُس وقت بھی جب پر صبح طلوع ہوتی ہے اور اُسی کی حمد ہوتی ہے آسمانوں میں بھی اور زمین میں بھی اور سورج ڈھلنے کے وقت بھی(اُس کی تسبیح کرو) اور اُس وقت بھیجب تم ظہر کا وقت آتا ہے۔وہ جاندار کو بے جان سے نکال لاتا ہےاور بے جان کو جاندار سے نکال لاتا ہے اوہ وہ زمین کو اُس کے مردہ ہوجانےکے بعد زندگی بخشتا ہے اور اِسی تم کو (قبروں سے)نکال لیا جائےگا۔",
              "fawaid_urdu": "مذکورہ تینوں آیات کے پڑھنے کی حدیث میں یہ فضیلت یہ ذکر کی گئی ہےکہ ”أَدْرَكَ مَا فَاتَهُ فِي يَوْمِهِ ذَلِكَ “یعنی اُس دن کے چھوٹے ہوئے تمام معمولات کی تلافی ہوجائے گی۔(ابوداؤد:5076)"
            },
            {
              "point_id": "azkar_less_time_more_ajr_evening",
              "title_urdu": "کم وقت میں زیادہ اجر",
              "arabic_text": "سُبْحَانَ اللهِ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ، وَ سُبْحَانَ اللهِ عَدَدَ مَا خَلَقَ فِي الأَرْضِ، وَ سُبْحَانَ اللهِ عَدَدَ مَا بَيْنَ ذٰلِكَ، وَ سُبْحَانَ اللهِ عَدَدَ مَا هُوَ خَالِقٌ، وَاللهُ أَكْبَرُ مِثْلَ ذٰلِكَ، وَالْحَمْدُ لِلّٰهِ مِثْلَ ذٰلِكَ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ مِثْلَ ذٰلِكَ",
              "translation_urdu": "اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابرجو اُس نے آسمان میں پیدا کی ،اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابرجو اُس نے زمین میں پیدا کی ،اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابر جو آسمان و زمین کے درمیان پیدا کی ،اللہ کیلئے تسبیح ہےاُن تمام مخلوقات کی تعداد کے برابر جو وہ( اَزل سے اَبد تک)پیدا کرنے والا ہے، اور ”اَللهُ أَكْبَر“بھی اِسی طرح ہے،”اَلْحَمْدُ لِلَّهِ“ بھی اِسی طرح ہے اور ”لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ“بھی اِسی طرح ہے۔",
              "fawaid_urdu": " مذکورہ بالا کلمات مختصر لیکن بہت ہی جامع کلمات ہیں ،اِن کلمات میں اللہ تبارک و تعالیٰ کی بہت ہی خوبصورت اَنداز میں تسبیح و تقدیس کی گئی ہے ،حدیث میں ہے ،نبی کریم ﷺ ایک دفعہ کسی خاتون کے پاس سے گزرے جن کے سامنے گٹھلیاں یا کنکر پڑے ہوئے تھے جن پر وہ تسبیح پڑھ رہی تھیں،آپ ﷺ نے اِرشاد فرمایا کہ کیا میں تمہیں اِس سے زیادہ آسان اور افضل عمل نہ بتاؤں؟ پھر آپ ﷺ نے اِنہی مذکورہ کلمات کی تلقین فرمائی۔(ترمذی:3568)لہٰذا بہتر ہے کہ صبح شام اِن مبارک کلمات کو بھی پڑھ لیا جائے تاکہ کم وقت میں زیادہ اجرو ثواب کو جمع کیا جاسکے۔"
            }
          ]
        },
        {
          "id": "night_adhkar_part_5",
          "original_section_number": 5,
          "title_urdu": "رات کے مسنون اَذکار",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "azkar_afiyat_ka_sawal",
              "title_urdu": "عافیت کا سوال",
              "arabic_text": "اَللّٰهُمَّ خَلَقْتَ نَفْسِيْ وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ",
              "translation_urdu": "اے اللہ! آپ ہی نے میری ذات کو پیدا کیا ہے اور آپ ہی اُس کو وَفات دیں گے،آپ ہی کے قبضہ میں اُس کی موت اور زندگی ہے،(اے اللہ!)اگر آپ اُسے زندہ رکھیں تو اُس کی حفاظت کیجئے گا اور اگر اُسے موت دیدیں تو اُسے معاف کردیجئے گا اے اللہ! میں آپ سے عافیت کا سوال کرتا ہوں۔ (مسلم:2712)",
              "fawaid_urdu": ""
            },
            {
              "point_id": "azkar_ism_se_maut_aur_zindagi",
              "title_urdu": "اللہ کے نام سے زندگی اور موت",
              "arabic_text": "اَللّٰهُمَّ بِاسْمِكَ أَمُوْتُ وَأَحْيَا",
              "translation_urdu": "اے اللہ! میں آپ ہی کے نام سےمرتا اور زندہ ہوتا ہوں۔ (بخاری:6314)",
              "fawaid_urdu": ""
            },
            {
              "point_id": "azkar_shukr_of_kafa_and_aawa",
              "title_urdu": "اللہ کا شکر",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا وَآوَانَا، فَكَمْ مِّمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ",
              "translation_urdu": "تمام تعریفیں اللہ کیلئے ہیں جس نے ہمیں کھلایا ،پلایا ،ہمیں کفایت بخشی اور ہمیں ٹھکانا دیا ، پس کتنے ہی ایسے ہیں جن کیلئے کوئی کفایت کرنے والا اور کوئی اُنہیں ٹھکانا دینے والا نہیں ۔ (مسلم:2715)",
              "fawaid_urdu": ""
            },
            {
              "point_id": "azkar_maut_ala_alfitrah",
              "title_urdu": "فطرتِ اسلام پر موت",
              "arabic_text": "اَللّٰهُمَّ أَسْلَمْتُ نَفْسِيْ إِلَيْكَ، وَوَجَّهْتُ وَجْهِيْ إِلَيْكَ، وَفَوَّضْتُ أَمْرِيْ إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِيْ إِلَيْكَ، رَغْبَةً وَّرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِيْ أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
              "translation_urdu": "اے اللہ! میں نے اپنی ذات کو آپ کے سامنے جھکادیا ،اپنا رُخ آپ کی جانب پھیر دیا ،اپنے تمام اُمور کو آپ کے حوالے کردیا ،اپنی پیٹھ آپ کی طرف کردی ،آپ کی رغبت رکھتے ہوئے اور آپ سے ڈرتے ہوئے ،آپ کے سوا کوئی جائے پناہ اور کوئی جائے نجات نہیں ،میں آپ کی نازل کردہ کتاب پر اور آپ کے بھیجے ہوئے رسول پر ایمان لایا ۔ (بخاری:6315)",
              "fawaid_urdu": "حدیث میں آتا ہے:”مَنْ قَالَهُنَّ ثُمَّ مَاتَ تَحْتَ لَيْلَتِهِ مَاتَ عَلَى الفِطْرَةِ “جو شخص اِن کلمات کو پڑھ لے اور پھر اُسی رات اُس کا اِنتقال ہوجائے تو وہ فطرتِ اِسلام پر مرتا ہے۔(بخاری:6315)"
            },
            {
              "point_id": "azkar_maghfirat_hifazat_night",
              "title_urdu": "مغفرت اور حفاظت کی دعا",
              "arabic_text": "بِسْمِ اللهِ وَضَعْتُ جَنْبِي اَللّٰهُمَّ اغْفِرْلِي ذَنْبِي،وَاخْسَأْ شَيْطَانِي، وَفُكَّ رِهَانِي، وَاجْعَلْنِي فِي النَّدِيِّ الْأَعْلٰى",
              "translation_urdu": "اللہ کے نام ہی سے میں نے اپنا پہلو (بستر پر)رکھا،اےاللہ! میری مغفرت فرمادے،میرے شیطان کو ذلیل کردے،میری گردن(ہر قسم کے قرض وغیرہ کے حق اور جہنم کی آگ سے)چھڑادے اور مجھے اَعلیٰ طبقہ میں شامل کردے۔ (ابوداؤد:5054)",
              "fawaid_urdu": ""
            },
            {
              "point_id": "azkar_shuroor_se_panah",
              "title_urdu": "شرور سے اللہ کی پناہ",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَعُوْذُ بِوَجْهِكَ الْكَرِيْمِ، وَكَلِمَاتِكَ التَّامَّةِ، مِنْ شَرِّ مَا أَنْتَ آخِذٌ بِنَاصِيَتِهِ، اَللّٰهُمَّ أَنْتَ تَكْشِفُ الْمَغْرَمَ وَالْمَأْثَمَ، اَللّٰهُمَّ لَا يُهْزَمُ جُنْدُكَ، وَلَا يُخْلَفُ وَعْدُكَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ سُبْحَانَكَ وَبِحَمْدِكَ",
              "translation_urdu": "اے اللہ میں تیری معزز ذات اور مکمل کلمات(اَسماء و صفات)کی پناہ چاہتا ہوں اُن تمام چیزوں کے شر سے جس کی پیشانی تیرے قبضہ قدرت میں ہے،اے اللہ! توہی قرض کو اور گناہ کو دور کرنے والا ہے ،اے اللہ!تیرا لشکر شکست نہیں کھاسکتا ،تیرے وعدہ کے خلاف نہیں ہوسکتا اور کسی مالدارکو اُس کی مالداری تیرے مقابلے میں کوئی نفع نہیں دےسکتی ،تیری ذات پاک ہے اور تمام تعریفیں تیرے لئے ہیں ۔ (ابوداؤد:5052)",
              "fawaid_urdu": ""
            },
            {
              "point_id": "azkar_hifazat_kull_shar",
              "title_urdu": "ہر چیز کے شر سے اللہ کی پناہ",
              "arabic_text": "اَللّٰهُمَّ رَبَّ السَّمٰوَاتِ، وَرَبَّ الأَرَضِينَ، وَرَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإِنْجِيلِ وَالقُرْآنِ، أَعُوْذُ بِكَ مِنْ شَرِّ كُلِّ ذِيْ شَرٍّ أَنْتَ آخِذٌ بِنَاصِيَتِهِ، أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَالظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَالبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنِّي الدَّيْنَ وَأَغْنِنِي مِنَ الفَقْرِ",
              "translation_urdu": "اے اللہ! اے آسمانوں اور زمینوں کے اور ہر چیز کے پروردگار!اے دانے اور گٹھلی کو پھاڑنے والے اور تَورات ،اِنجیل اور قرآن کریم نازل کرنے والے اللہ!میں تیری پناہ چاہتا ہوں ہر اُس شر رکھنے والی چیز کے شرسے جس کی پیشانی تیرے قبضہ قدرت میں ہے۔ تو ہی اوّل ہے ، تجھ سے پہلے کوئی نہیں ،تو ہی آخر ہے ،تیرے بعد کوئی نہیں ،اور ظاہر ہے ،تجھ سے اوپر کوئی نہیں ،اور باطن ہے ،تیرے علاوہ کوئی نہیں ،اے اللہ میرا قرض اداء کردے اور مجھے فقر سے (نکال کر)غنی بنادے۔(ترمذی:3400)",
              "fawaid_urdu": ""
            },
            {
              "point_id": "azkar_maghfirat_all_dhunoub_3_times",
              "title_urdu": "تمام گناہوں کی معافی (تین مرتبہ)",
              "arabic_text": "أَسْتَغْفِرُ اللهَ الَّذِيْ لَا إِلٰهَ إِلَّا هُوَ الحَيُّ القَيُّومُ وَأَتُوبُ إِلَيْهِ",
              "translation_urdu": " میں اللہ سے مغفرت چاہتا ہوں جس کے سوا کوئی معبود نہیں ،وہ ہمیشہ زندہ رہنے والااور خوب تھامنے والا ہے،اور میں اُسی کی جانب رجوع کرتا ہوں۔",
              "fawaid_urdu": "اِس کلمہ کی فضیلت حدیث میں یہ بیان کی گئی ہے:”غَفَرَ اللهُ ذُنُوبَهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ البَحْرِ، وَإِنْ كَانَتْ عَدَدَ وَرَقِ الشَّجَرِ، وَإِنْ كَانَتْ عَدَدَ رَمْلِ عَالِجٍ، وَإِنْ كَانَتْ عَدَدَ أَيَّامِ الدُّنْيَا“یہ اِستغفارکا کلمہ جس نے تین مرتبہ بستر پر جاتے ہوئے پڑھ لیا تو اللہ تعالیٰ اُس کے گناہ معاف کردیں گے اگرچہ وہ سمندر کےجھاگ کے برابر ہوں،اگرچہ درخت کے پتوں کی تعداد کے برابر ہوں،اگرچہ عالج یعنی جہاں بکثرت ریت پائی جاتی ہے وہاں کی ریت کی تعداد کے برابر ہو اور اگرچہ دنیا کے تمام دنوں کی تعداد کے برابر ہوں۔(ترمذی:3397)"
            },
            {
              "point_id": "azkar_jahannam_se_panah",
              "title_urdu": "جہنم کی آگ سے اللہ کی پناہ",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِي مَنَّ عَلَيَّ وَأَفْضَلَ اَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ رَبِّ كُلِّ شَيْءٍ وَإِلٰهِ كُلِّ شَيْءٍ أَعُوذُ بِكَ مِنَ النَّارِ",
              "translation_urdu": "تمام تعریفیں اللہ کیلئے ہیں جس نے مجھ پر احسان کیا اور خوب کیا ،تمام تعریفیں اللہ کیلئے ہیں جو تمام جہانوں کا اور ہر چیز کا پروردگار ہے،ہر چیز کا معبود ہے، اے اللہ میں جہنم کی آگ سے تیری پناہ چاہتا ہوں ۔ (مسند البزار:10/281)",
              "fawaid_urdu": ""
            },
            {
              "point_id": "azkar_shukr_ala_niamat_night",
              "title_urdu": "نعمتوں پر اللہ کا شکر",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِي كَفَانِيْ وَآوَانِيْ، وَأَطْعَمَنِيْ وَسَقَانِيْ، وَالَّذِيْ مَنَّ عَلَيَّ فَأَفْضَلَ، وَالَّذِي أَعْطَانِيْ فَأَجْزَلَ، اَلْحَمْدُ لِلّٰهِ عَلٰى كُلِّ حَالٍ اَللّٰهُمَّ رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ وَإِلٰهَ كُلِّ شَيْءٍ، أَعُوْذُ بِكَ مِنَ النَّارِ",
              "translation_urdu": "تمام تعریفیں اللہ کیلئے ہیں جس نے مجھے کفایت بخشی،مجھے ٹھکانا دیا ،مجھے کھلایا اور پلایا ،اور جس نے مجھ پر احسان کیا اور خوب کیا،اور جس نے مجھے عطاء کیا اور خوب دیا ، ہر حال میں اللہ کیلئے تمام تعریفیں ہیں ۔اے اللہ! اے ہر چیز کے پروردگار اور مالک اللہ!ہر چیز کے معبود اللہ! اے اللہ میں جہنم کی آگ سے تیری پناہ چاہتا ہوں۔ (ابوداؤد:5058)",
              "fawaid_urdu": ""
            },
            {
              "point_id": "azkar_rahma_and_hifazat_night",
              "title_urdu": "رحم اور حفاظت کی دعا",
              "arabic_text": "بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ، إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
              "translation_urdu": "تیرے ہی نام سے میں نے اپنا پہلو(بستر پر)رکھا اور تیرے ہی نام سے میں اسے اُٹھاؤں گا، اے اللہ ! اگر تو میری روح کو (اپنے پاس )روک لے(یعنی موت دیدے ) تواُس پر رحم کرنا اور اگر اُسے چھوڑدے تو اُس کی حفاظت کرنا جیسے تو اپنے نیک بندوں کی حفاظت کرتا ہے۔(بخاری:6320)",
              "fawaid_urdu": ""
            },
            {
              "point_id": "azkar_maghfirat_dhunoub_night",
              "title_urdu": "گناہوں سے معافی کی دعا",
              "arabic_text": "بِاسْمِكَ وَضَعْتُ جَنْبِي فَاغْفِرْ لِي ذَنْبِي",
              "translation_urdu": "اے اللہ میں تیرے ہی نام سے اپنا پہلو (بستر پر)رکھتا ہوں پس تو میرے گناہ معاف کردے۔",
              "fawaid_urdu": "نبی کریمﷺنے ایک شخص سے دریافت کیا :”كَيْفَ تَقُولُ إِذَا أَوَيْتَ فِي فِرَاشِكَ؟“جب تم بستر پر جاتے ہو تو کیا کہتے ہو؟ اُس نے کہا: میں یہی مذکورہ کلمات پڑھتا ہوں ،آپﷺنے اُسے شاباش دیتے ہوئے اِرشاد فرمایا:”أَصَبْتَ، وَفَّقَكَ اللهُ“بالکل صحیح ، اللہ تمہیں (مزید )توفیق عطاء فرمائے۔(طبرانی کبیر:116)"
            },
            {
              "point_id": "azkar_adhab_se_panah_3_times",
              "title_urdu": "اللہ کے عذاب سے پناہ (تین مرتبہ)",
              "arabic_text": "اَللّٰهُمَّ قِنِيْ عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ",
              "translation_urdu": "اے اللہ! مجھے اپنے عذاب سے اُس(قیامت کے) دن بچالینا جس دن تو اپنے بندوں کو(مرنے کے بعد ) اُٹھائے گا۔",
              "fawaid_urdu": "حضرت حفصہ رض فرماتی ہیں کہ نبی کریم ﷺ جب سونے کا اِرادہ فرماتے تو دایاں ہاتھ رخسار کے نیچے رکھ کر تین مرتبہ مذکورہ پڑھتے تھے۔(ابوداؤد:5045)"
            },
            {
              "point_id": "azkar_hifazat_har_nuqsan_night",
              "title_urdu": "ہر قسم کے نقصان سے حفاظت",
              "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ شَرِّ مَا خَلَقَ",
              "translation_urdu": " میں اللہ کے مکمل کلمات(یعنی اَسماء و صفات)کی پناہ میں آتا ہوں اُن تمام چیزوں کے شر سے جو اللہ نے پیدا کی ہیں۔",
              "fawaid_urdu": "حضرت انس بن مالک (رض) فرماتے ہیں کہ نبی کریمﷺکے سامنے ایک شخص کا تذکرہ کیا گیا جو (تکلیف کی وجہ سے)ساری رات سو نہیں سکا تھا،آپﷺنے نے بےخوابی کی وجہ دریافت کی تو معلوم ہوا کہ اُسے بچھو نے کاٹ لیا تھا ،آپﷺ نےاِرشاد فرمایا:”أَمَا إِنَّهُ لَوْ قَالَ حِينَ أَوَى إِلَى فِرَاشِهِ: أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ شَرِّ مَا خَلَقَ لَمْ يَضُرَّهُ“سن لو! اگر وہ اپنے بستر پر جاتے ہوئے مذکورہ کلمات پڑھ لیتا تو یہ بچھو اُسے نقصان نہیں پہنچاتا۔(طبرانی اوسط:7093) حضرت سہیل بن صالح (رض) فرماتے ہیں کہ ہمارے گھر والوں نے یہ کلمات سیکھ لیے تھے اور روزانہ پڑھتے تھے،ایک دفعہ گھر میں کسی باندی کو بچھو نے ڈس لیا تو اِن کلمات کی برکت سے اُسے کوئی تکلیف تک نہیں ہوئی ۔(ترمذی:3604) ایک روایت کے مطابق اگر کسی جگہ اتر کر مذکورہ کلمات پڑھ لیے جائیں تو وہاں سے کُوچ کرنے تک کوئی نقصان نہیں پہنچے گا۔(الدعوات الکبیر:470)"
            },
            {
              "point_id": "azkar_hifazat_shar_and_joo",
              "title_urdu": "شر اور بھوک سے حفاظت",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الشَّرِّ وَلُوْعًا، وَمِنَ الْجُوْعِ ضَجِيْعًا",
              "translation_urdu": "اے اللہ میں شر سے تیری پناہ چاہتا ہوں اِس حال میں کہ اُس سے محبت کی جائے اور بھوک سے کہ جو ہم خواب بن جائے۔(طبرانی اوسط:7196)",
              "fawaid_urdu": " نبی کریمﷺجب اپنے بستر پر تشریف لاتے تو یہ دُعاء پڑھتے تھے۔"
            },
            {
              "point_id": "azkar_shaitaan_and_shirk_se_panah_night",
              "title_urdu": "شیطان اور شرک سے اللہ کی پناہ",
              "arabic_text": "اَللّٰهُمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، أَنْتَ رَبُّ كُلِّ شَيْءٍ، وَإِلٰهُ كُلِّ شَيْءٍ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ، وَالْمَلَآئِكَةُ يَشْهَدُوْنَ، أَعُوْذُ بِكَ مِنَ الشَّيْطَانِ وَشِرْكِهِ، وَأَعُوْذُ بِكَ أَنْ أَقْتَرِفَ عَلٰى نَفْسِي إِثْمًا أَوْ أَجُرَّهُ عَلٰى مُسْلِمٍ",
              "translation_urdu": "اے اللہ! اے آسمانوں اور زمین کو پیدا کرنے والے،غیب اور حاضر کو جاننے والے! تو ہر چیز کا پروردگار اور ہر چیز کا معبود ہے،میں گواہی دیتا ہوں اِس بات کی کہ تیرے سوا کوئی معبود نہیں ،تو اکیلا ہے ،تیرا کوئی شریک نہیں ، اور اِس بات کی گواہی دیتا ہوں کہ حضرت محمّدﷺتیرے بندے اور رسول ہیں ، اور فرشتے بھی اِس بات کی گواہی دیتے ہیں،میں شیطان سے اور اُس کے شرک(میں مبتلاء کرنے)سے تیری پناہ چاہتاہوں، اور میں تیری پناہ چاہتا ہوں اِس بات سے کہ اپنے نفس پر کوئی بُرائی کا اِرتکاب کروں یا اُس کو کسی مسلمان کی جانب منسوب کروں ۔ (مسند احمد:6597)",
              "fawaid_urdu": "نبی کریم ﷺ حضرت عبد اللہ بن عمرو (رض) کو یہ دُعاء سکھاتے تھے اور اُنہیں تلقین فرماتے کہ سونے کے وقت میں اِس دعاء کو پڑھ لیا کریں۔(مسند احمد:6597)"
            },
            {
              "point_id": "azkar_pak_saaf_from_sins",
              "title_urdu": "گناہوں سے پاک صاف",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِيْ عَلَا فَقَهَرَ، وَبَطَنَ فَخَبَرَ، وَمَلَكَ فَقَدَرَ، اَلْحَمْدُ لِلّٰهِ الَّذِيْ يُحْيِي وَيُمِيتُ، وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ",
              "translation_urdu": "تمام تعریفیں اللہ کیلئے ہیں جو بلند و برتر اور غالب ہے،مخفی ہے اور خوب خبر رکھنے والا ہے اور مالک ہے اور (ہر چیز پر)قادر ہے۔تمام تعریفیں اللہ کیلئے ہیں جو زندہ کرتا اور موت دیتا ہے، اور ہر چیز پر قدرت رکھتا ہے۔ (طبرانی اوسط:7891)",
              "fawaid_urdu": "حدیث کے مطابق جس نے بستر پر جاکر یہ دُعاء پڑھ لی وہ اپنے گناہوں سے اُس دن کی طرح پاک ہوکر نکل جاتا ہے جس دن اُس کی ماں نے اُسے جنا تھا۔"
            },
            {
              "point_id": "azkar_hifazat_nagahani_hawadis",
              "title_urdu": "ناگہانی واقعات و حوادث سے اللہ کی پناہ",
              "arabic_text": "آمَنْتُ بِاللهِ،وَكَفَرْتُ بِالطَّاغُوتِ،وَعْدُ اللهِ حَقٌّ، وَصَدَقَ الْمُرْسَلُونَ، اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ طَوَارِقِ هٰذَا اللَّيْلِ إِلَّا طَارِقًا يَّطْرُقُ بِخَيْرٍ",
              "translation_urdu": " میں اللہ پر ایمان لایا، اور میں نے شیطان کو جھٹلایا ، اللہ کا وعدہ سچا ہے اور رسولوں نے سچ فرمایا ۔اے اللہ!میں تیری پناہ چاہتا ہوں اِس رات(ناگہانی) واقعات اورحادثوں سے،بجز اس اچھے واقعہ کےجوخیر کولائے۔(طبرانی کبیر:3454)",
              "fawaid_urdu": ""
            },
            {
              "point_id": "azkar_sana_o_tareef_night",
              "title_urdu": "اللہ کی ثنا و تعریف",
              "arabic_text": "اَللّٰهُمَّ إِنِّي أَعُوْذُ بِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَأَعُوْذُ بِكَ مِنْكَ، اَللّٰهُمَّ لَا أَسْتَطِيعُ ثَنَاءً عَلَيْكَ وَلَوْ حَرَصْتُ، وَلَكِنْ أَنْتَ كَمَا أَثْنَيْتَ عَلٰى نَفْسِكَ",
              "translation_urdu": "اے اللہ! میں تیری معافی کی پناہ میں آتا ہوں تیری سزا سے، اور میں تیری رضا و خوشنودی کی پناہ میں آتا ہوں تیری ناراضگی سے، اور میں تجھ سے تیری پناہ میں آتا ہوں ، اے اللہ! اگرچہ مجھے(تیری حمد و ثناء کی)کتنی ہی حرص ہو،میں تیری ثناء و تعریف کی اِستطاعت نہیں رکھتا ،لیکن تو ویسا ہی ہے جیساکہ تونے خود اپنی ذات کی تعریف کی ہے۔",
              "fawaid_urdu": "حضرت علی کرّم اللہ وجہہ فرماتے ہیں کہ میں نے ایک دفعہ نبی کریمﷺ کے ساتھ رات میں تھا تو میں نے آپﷺکو نماز سے فارغ ہوکر بستر پر جاتے ہوئے مذکورہ بالا یہ دُعاء پڑھتے ہوئے سنا۔(طبرانی اوسط:1992)"
            },
            {
              "point_id": "azkar_maghfirat_zabad_e_bahr",
              "title_urdu": "سمندر کی جھاگ کے برابر گناہوں کی معافی",
              "arabic_text": "لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَاشَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ سُبْحَانَ اللهِ وَبِحَمْدِهِ، اَلْحَمْدُ لِلّٰهِ، لَا إِلٰهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ",
              "translation_urdu": " اللہ کے سوا کوئی معبود نہیں ،وہ اکیلا ہے،اُس کا کوئی شریک نہیں ، اُسی کیلئے ساری بادشاہت ہے، اور اُس کیلئے ساری تعریفیں ہیں ، اور وہ ہر چیز پر قادر ہے۔اللہ کی ذات پاک ہےاور اُس کیلئے ساری تعریفیں ہیں ، تمام تعریفیں اللہ ہی کیلئے ہیں ، اللہ کے سوا کوئی معبود نہیں اور اللہ بہت بڑا ہے۔ (مصنف ابن ابی شیبہ:29307)",
              "fawaid_urdu": " حضرت ابوہریرہ (رض) فرماتے ہیں کہ جس نے بستر پر جاتے ہوئے یہ مذکورہ کلمات پڑھ لیے”غُفِرَ لَهُ ذُنُوبُهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ“ اُس کے گناہ معاف کردیے جائیں گے اگرچہ وہ سمندر کے جھاگ کے برابر ہی کیوں نہ ہوں۔"
            }
          ]
        }
      ]
    },
    "duas": {
      "title_main_urdu": "ایمان اور روز مرہ کی اہم دعائیں",
      "introduction_note": "یہ مواد دی گئی اصل عبارت کے مطابق ہے اور اسے کسی بھی قسم کی تبدیلی سے پاک رکھا گیا ہے۔",
      "sections": [
        {
          "id": "iman_mujmal_mufassal",
          "original_section_number": 1,
          "title_urdu": "ایمان مجمل اور ایمان مفصل",
          "subtitle_urdu": "ایمان کے بنیادی کلمات:",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "iman_mujmal",
              "title_urdu": "ایمان مجمل",
              "arabic_text": "اٰمَنْتُ بِاللّٰہِ کَمَا ھُوَ بِأَسْمَآئِہٖ وَصِفَاتِہٖ وَقَبِلْتُ جَمِیْعَ أَحْکَامِہٖ",
              "translation_urdu": "ایمان لایا میں اللہ تعالیٰ پر جیساکہ وہ اپنے ناموں اور صفتوں کے ساتھ ہے، اور میں نے اس کے تمام احکام قبول کیے۔"
            },
            {
              "point_id": "iman_mufassal",
              "title_urdu": "ایمان مفصل",
              "arabic_text": "اٰمَنْتُ بِاللّٰہِ وَمَلٰئِکَتِہٖ وَکُتُبِہٖ وَرُسُلِہٖ وَالْیَوْمِ الْاٰخِرِ وَالْقَدْرِخَیْرِہٖ وَشَرِّہٖ مِنَ اللّٰہِ تَعَالٰی وَالْبَعْثِ بَعْدَ الْمَوْتِ",
              "translation_urdu": "ایمان لایا میں اللہ پر، اور اس کے فرشتوں پر ،اور اس کی کتابوں پر ،اور اس کے رسولوں پر ،اور قیامت کے دن پر، اور تقدیر پر، کہ اچھی اور بری سب اللہ کی طرف سے ہے، اور مرنے کے بعد دوبارہ زندہ ہونے پر۔"
            }
          ]
        },
        {
          "id": "daily_duas_part_1",
          "original_section_number": 2,
          "title_urdu": "روز مرہ کے معمولات کی دعائیں",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "dua_waking_up",
              "title_urdu": "نیند سے بیدار ہوتے وقت",
              "arabic_text": "الْحَمْدُ لِلّٰهِ الَّذِي اَحْيَانَا بَعْدَ مَاۤ اَمَاتَنَا وَاِلَيْهِ النُّشُوْرُ",
              "translation_urdu": "تمام تعریفیں اللہ کی ہیں جس نے ہمیں موت کے بعد زندگی بخشی اور اسی کی طرف لوٹ کر جانا ہے۔"
            },
            {
              "point_id": "dua_going_to_bed",
              "title_urdu": "سونے کے لئے بستر پر جاتے وقت",
              "arabic_text": "اَللّٰهُمَّ بِاسْمِكَ اَمُوْتُ وَاَحْيٰي",
              "translation_urdu": "اے اللہ ! میں آپ ہی کے نام پر مروں گا اور (آپ ہی کے نام پر) جیتا ہوں۔"
            },
            {
              "point_id": "dua_entering_washroom",
              "title_urdu": "بیت الخلاء میں جاتے ہوئے",
              "arabic_text": "اَللّٰهُمَّ اِنِّيۤ اَعُوْذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَآئِثِ",
              "translation_urdu": "اے اللہ ! میں خبیث شیاطین سے آپ کی پناہ چاہتا ہوں چاہے وہ نر ہوں یا مادہ۔"
            },
            {
              "point_id": "dua_leaving_washroom",
              "title_urdu": "بیت الخلاء سے نکلتے ہوئے",
              "arabic_text": "غُفْرَانَكَ اَلْحَمْدُ لِلّٰهِ الَّذِيْ اَذْهَبَ عَنِّي الْاَذَي وَعَافَانِيْ",
              "translation_urdu": "اے اللہ ! میں آپ سے مغفرت مانگتا ہوں ،تمام تعریفیں اللہ کے لئے ہیں جس نے مجھ سے گندگی دور کی اور مجھے عافیت عطا فرمائی۔"
            },
            {
              "point_id": "dua_during_wudu",
              "title_urdu": "وضو کے دوران",
              "arabic_text": "اَللّٰهُمَّ اغْفِرْ لِيْ ذَنْبِيْ وَوَسِّعْ لِيْ فِيْ دَارِيْ وَبَارِكْ لِيْ فِيْ رِزْقِيْ",
              "translation_urdu": "اے اللہ ! میرے گناہ کو معاف فرما دیجئے ، میرے گھر میں وسعت عطا فرمائیے اور میرے رزق میں برکت عطا فرمائیے۔"
            },
            {
              "point_id": "dua_after_wudu",
              "title_urdu": "وضو کے بعد",
              "arabic_text": "اَشْهَدُ اَنْ لَّاۤ اِلٰهَ اِلَّا اللّٰهُ وَحْدَہٗ لَاشَرِيْكَ لَهٗ وَاَشْهَدُ اَنَّ مُحَمَّدًا عَبْدُ ہٗ وَرَسُولُهٗ",
              "translation_urdu": "میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں، وہ تنہا ہے،اس کا کوئی شریک نہیں، اور میں گواہی دیتا ہوں کہ محمد ﷺ اللہ کے بندے اور اس کے رسول ہیں۔"
            },
            {
              "point_id": "dua_before_ghusl",
              "title_urdu": "غسل سے پہلے",
              "arabic_text": "اَللّٰهُمَّ اِنِّيْۤ اَسْئَلُكَ الْجَنَّةَ وَاَعُوْذُبِكَ مِنَ النَّارِ",
              "translation_urdu": "یا اللہ ! میں آپ سے جنت مانگتا ہوں اور دوزخ سے آپ کی پناہ چاہتا ہوں۔"
            },
            {
              "point_id": "dua_entering_masjid",
              "title_urdu": "مسجد مىں داخل ہوتے وقت",
              "arabic_text": "بِسْمِ اللّٰهِ وَالصَّلٰوةُ وَالسَّلَامُ عَلٰي رَسُوْلِ اللّٰهِ اَللّٰهُمَّ افْتَحْ لِيْۤ اَبْوَابَ رَحْمَتِكَ",
              "translation_urdu": "اللہ کے نام سے اور رسول اللہ ﷺ پر صلوٰۃ وسلام ہو، اے اللہ ! میرے لئے اپنی رحمت کے دروازے کھول دیجئے۔"
            },
            {
              "point_id": "dua_leaving_masjid",
              "title_urdu": "مسجد سے باہر نکلتے وقت",
              "arabic_text": "بِسْمِ اللّٰهِ وَالصَّلٰوةُ وَالسَّلَامُ عَلٰي رَسُوْلِ اللّٰهِ اَللّٰهُمَّ اِنِّيْۤ اَسْئَلُكَ مِنْ فَضْلِكَ",
              "translation_urdu": "اللہ کے نام سے اور رسول اللہ ﷺ پر صلوٰۃ وسلام ہو۔ اے اللہ ! میں آپ سے آپ کا فضل مانگتا ہوں۔"
            },
            {
              "point_id": "during_azan",
              "title_urdu": "اذان کى آواز سن کر",
              "action_urdu": "جب اذان کى آواز سنے تو جو کلمات مؤذن کہتا جائے وہى کلمات خود بھى دُہرائے، البتہ حَىَّ عَلَى الصَّلٰوۃ اور حَىَّ عَلَى الْفَلَاحِ کے جواب میں:",
              "arabic_text": "لَاحَوْلَ وَلَاقُوَّةَ اِلَّا بِاللّٰهِ الْعَلِيِّ الْعَظِيْمِ",
              "translation_urdu": "کہے۔"
            },
            {
              "point_id": "dua_after_azan",
              "title_urdu": "اذان کے ختم پر یہ دعا پڑھے",
              "arabic_text": "اَللّٰهُمَّ رَبَّ هٰذِهِ الدَّعْوَةِ التَّآمَّةِ وَالصَّلاَةِ القَآئِمَةِ آتِ مُحَمَّدَ نِ الْوَسِيْلَةَ وَالْفَضِيْلَةَ وَابْعَثْهُ مَقَامًا مَّحْمُوْدَ نِ الَّذِي وَعَدْتَّهُ اِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ",
              "translation_urdu": "اے اللہ ! جو اس مکمل دعوت اور کھڑی ہونے والی نماز کا مالک ہے، حضرت محمد(ﷺ) کو مقام وسیلہ عطا فرما اور فضیلت عطا فرما، اور اس مقام محمود پر فائز فرما جس کا آپ نے ان سے وعدہ فرمایا ہے، بے شک آپ وعدہ خلافی نہیں فرماتے۔"
            },
            {
              "point_id": "dua_after_farz_salam",
              "title_urdu": "فرض نماز سے سلام پھیرنے کے بعد",
              "arabic_text": "لَاۤ اِلٰهَ اِلَّا اللَّهُ وَحْدَهُ لاَ شَرِيْكَ لَهٗ، لَهٗ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ، اَللّٰهُمَّ لاَ مَانِعَ لِمَا اَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
              "translation_urdu": "اللہ کے سوا کوئی معبود نہیں ،و ہ تنہا ہے اس کا کوئی شریک نہیں، سلطنت اسی کی ہے ،تعریف اسی کی ہے اور وہ ہر چیز پر قادر ہے، اے اللہ ! جو چیز آپ عطا فرمائیں اسے روکنے والا کوئی نہیں، اور جو چیز آپ روک لیں اسے دینے والا کوئی نہیں، اور کسی با رُتبہ شخص کو اس کا رُتبہ آپ کے مقابلے میں کوئی فائدہ نہیں پہنچا سکتا۔"
            },
            {
              "point_id": "dua_entering_home",
              "title_urdu": "گھر میں داخل ہوتے وقت",
              "arabic_text": "اَللّٰهُمَّ اِنِّيۤ اَسْاَلُكَ خَيْرَ الْمَوْلَجِ وَخَيْرَ الْمَخْرَجِ بِسْمِ اللّٰهِ وَلَجْنَا وَبِسْمِ اللّٰهِ خَرَجْنَا وَعَلَى اللّٰهِ رَبِّنَا تَوَكَّلْنَا",
              "translation_urdu": "اے اللہ ! میں آپ سے داخل ہونے کی بھلائی مانگتا ہوں اور نکلنے کی بھلائی مانگتا ہوں، اللہ کے نام سے ہم داخل ہوئے اور اللہ کے نام ہی سے نکلے اور اللہ ہی پر جو ہمارا پروردگار ہے ہم نے بھروسہ کیا۔"
            },
            {
              "point_id": "dua_at_iftar",
              "title_urdu": "افطار کے وقت",
              "arabic_text": "اَللّٰهُمَّ لَكَ صُمْتُ وَعَلٰى رِزْقِكَ اَفْطَرْتُ",
              "translation_urdu": "یا اللہ ! میں نے آپ کے لئے روزہ رکھا اور آپ کے رزق پر افطار کیا۔"
            },
            {
              "point_id": "dua_after_meal",
              "title_urdu": "کھانے کے بعد",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذيۤ اَطْعَمَنَا وَسَقانَا وَجَعَلَنَا مُسْلِمِيْنَ",
              "translation_urdu": "تمام تعریفیں اللہ کے لئے ہیں جس نے ہمیں کھلایا اور پلایا اور ہمیں مسلمان بنایا۔"
            },
            {
              "point_id": "dua_for_host",
              "title_urdu": "اگر کھانا کسى اور نے کھلایا ہو",
              "arabic_text": "اَللّٰهُمَّ اَطْعِمْ مَنْ اَطْعَمَنِيْ وَاسْقِ مَنْ سَقَانِيْ",
              "translation_urdu": "اے اللہ ! جس نے مجھے کھانا کھلایا ،آپ اس کو (اور) کھلائیے اور جس نے مجھے سیراب کیا، آپ اسے (اور) سیراب کیجئے۔"
            },
            {
              "point_id": "dua_changing_clothes",
              "title_urdu": "کپڑے بدلتے وقت",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِي كَسَانِيْ هٰذَا وَرَزَقَنِيْهِ مِنْ غَيْرِ حَوْلٍ مِّنِّي وَلَا قُوَّةٍ",
              "translation_urdu": "تعریف اللہ کی ہے جس نے مجھے یہ پہنایا اور میری کسی قوت اور طاقت کے بغیر مجھے عطا فرمایا۔"
            },
            {
              "point_id": "dua_fear_of_enemy",
              "title_urdu": "جب کسى دشمن کا خوف ہو",
              "arabic_text": "اَللّٰھُمَّ اِنَّا نَجْعَلُكَ فِيْ نُحُوْرِهِمْ وَنَعُوْذُبِكَ مِنْ شُرُوْرِهِمْ",
              "translation_urdu": "اے اﷲ! ہم تجھی کو ان کے مقابل کرتے ہیں اور ان کے شر سے تیری پناہ مانگتے ہیں۔"
            },
            {
              "point_id": "dua_for_difficult_task",
              "title_urdu": "جب کوئى کام مشکل معلوم ہو",
              "arabic_text": "اَللّٰهُمَّ لَا سَهْلَ اِلَّا مَا جَعَلْتَه سَهْلًا وَّاَنْتَ تَجْعَلُ الْحَزَنَ سَهْلًا اِذَا شِئْتَ",
              "translation_urdu": "اے اﷲ! کوئی چیز آسان نہیں مگر جس کو تو آسان بنائے اور تو مشکل کو بھی آسان کردیتا ہے جب چاہے۔"
            },
            {
              "point_id": "dua_wearing_new_clothes",
              "title_urdu": "نیا کپڑا پہنتے وقت",
              "arabic_text": "اَللّٰهُمَّ لَكَ الْحَمْدُ اَنْتَ كَسَوْتَنِيْهِ اَسْاَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ وَاَعُوْذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ",
              "translation_urdu": "اے اللہ ! آپ ہی کی تعریف ہے جیسے کہ آپ نے مجھے یہ لباس پہنایا، میں آپ سے اس کپڑے کی بھلائی مانگتا ہوں اور اس کام کی بھلائی مانگتا ہوں جس کے لئے یہ بنایا گیا، اور میں ا س کے شر سے پناہ مانگتا ہوں اور جس کام کے لئے بنایا گیا اس کی بُرائی سے پناہ مانگتا ہوں۔"
            },
            {
              "point_id": "dua_entering_market",
              "title_urdu": "جب بازار مىں داخل ہو",
              "arabic_text": "لَاۤ اِلٰهَ اِلاَّ اللّٰهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِيْ وَيُمِيْتُ وَهُوَ حَيٌّ لَّا يَمُوْتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
              "translation_urdu": "اللہ کے سوا کوئی معبود نہیں، وہ ایک ہے اس کا کوئی شریک نہیں، سلطنت اسی کی ہے وہ زندہ کرتا ہے اور موت دیتا ہے، اور وہ خود زندہ ہے جسے موت نہیں آئے گی، اسی کے ہاتھ میں بھلائی ہے اور وہ ہر چیز پر قدرت رکھتا ہے۔"
            },
            {
              "point_id": "dua_riding_a_vehicle",
              "title_urdu": "جب کسى سوارى پر سوار ہو",
              "arabic_text": "سُبۡحٰنَ الَّذِىۡ سَخَّرَ لَنَا هٰذَا وَمَا كُنَّا لَهٗ مُقۡرِنِيۡنَۙ‏ (۱۳) وَاِنَّاۤ اِلٰى رَبِّنَا لَمُنۡقَلِبُوۡنَ",
              "translation_urdu": "پاک ہے وہ ذات جس نے یہ سواری ہمارے لئے مسخر کر دی، اور ہم اس کو قابو میں لانے والے نہ تھے، اور ہم اپنے پروردگار ہی کی طرف لوٹنے والے ہیں۔سورۃ زخرف(14)"
            }
          ]
        },
        {
          "id": "travel_family_and_social_duas",
          "original_section_number": 3,
          "title_urdu": "سفر، خاندان اور معاشرتی دعائیں",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "dua_for_travel",
              "title_urdu": "سفر کى دعا",
              "arabic_text": "اَللّٰہُ اَکْبَرُ اَللّٰہُ اَکْبَرُ اَللّٰہُ اَکْبَرُ اَللّٰهُمَّ اِنَّا نَسْاَلُكَ فِي سَفَرِنَا هٰذَا الْبِرَّ وَالتَّقْوٰى وَمِنَ العَمَلِ مَا تَرْضٰى اَللّٰهُمَّ اَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالخَلِيْفَةُ فِي الْاَهْلِ وَالْمَالِ وَالْوَلَدِ اَللّٰهُمَّ اِنِّيْ اَعُوْذُ بِكَ مِنْ وَّعْثَاءِ السَّفَرِ وكَآبَةِ المَنْظَرِ وَسُوءِ المُنْقَلَبِ في المَالِ والاَهْلِ وَالْوَلَدِ اَللّٰهُمَّ هَوِّن عَلَيْنا سَفَرَنَا هٰذَا وَاطْوِ عَنَّا بُعْدَهٗ",
              "translation_urdu": "اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے،اللہ سب سے بڑا ہے، اے اللہ ! آپ ہی ہمارے سفر میں ہمارے ساتھ ہیں، اور آپ ہی ہمارے پیچھے ہمارے گھر والوں اور مال و اولادکے محافظ ہیں۔ اے اللہ ! ہم آپ سے اپنے اس سفر میں نیکی اور تقوىٰ کی توفیق مانگتے ہیں، اور ایسے عمل کی جس سے آپ راضی ہوں۔ اے اللہ ! میں آپ کی پناہ چاہتا ہوں سفر کی مشقت سے اور غم میں ڈالنے والے منظر سے، اور بُری حالت میں گھر والوں اور مال واولاد کے پاس واپس لوٹنے سے۔ اے اللہ ! ہمارے لئے اس سفر کو آسان کر دیجئے اور اس کی دوری کو ہمارے لئے لپیٹ دیجئے۔"
            },
            {
              "point_id": "dua_entering_new_town",
              "title_urdu": "جب کسى نئى بستى مىں داخل ہو",
              "arabic_text": "اَللّٰهُمَّ اِنِّي اَسْئَلُكَ خَيْرَ هٰذِهِ الْقَرْيَةِ وَخَيْرَ اَهْلِهَا وَخَيْرَ مَافِيْهَا وَاَعُوْذُبِكَ مِنْ شَرِّهَا وَشَرِّ اَهْلِهَا وَشَرِّ مَا فِيْهَا",
              "translation_urdu": "اے اللہ ! میں آپ سے سوال کرتا ہوں کہ مجھے اس بستی کی، اس کے رہنے والوں کی اور جو کچھ اس بستی میں ہے اس کی بھلائی نصیب ہو، اور میں آپ کی پناہ مانگتا ہوں اس کی ، اس کے رہنے والوں کی اور جو کچھ اس بستی میں ہے اس کی بُرائی سے۔"
            },
            {
              "point_id": "dua_for_sick",
              "title_urdu": "بیمار کےلئے نبى ﷺ کى دعا",
              "arabic_text": "اَذْهِبِ الْبَاْسَ رَبَّ النَّاسِ وَاشْفِ اَنْتَ الشَّافِي لَا شِفَآءَ اِلَّا شِفَآؤُكَ شِفَآءٌ لَّا يُغَادِرُ سَقَمًا",
              "translation_urdu": "اے لوگوں کے پروردگار! بیماری دور کر دے اور شفا دے تو ہی شفا دینے والا ہے۔ تیرے سوا کسی کی شفاء ایسی نہیں جو بیماری کو دور کر دے۔(ام المؤمنین حضرت عائشہ صدیقہ ؓ فرماتی ہیں کہ رسول کریم ﷺ (کا یہ طریقہ تھا) جب ہم میں سے کوئی بیمار ہوتا آپ ﷺ اس پر داہنا ہاتھ پھیرتے اور یہ (دعا) فرماتے ۔)"
            },
            {
              "point_id": "nikah_congratulation",
              "title_urdu": "نکاح کى مبارکباد",
              "arabic_text": "بَارَكَ اللّٰهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِيْ خَيْرٍ",
              "translation_urdu": "اللہ تعالىٰ تمہارے لئے یہ نکاح مبارک فرمائے اور تم پر برکتین نازل فرمائے اور تم دونوں کو خیر وخوبی کے ساتھ اکٹھا رکھے۔"
            },
            {
              "point_id": "dua_at_intercourse",
              "title_urdu": "جماع کے وقت",
              "arabic_text": "بِسْمِ اللّٰهِ اَللّٰهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَارَزَقْتَنَا",
              "translation_urdu": "اللہ کے نام سے ، یا اللہ ! ہم کو شیطان سے دور رکھ، اور شیطان کو اس چیز سے(یعنی اولاد) سے دور رکھ جو آپ ہمیں عطا فرمائیں ۔"
            },
            {
              "point_id": "dua_at_ejaculation",
              "title_urdu": "انزال کے وقت",
              "arabic_text": "اَللّٰهُمَّ لَاتَجْعَلْ لِلشَّيْطَانِ فِيْمَا رَزَقْتَنِيْ نَصِيْبًا",
              "translation_urdu": "یا اللہ ! جو کچھ (اولاد) آپ مجھے عطا فرمائیں اس میں شیطان کا کوئی حصہ نہ لگائیے۔"
            },
            {
              "point_id": "dua_seeing_new_moon",
              "title_urdu": "مہینے کا پہلا چاند دیکھ کر",
              "arabic_text": "اَللّٰهُمَّ اَهْلِلْهُ عَلَيْنَا بِاليُمْنِ وَالْاِيْمَانِ وَالسَّلَامَةِ وَالْاِسْلَامِ رَبِّيْ وَرَبُّكَ اللّٰهُ",
              "translation_urdu": "یا اللہ ! اس چاند کو ہم پر برکت ایمان ،سلامتی اور اسلام کے ساتھ طلوع فرمائیے (اے چاند) میرا اور تیرا دونوں کا پروردگار اللہ ہے ۔"
            },
            {
              "point_id": "dua_when_angry",
              "title_urdu": "جب غصہ آئے",
              "arabic_text": "اَعُوْذُ بِاللّٰهِ مِنَ الشَّيْطٰنِ الرَّجِيْمِ",
              "translation_urdu": "میں اللہ تعالیٰ کی پناہ میں آتا ہوں شیطان مردود سے۔"
            },
            {
              "point_id": "jame_dua",
              "title_urdu": "جامع دعا",
              "arabic_text": "اَللّٰھُمَّ اِنَّا نَسْاَلُکَ مِنْ خَیْرِ مَاسَاَلَکَ مِنْہُ نَبِیُّکَ مُحَمَّدٌ (صَلَّی اللّٰہُ عَلَیْہِ وَسَلَّمَ) وَنَعُوْذُ بِکَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْہُ نَبِیُّکَ مُحَمَّدٌ (صَلَّی اللّٰہُ عَلَیْہِ وَسَلَّمَ) وَاَنْتَ الْمُسْتَعَانُ وَعَلَیْکَ الْبَلَاغُ وَلَاحَوْلَ وَلَاقُوَّۃَ اِلَّا بِاللّٰہِ",
              "translation_urdu": "حضرت ابو امامہ رضی اللہ عنہ نے حضور ﷺ سے عرض کیا کہ حضور! دعائیں تو آپ نے بہت سی بتادی ہیں اور ساری یاد رہتی نہیں، کوئی ایسی دعا بتادیجئے جو سب دعاؤں کو شامل ہوجائے۔ اس پر حضور ﷺ نے یہ دعا تعلیم فرمائی۔"
            },
            {
              "point_id": "dua_at_end_of_gathering",
              "title_urdu": "ہر مجلس کے آخر میں",
              "arabic_text": "سُبْحٰنَكَ اللّٰهُمَّ وَبِحَمْدِكَ لَآ اِلٰهَ اِلَّا اَنْتَ اَسْتَغْفِرُكَ وَاَتُوْبُ اِلَيْكَ",
              "translation_urdu": "یا اللہ میں آپ کی پاکی بیان کرتا ہوں اور آپ کی حمد کرتا ہوں ، آپ کے سوا کوئی معبود نہیں، میں آپ سے مغفرت مانگتا ہوں اور آپ کے حضور توبہ کرتا ہوں۔"
            },
            {
              "point_id": "dua_looking_in_mirror",
              "title_urdu": "جب آئینہ میں اپنا چہرہ دیکھے تو یہ دعا مانگے",
              "arabic_text": "اَللّٰهُمَّ اَنْتَ حَسَّنْتَ خَلْقِيْ فَحَسِّنْ خُلُقِيْ",
              "translation_urdu": "اے اللہ ! تو نے ہی میری صورت اتنی اچھی بنائی ہے پس تو ہی میرے اخلاق بھی اچھے بنا دے۔"
            },
            {
              "point_id": "dua_for_new_spouse_servant",
              "title_urdu": "عورت نکاح کر کے لائے یا خادم لائے تو پڑھے",
              "arabic_text": "اَللّٰهُمَّ اِنِّي اَسْاَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ وَاَعُوْذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ",
              "translation_urdu": "اے اللہ ! میں تجھ سے اس کی اور اس کی فطرت کی خیر وبرکت کا سوال کرتا ہوں اور اس کے اور اس کی فطرت کے شر سے تیری پناہ لیتا ہوں ۔"
            }
          ]
        },
        {
          "id": "quranic_duas_part_1",
          "original_section_number": 4,
          "title_urdu": "قرآنی دعائیں (حصہ اول)",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "dua_seeing_afflicted",
              "title_urdu": "بیمار یا مصیبت زدہ کو دیکھ کر یہ دعا پڑھے",
              "arabic_text": "اَلْحَمْدُ لِلّٰهِ الَّذِيْ عَافَانِيْ مِمَّا ابْتَلَاكَ بِهٖ وَفَضَّلَنِيْ عَلٰي كَثِيْرٍ مِّمَّنْ خَلَقَ تَفْضِيْلًا",
              "translation_urdu": "تمام تعریفیں اﷲکے لیے ہیں جس نے عافت دی مجھے اس (تکلیف) سے جس میں تجھے مبتلا کیا اور اپنی بہت سے مخلوق میں سے مجھے فضیلت بخشی۔"
            },
            {
              "point_id": "dua_hidayat_surah_fatiha",
              "title_urdu": "ہدایت اور صراط مستقیم کی دعا (سورۃ الفاتحہ)",
              "arabic_text": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِیْنَۙ الرَّحْمٰنِ الرَّحِیْمِۙ مٰلِكِ یَوْمِ الدِّیْنِؕ اِیَّاكَ نَعْبُدُ وَ اِیَّاكَ نَسْتَعِیْنُؕ اِهْدِنَا الصِّرَاطَ الْمُسْتَقِیْمَۙ صِرَاطَ الَّذِیْنَ اَنْعَمْتَ عَلَیْهِمْ١ۙ۬ۦ غَیْرِ الْمَغْضُوْبِ عَلَیْهِمْ وَ لَا الضَّآلِّیْنَ۠",
              "translation_urdu": "اللہ کے نام سے جو رحمان و رحیم ہے تعریف اللہ ہی کے لیے ہے جو تمام کائنات کا رب ہے رحمان اور رحیم ہے روز جزا کا مالک ہے ہم تیری ہی عبادت کرتے ہیں اور تجھی سے مدد مانگتے ہیں ہمیں سیدھا راستہ دکھا اُن لوگوں کا راستہ جن پر تو نے انعام فرمایا، جو معتوب نہیں ہوئے، جو بھٹکے ہوئے نہیں ہیں۔"
            },
            {
              "point_id": "dua_protection_from_ignorance",
              "title_urdu": "جہالت سے حفاظت کی دعا (سورۃ البقرۃ - 67)",
              "arabic_text": "اَعُوْذُ بِاللّٰهِ اَنْ اَكُوْنَ مِنَ الْجٰهِلِیْنَ",
              "translation_urdu": "میں پناہ مانگتا ہوں اللہ کی (اس بات سے) کہ میں جاہلوں میں سے ہو جاؤں۔"
            },
            {
              "point_id": "dua_acceptance_forgiveness",
              "title_urdu": "اعمال کی قبولیت اور درگزر کی دعا (سورۃ البقرۃ 127-128)",
              "arabic_text": "رَبَّنَا تَقَبَّلْ مِنَّا١ؕ اِنَّكَ اَنْتَ السَّمِیْعُ الْعَلِیْمُ رَبَّنَا وَ اجْعَلْنَا مُسْلِمَیْنِ لَكَ وَ مِنْ ذُرِّیَّتِنَاۤ اُمَّةً مُّسْلِمَةً لَّكَ١۪ وَ اَرِنَا مَنَاسِكَنَا وَ تُبْ عَلَیْنَا١ۚ اِنَّكَ اَنْتَ التَّوَّابُ الرَّحِیْمُ",
              "translation_urdu": "اے ہمارے رب، ہم سے یہ خدمت قبول فرما لے، تو سب کی سننے اور سب کچھ جاننے والا ہے۔ اے رب، ہم دونوں کو اپنا مسلم (مُطیع فرمان) بنا، ہماری نسل سے ایک ایسی قوم اٹھا، جو تیری مسلم ہو، ہمیں اپنی عبادت کے طریقے بتا، اور ہماری کوتاہیوں سے در گزر فرما، تو بڑا معاف کرنے والا اور رحم فرمانے والا ہے۔"
            },
            {
              "point_id": "dua_dunya_akhira_hasanah",
              "title_urdu": "دنیا اور آخرت میں بھلائی کی دعا (سورۃ البقرۃ 201)",
              "arabic_text": "رَبَّنَاۤ اٰتِنَا فِی الدُّنْیَا حَسَنَةً وَّ فِی الْاٰخِرَةِ حَسَنَةً وَّ قِنَا عَذَابَ النَّارِ",
              "translation_urdu": "اے ہمارے رب! ہمیں دنیا میں بھی بھلائی دے اور آخرت میں بھی بھلائی اور آگ کے عذاب سے ہمیں بچا۔"
            },
            {
              "point_id": "dua_sabr_nusr_against_kafiroon",
              "title_urdu": "صبر، استقامت اور نصرت کی دعا (سورۃ البقرۃ 250)",
              "arabic_text": "رَبَّنَاۤ اَفْرِغْ عَلَیْنَا صَبْرًا وَّ ثَبِّتْ اَقْدَامَنَا وَ انْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِیْنَؕ",
              "translation_urdu": "اے ہمارے رب ہم پر صبر کا فیضان کر، ہمارے قدم جما دے اور اس کافر گروہ پر ہمیں فتح نصیب کر۔"
            },
            {
              "point_id": "dua_maghfirat_ilayka_almasir",
              "title_urdu": "مغفرت کی دعا (سورۃ البقرۃ 285)",
              "arabic_text": "سَمِعْنَا وَ اَطَعْنَا١٘ۗ غُفْرَانَكَ رَبَّنَا وَ اِلَیْكَ الْمَصِیْرُ",
              "translation_urdu": "ہم نے (اللہ اور رسول کے احکام کو توجہ سے) سن لیا ہے، اور ہم خوشی سے (ان کی) تعمیل کرتے ہیں۔ اے ہمارے پروردگار ہم آپ کی مغفرت کے طلبگار ہیں، اور آپ ہی کی طرف ہمیں لوٹ کرجانا ہے۔"
            },
            {
              "point_id": "dua_bhuul_chuk_khata",
              "title_urdu": "بھول چوک اور خطاؤں پر درگزر کی دعا (سورۃ البقرۃ 286)",
              "arabic_text": "رَبَّنَا لَا تُؤَاخِذْنَاۤ اِنْ نَّسِیْنَاۤ اَوْ اَخْطَاْنَا١ۚ رَبَّنَا وَ لَا تَحْمِلْ عَلَیْنَاۤ اِصْرًا كَمَا حَمَلْتَهٗ عَلَى الَّذِیْنَ مِنْ قَبْلِنَا١ۚ رَبَّنَا وَ لَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهٖ١ۚ وَ اعْفُ عَنَّا١ٙ وَ اغْفِرْ لَنَا١ٙ وَ ارْحَمْنَا١ٙ اَنْتَ مَوْلٰىنَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِیْنَ۠",
              "translation_urdu": "اے ہمارے رب! ہم سے بھول چوک میں جو قصور ہو جائیں، ان پر گرفت نہ کر مالک! ہم پر وہ بوجھ نہ ڈال، جو تو نے ہم سے پہلے لوگوں پر ڈالے تھے پروردگار! جس بار کو اٹھانے کی طاقت ہم میں نہیں ہے، وہ ہم پر نہ رکھ، ہمارے ساتھ نرمی کر، ہم سے در گزر فرما، ہم پر رحم کر، تو ہمارا مولیٰ ہے، کافروں کے مقابلے میں ہماری مدد کر۔"
            },
            {
              "point_id": "dua_istiqamat_ala_sirat",
              "title_urdu": "صراط مستقیم پر استقامت کی دعا (سورۃ آل عمران 8)",
              "arabic_text": "رَبَّنَا لَا تُزِغْ قُلُوْبَنَا بَعْدَ اِذْ هَدَیْتَنَا وَ هَبْ لَنَا مِنْ لَّدُنْكَ رَحْمَةً١ۚ اِنَّكَ اَنْتَ الْوَهَّابُ",
              "translation_urdu": "پروردگار! جب تو ہمیں سیدھے رستہ پر لگا چکا ہے، تو پھر کہیں ہمارے دلوں کو کجی میں مبتلا نہ کر دیجیو ہمیں اپنے خزانہ فیض سے رحمت عطا کر کہ تو ہی فیاض حقیقی ہے۔"
            },
            {
              "point_id": "dua_protection_from_fire",
              "title_urdu": "جہنم کی آگ سے حفاظت کی دعا (سورۃ آل عمران 16)",
              "arabic_text": "رَبَّنَاۤ اِنَّنَاۤ اٰمَنَّا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَ قِنَا عَذَابَ النَّارِۚ",
              "translation_urdu": "مالک! ہم ایمان لائے، ہماری خطاؤں سے در گزر فرما اور ہمیں آتش دوزخ سے بچا لے۔"
            },
            {
              "point_id": "dua_righteous_offspring",
              "title_urdu": "نیک اولاد کی دعا (سورۃ آل عمران 38)",
              "arabic_text": "رَبِّ هَبْ لِیْ مِنْ لَّدُنْكَ ذُرِّیَّةً طَیِّبَةً١ۚ اِنَّكَ سَمِیْعُ الدُّعَآءِ",
              "translation_urdu": "پروردگار! اپنی قدرت سے مجھے نیک اولاد عطا کر تو ہی دعا سننے والا ہے۔"
            },
            {
              "point_id": "dua_istighfar_and_firmness",
              "title_urdu": "ثابت قدمی اور اللہ کی مدد کی دعا (سورۃ آل عمران 147)",
              "arabic_text": "رَبَّنَا اغْفِرْ لَنَا ذُنُوْبَنَا وَ اِسْرَافَنَا فِیْۤ اَمْرِنَا وَ ثَبِّتْ اَقْدَامَنَا وَ انْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِیْنَ",
              "translation_urdu": "اے ہمارے رب! ہماری غلطیوں اور کوتاہیوں سے درگزر فرما، ہمارے کام میں تیرے حدود سے جو کچھ تجاوز ہو گیا ہو اُسے معاف کر دے، ہمارے قدم جما دے اور کافروں کے مقابلہ میں ہماری مدد کر۔"
            },
            {
              "point_id": "dua_protection_from_khizlan",
              "title_urdu": "قیامت کے دن رسوائی سے بچنے کی دعا (سورۃ آل عمران 193-194)",
              "arabic_text": "رَبَّنَا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَ كَفِّرْ عَنَّا سَیِّاٰتِنَا وَ تَوَفَّنَا مَعَ الْاَبْرَارِۚ رَبَّنَا وَ اٰتِنَا مَا وَعَدْتَّنَا عَلٰى رُسُلِكَ وَ لَا تُخْزِنَا یَوْمَ الْقِیٰمَةِ١ؕ اِنَّكَ لَا تُخْلِفُ الْمِیْعَادَ",
              "translation_urdu": "اے ہمارے آقا! جو قصور ہم سے ہوئے ہیں ان سے درگزر فرما، جو برائیاں ہم میں ہیں انہیں دور کر دے اور ہمارا خاتمہ نیک لوگوں کے ساتھ کر۔ خداوندا! جو وعدے تو نے اپنے رسولوں کے ذریعہ سے کیے ہیں اُن کو ہمارے ساتھ پورا کر اور قیامت کے دن ہمیں رسوائی میں نہ ڈال، بے شک تو اپنے وعدے کے خلاف کرنے والا نہیں ہے۔"
            },
            {
              "point_id": "dua_inclusion_among_witnesses",
              "title_urdu": "گواہی دینے والوں میں شمولیت کی دعا (سورۃ المائدۃ 83)",
              "arabic_text": "رَبَّنَاۤ اٰمَنَّا فَاكْتُبْنَا مَعَ الشّٰهِدِیْنَ",
              "translation_urdu": "پروردگار! ہم ایمان لائے، ہمارا نام گواہی دینے والوں میں لکھ لے۔"
            },
            {
              "point_id": "dua_inclusion_among_saliheen",
              "title_urdu": "نیک لوگوں میں شامل ہونے کی دعا (سورۃ المائدۃ 84)",
              "arabic_text": "وَ نَطْمَعُ اَنْ یُّدْخِلَنَا رَبُّنَا مَعَ الْقَوْمِ الصّٰلِحِیْنَ",
              "translation_urdu": "ہم اِس بات کی خواہش رکھتے ہیں کہ ہمارا رب ہمیں صالح لوگوں میں شامل کرے۔"
            },
            {
              "point_id": "dua_maghfirat_and_rahmah_aaraf",
              "title_urdu": "مغفرت اور رحمت کی دعا (سورۃ الاعراف 23)",
              "arabic_text": "رَبَّنَا ظَلَمْنَاۤ اَنْفُسَنَا١ٚ وَ اِنْ لَّمْ تَغْفِرْ لَنَا وَ تَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِیْنَ",
              "translation_urdu": "اے رب! ہم نے اپنے اوپر ستم کیا، اب اگر تو نے ہم سے در گزر نہ فرمایا اور رحم نہ کیا تو یقیناً ہم تباہ ہو جائیں گے۔"
            },
            {
              "point_id": "dua_protection_from_dhulm",
              "title_urdu": "ظالموں کی معیت سے بچنے کی دعا (سورۃ الاعراف 47)",
              "arabic_text": "رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظّٰلِمِیْنَ۠",
              "translation_urdu": "اے رب! ہمیں اِن ظالم لوگوں میں شامل نہ کیجیو۔"
            },
            {
              "point_id": "dua_decision_by_haqq",
              "title_urdu": "حق کے فیصلے کی دعا (سورۃ الاعراف 89)",
              "arabic_text": "رَبَّنَا افْتَحْ بَیْنَنَا وَ بَیْنَ قَوْمِنَا بِالْحَقِّ وَ اَنْتَ خَیْرُ الْفٰتِحِیْنَ",
              "translation_urdu": "اے رب، ہمارے اور ہماری قوم کے درمیان ٹھیک ٹھیک فیصلہ کر دے اور تو بہترین فیصلہ کرنے والا ہے۔"
            },
            {
              "point_id": "dua_sabr_and_muslim_ending",
              "title_urdu": "صبر اور حسنِ خاتمہ کی دعا (سورۃ الاعراف 126)",
              "arabic_text": "رَبَّنَاۤ اَفْرِغْ عَلَیْنَا صَبْرًا وَّ تَوَفَّنَا مُسْلِمِیْنَ۠",
              "translation_urdu": "اے رب، ہم پر صبر کا فیضان کر اور ہمیں دنیا سے اٹھا تو اِس حال میں کہ ہم تیرے فرماں بردار ہوں۔"
            },
            {
              "point_id": "dua_maghfirat_for_self_brother",
              "title_urdu": "معافی اور رحمت کی دعا (سورۃ الاعراف 151)",
              "arabic_text": "رَبِّ اغْفِرْ لِیْ وَ لِاَخِیْ وَ اَدْخِلْنَا فِیْ رَحْمَتِكَ١ۖ٘ وَ اَنْتَ اَرْحَمُ الرّٰحِمِیْنَ۠",
              "translation_urdu": "اے رب، مجھے اور میرے بھائی کو معاف کر اور ہمیں اپنی رحمت میں داخل فرما، تو سب سے بڑھ کر رحیم ہے۔"
            },
            {
              "point_id": "dua_hassanah_dunya_akhira_aaraf",
              "title_urdu": "دنیا اور آخرت میں بھلائی کی دعا (سورۃ الاعراف 155-156)",
              "arabic_text": "اَنْتَ وَلِیُّنَا فَاغْفِرْ لَنَا وَ ارْحَمْنَا وَ اَنْتَ خَیْرُ الْغٰفِرِیْنَ وَ اكْتُبْ لَنَا فِیْ هٰذِهِ الدُّنْیَا حَسَنَةً وَّ فِی الْاٰخِرَةِ اِنَّا هُدْنَاۤ اِلَیْكَ",
              "translation_urdu": "ہمارے سر پرست تو آپ ہی ہیں پس ہمیں معاف کر دیجیے اور ہم پر رحم فرمائیے، آپ سب سے بڑھ کر معاف فرمانے والے ہیں۔ اور ہمارے لیے اس دنیا کی بھلائی بھی لکھ دیجیے اور آخرت کی بھی، ہم نے آپ کی طرف رجوع کر لیا۔"
            },
            {
              "point_id": "dua_tawakkal_rabbul_arsh",
              "title_urdu": "اللہ پر توکل کی دعا (سورۃ التوبۃ 129)",
              "arabic_text": "حَسْبِیَ اللّٰهُ١ۖۗ٘ لَاۤ اِلٰهَ اِلَّا هُوَ١ؕ عَلَیْهِ تَوَكَّلْتُ وَ هُوَ رَبُّ الْعَرْشِ الْعَظِیْمِ۠",
              "translation_urdu": "میرے لیے اللہ بس کرتا ہے، کوئی معبود نہیں مگر وہ، اُسی پر میں نے بھروسہ کیا اور وہ مالک ہے عرش عظیم کا۔"
            }
          ]
        },
        {
          "id": "quranic_duas_part_2",
          "original_section_number": 5,
          "title_urdu": "قرآنی دعائیں (حصہ دوم)",
          "list_type": "adhkar",
          "points": [
            {
              "point_id": "dua_protection_from_fitna",
              "title_urdu": "فتنہ بننے سے بچنے کی دعا (سورۃ یونس 85-86)",
              "arabic_text": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظّٰلِمِیْنَۙ وَ نَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكٰفِرِیْنَ",
              "translation_urdu": "اے ہمارے رب، ہمیں ظالم لوگوں کے لیے فتنہ نہ بنا۔ اور اپنی رحمت سے ہم کو کافروں سے نجات دے۔"
            },
            {
              "point_id": "dua_protection_from_laailmi",
              "title_urdu": "جہالت اور لاعلمی سے بچنے کی دعا (سورۃ ہود 47)",
              "arabic_text": "رَبِّ اِنِّیْۤ اَعُوْذُ بِكَ اَنْ اَسْئَلَكَ مَا لَیْسَ لِیْ بِهٖ عِلْمٌ١ؕ وَ اِلَّا تَغْفِرْ لِیْ وَ تَرْحَمْنِیْۤ اَكُنْ مِّنَ الْخٰسِرِیْنَ",
              "translation_urdu": "اے میرے رب، میں تیری پناہ مانگتا ہوں اِس سے کہ وہ چیز تجھ سے مانگوں جس کا مجھے علم نہیں اگر تو نے مجھ معاف نہ کیا اور رحم نہ فرمایا تو میں برباد ہو جاؤں گا۔"
            },
            {
              "point_id": "dua_hiding_and_revealing",
              "title_urdu": "ظاہر و باطن اللہ کو دکھانے کی دعا (سورۃ ابراہیم 38)",
              "arabic_text": "رَبَّنَاۤ اِنَّكَ تَعْلَمُ مَا نُخْفِیْ وَ مَا نُعْلِنُ١ؕ وَ مَا یَخْفٰى عَلَى اللّٰهِ مِنْ شَیْءٍ فِی الْاَرْضِ وَ لَا فِی السَّمَآءِ",
              "translation_urdu": "پروردگار، تو جانتا ہے جو کچھ ہم چھپاتے ہیں اور جو کچھ ظاہر کرتے ہیں\" اور واقعی اللہ سے کچھ بھی چھپا ہوا نہیں ہے، نہ زمین میں نہ آسمانوں میں۔"
            },
            {
              "point_id": "dua_iqamat_salat_and_walidain",
              "title_urdu": "اقامت نماز اور والدین کی بخشش کی دعا (سورۃ ابراہیم 40-41)",
              "arabic_text": "رَبِّ اجْعَلْنِیْ مُقِیْمَ الصَّلٰوةِ وَ مِنْ ذُرِّیَّتِیْ١ۖۗ رَبَّنَا وَ تَقَبَّلْ دُعَآءِ رَبَّنَا اغْفِرْ لِیْ وَ لِوَالِدَیَّ وَ لِلْمُؤْمِنِیْنَ یَوْمَ یَقُوْمُ الْحِسَابُ۠",
              "translation_urdu": "ا ے میرے پروردگار، مجھے نماز قائم کرنے والا بنا اور میری اولاد سے بھی (ایسے لوگ اٹھا جو یہ کام کریں) پروردگار، میری دعا قبول کر۔ پروردگار، مجھے اور میرے والدین کو اور سب ایمان لانے والوں کو اُس دن معاف کر دیجیو جبکہ حساب قائم ہوگا۔"
            },
            {
              "point_id": "dua_rahmat_walidain",
              "title_urdu": "والدین کے لئے رحمت کی دعا (سورۃ الاسراء 24)",
              "arabic_text": "رَّبِّ ارْحَمْهُمَا كَمَا رَبَّیٰنِیْ صَغِیْرًاؕ",
              "translation_urdu": "پروردگار، ان (میرے والدین) پر رحم فرما جس طرح اِنہوں نے رحمت و شفقت کے ساتھ مجھے بچپن میں پالا تھا۔"
            },
            {
              "point_id": "dua_for_rushd",
              "title_urdu": "معاملات میں درستگی کی دعا (سورۃ الکھف 10)",
              "arabic_text": "رَبَّنَاۤ اٰتِنَا مِنْ لَّدُنْكَ رَحْمَةً وَّ هَیِّئْ لَنَا مِنْ اَمْرِنَا رَشَدًا",
              "translation_urdu": "اے پروردگار، ہم کو اپنی رحمت خاص سے نواز اور ہمارا معاملہ درست کر دے۔"
            },
            {
              "point_id": "dua_zidni_ilma",
              "title_urdu": "علم میں اضافے کی دعا (سورۃ طہٰ 114)",
              "arabic_text": "رَّبِّ زِدْنِیْ عِلْمًا",
              "translation_urdu": "اے پروردگار مجھے مزید علم عطا کر۔"
            },
            {
              "point_id": "dua_confession_yunus",
              "title_urdu": "قصور کے اعتراف کی دعا (سورۃ الانبیاء 87)",
              "arabic_text": "لَّاۤ اِلٰهَ اِلَّاۤ اَنْتَ سُبْحٰنَكَ١ۖۗ اِنِّیْ كُنْتُ مِنَ الظّٰلِمِیْنَۚۖ",
              "translation_urdu": "نہیں ہے کوئی خدا مگر تُو، پاک ہے تیری ذات، بے شک میں نے قصور کیا۔"
            },
            {
              "point_id": "dua_for_companionship",
              "title_urdu": "اللہ کے ساتھ کی دعا (سورۃ الانبیاء 89)",
              "arabic_text": "رَبِّ لَا تَذَرْنِیْ فَرْدًا وَّ اَنْتَ خَیْرُ الْوٰرِثِیْنَۚۖ",
              "translation_urdu": "اے پروردگار، مجھے اکیلا نہ چھوڑ، اور بہترین وارث تو تُو ہی ہے۔"
            },
            {
              "point_id": "dua_mubaraka_place",
              "title_urdu": "برکت کی جگہ کی دعا (سورۃ المومنون 29)",
              "arabic_text": "رَّبِّ اَنْزِلْنِیْ مُنْزَلًا مُّبٰرَكًا وَّ اَنْتَ خَیْرُ الْمُنْزِلِیْنَ",
              "translation_urdu": "پروردگار، مجھ کو برکت والی جگہ اتار اور تُو بہترین جگہ دینے والا ہے۔"
            },
            {
              "point_id": "dua_not_with_dhulimeen",
              "title_urdu": "ظالم لوگوں سے حفاظت کی دعا (سورۃ المومنون 94)",
              "arabic_text": "رَبِّ فَلَا تَجْعَلْنِیْ فِی الْقَوْمِ الظّٰلِمِیْنَ",
              "translation_urdu": "تو اے میرے رب، مجھے ان ظالم لوگوں میں شامل نہ کیجیو۔"
            },
            {
              "point_id": "dua_protection_from_shayateen",
              "title_urdu": "شیاطین سے حفاظت کی دعا (سورۃ المومنون 97-98)",
              "arabic_text": "رَّبِّ اَعُوْذُ بِكَ مِنْ هَمَزٰتِ الشَّیٰطِیْنِۙ وَ اَعُوْذُ بِكَ رَبِّ اَنْ یَّحْضُرُوْنِ",
              "translation_urdu": "پروردگار، میں شیاطین کی اکساہٹوں سے تیری پناہ مانگتا ہوں۔ بلکہ اے میرے رب، میں تو اس سے بھی تیری پناہ مانگتا ہوں کہ وہ میرے پاس آئیں۔"
            },
            {
              "point_id": "dua_maghfirat_and_rahmah_muminoon_109",
              "title_urdu": "مغفرت اور رحمت کی دعا (سورۃ المومنون 109)",
              "arabic_text": "رَبَّنَاۤ اٰمَنَّا فَاغْفِرْ لَنَا وَ ارْحَمْنَا وَ اَنْتَ خَیْرُ الرّٰحِمِیْنَۚۖ",
              "translation_urdu": "اے ہمارے پروردگار! ہم ایمان لائے، ہمیں معاف کر دے، ہم پر رحم کر، تُو سب رحیموں سے اچھا رحیم ہے۔"
            },
            {
              "point_id": "dua_maghfirat_and_rahmah_muminoon_118",
              "title_urdu": "مغفرت اور رحمت کی دعا (سورۃ المومنون 118)",
              "arabic_text": "رَّبِّ اغْفِرْ وَ ارْحَمْ وَ اَنْتَ خَیْرُ الرّٰحِمِیْنَ۠",
              "translation_urdu": "میرے رب درگزر فرما، اور رحم کر، اور تو سب رحیموں سے اچھا رحیم ہے۔"
            },
            {
              "point_id": "dua_jahannam_protection",
              "title_urdu": "جہنم کے عذاب سے حفاظت کی دعا (سورۃ الفرقان 65-66)",
              "arabic_text": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ١ۖۗ اِنَّ عَذَابَهَا كَانَ غَرَامًاۗۖ اِنَّهَا سَآءَتْ مُسْتَقَرًّا وَّ مُقَامًا",
              "translation_urdu": "اے ہمارے رب، جہنم کے عذاب سے ہم کو بچا لے، اُس کا عذاب تو جان کا لاگو ہے۔ وہ بڑا ہی برا مستقر اور مقام ہے۔"
            },
            {
              "point_id": "dua_qurrata_ayun",
              "title_urdu": "بیوی بچوں سے آنکھوں کی ٹھنڈک کی دعا (سورۃ الفرقان 74)",
              "arabic_text": "رَبَّنَا هَبْ لَنَا مِنْ اَزْوَاجِنَا وَ ذُرِّیّٰتِنَا قُرَّةَ اَعْیُنٍ وَّ اجْعَلْنَا لِلْمُتَّقِیْنَ اِمَامًا",
              "translation_urdu": "اے ہمارے رب، ہمیں اپنی بیویوں اور اپنی اولاد سے آنکھوں کی ٹھنڈک دے اور ہم کو پرہیز گاروں کا امام بنا۔"
            },
            {
              "point_id": "dua_jannat_un_naeem_inheritance",
              "title_urdu": "نعمتوں بھری جنت کی دعا (سورۃ الشعراء 83-85)",
              "arabic_text": "رَبِّ هَبْ لِیْ حُكْمًا وَّ اَلْحِقْنِیْ بِالصّٰلِحِیْنَۙ وَ اجْعَلْ لِّیْ لِسَانَ صِدْقٍ فِی الْاٰخِرِیْنَۙ وَ اجْعَلْنِیْ مِنْ وَّرَثَةِ جَنَّةِ النَّعِیْمِۙ",
              "translation_urdu": "اے میرے رب، مجھے حکم عطا کر اور مجھ کو صالحوں کے ساتھ ملا۔ اور بعد کے آنے والوں میں مجھ کو سچی ناموری عطا کر۔ اور مجھے جنتِ نعیم کے وارثوں میں شامل فرما۔"
            },
            {
              "point_id": "dua_protection_from_khizlan_qayamat",
              "title_urdu": "قیامت کی رسوائی سے حفاظت کی دعا (سورۃ الشعراء 87-88)",
              "arabic_text": "وَ لَا تُخْزِنِیْ یَوْمَ یُبْعَثُوْنَۙ یَوْمَ لَا یَنْفَعُ مَالٌ وَّ لَا بَنُوْنَۙ",
              "translation_urdu": "اور مجھے اس دن رسوا نہ کر جبکہ سب لوگ زندہ کر کے اٹھائے جائیں گے۔ جبکہ نہ مال کوئی فائدہ دے گا نہ اولاد۔"
            },
            {
              "point_id": "dua_najini_from_dhulimeen",
              "title_urdu": "ظالم قوم سے حفاظت کی دعا (سورۃ القصص 21)",
              "arabic_text": "رَبِّ نَجِّنِیْ مِنَ الْقَوْمِ الظّٰلِمِیْنَ۠",
              "translation_urdu": "اے میرے رب، مجھے ظالموں سے بچا۔"
            },
            {
              "point_id": "dua_shukr_and_saliheen_qisas",
              "title_urdu": "صالح بندوں میں شمولیت کی دعا (سورۃ النمل 19)",
              "arabic_text": "رَبِّ اَوْزِعْنِیْۤ اَنْ اَشْكُرَ نِعْمَتَكَ الَّتِیْۤ اَنْعَمْتَ عَلَیَّ وَ عَلٰى وَالِدَیَّ وَ اَنْ اَعْمَلَ صَالِحًا تَرْضٰىهُ وَ اَدْخِلْنِیْ بِرَحْمَتِكَ فِیْ عِبَادِكَ الصّٰلِحِیْنَ",
              "translation_urdu": "اے میرے رب، مجھے قابو میں رکھ کہ میں تیرے اس احسان کا شکر ادا کرتا رہوں جو تو نے مجھ پر اور میرے والدین پر کیا ہے اور ایسا عمل صالح کروں جو تجھے پسند آئے اور اپنی رحمت سے مجھ کو اپنے صالح بندوں میں داخل کر۔"
            },
            {
              "point_id": "dua_help_against_mufsideen",
              "title_urdu": "مفسد لوگوں کے مقابلے میں مدد کی دعا (سورۃ العنکبوت 30)",
              "arabic_text": "رَبِّ انْصُرْنِیْ عَلَى الْقَوْمِ الْمُفْسِدِیْنَ۠",
              "translation_urdu": "اے میرے رب، اِن مفسد لوگوں کے مقابلے میں میری مدد فرما۔"
            },
            {
              "point_id": "dua_habbli_mina_saliheen",
              "title_urdu": "نیک اولاد کی دعا (سورۃ الصافات 100)",
              "arabic_text": "رَبِّ هَبْ لِیْ مِنَ الصّٰلِحِیْنَ",
              "translation_urdu": "اے پروردگار، مجھے ایک بیٹا عطا کر جو صالحوں میں سے ہو۔"
            },
            {
              "point_id": "tasbih_and_salam_on_mursaleen",
              "title_urdu": "رسولوں پر سلامتی کی دعا (سورۃ الصافات 180-182)",
              "arabic_text": "سُبْحٰنَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا یَصِفُوْنَۚ وَ سَلٰمٌ عَلَى الْمُرْسَلِیْنَۚ وَ الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِیْنَ۠",
              "translation_urdu": "پاک ہے تیرا رب، عزت کا مالک، اُن تمام باتوں سے جو یہ لوگ بنا رہے ہیں۔ اور سلام ہے مرسلین پر۔ اور ساری تعریف اللہ ربّ العالمین ہی کے لیے ہے۔"
            },
            {
              "point_id": "dua_forgiveness_from_hell_ghafir",
              "title_urdu": "برائیوں سے حفاظت کی دعا (سورۃ غافر 7-8)",
              "arabic_text": "رَبَّنَا وَسِعْتَ كُلَّ شَیْءٍ رَّحْمَةً وَّ عِلْمًا فَاغْفِرْ لِلَّذِیْنَ تَابُوْا وَ اتَّبَعُوْا سَبِیْلَكَ وَ قِهِمْ عَذَابَ الْجَحِیْمِ رَبَّنَا وَ اَدْخِلْهُمْ جَنّٰتِ عَدْنِ اِ۟لَّتِیْ وَعَدْتَّهُمْ وَ مَنْ صَلَحَ مِنْ اٰبَآئِهِمْ وَ اَزْوَاجِهِمْ وَ ذُرِّیّٰتِهِمْ١ؕ اِنَّكَ اَنْتَ الْعَزِیْزُ الْحَكِیْمُۙ",
              "translation_urdu": "اے ہمارے رب، تو اپنی رحمت اور اپنے علم کے ساتھ ہر چیز پر چھایا ہوا ہے، پس معاف کر دے اور عذاب دوزخ سے بچا لے اُن لوگوں کو جنہوں نے توبہ کی ہے اور تیرا راستہ اختیار کر لیا ہے۔ اے ہمارے رب، اور داخل کر اُن کو ہمیشہ رہنے والی اُن جنتوں میں جن کا تو نے اُن سے وعدہ کیا ہے، اور اُن کے والدین اور بیویوں اور اولاد میں سے جو صالح ہوں (اُن کو بھی وہاں اُن کے ساتھ پہنچا دے) تو بلا شبہ قادر مطلق اور حکیم ہے۔"
            },
            {
              "point_id": "dua_protection_from_sayyiat_ghafir",
              "title_urdu": "برائیوں سے حفاظت کی دعا (سورۃ غافر 9)",
              "arabic_text": "وَ قِهِمُ السَّیِّاٰتِ١ؕ وَ مَنْ تَقِ السَّیِّاٰتِ یَوْمَئِذٍ فَقَدْ رَحِمْتَهٗ١ؕ وَ ذٰلِكَ هُوَ الْفَوْزُ الْعَظِیْمُ۠",
              "translation_urdu": "اور بچا دے اُن کو برائیوں سے جس کو تو نے قیامت کے دن برائیوں سے بچا دیا اُس پر تو نے بڑا رحم کیا، یہی بڑی کامیابی ہے۔"
            },
            {
              "point_id": "dua_removal_of_adhab",
              "title_urdu": "عذاب سے حفاظت کی دعا (سورۃ الدخان 12)",
              "arabic_text": "رَبَّنَا اكْشِفْ عَنَّا الْعَذَابَ اِنَّا مُؤْمِنُوْنَ",
              "translation_urdu": "پروردگار! ہم پر سے یہ عذاب ٹال دے، ہم ایمان لاتے ہیں۔"
            },
            {
              "point_id": "dua_shukr_for_parents_and_offspring",
              "title_urdu": "شکر کی توفیق کی دعا (سورۃ الاحقاف 15)",
              "arabic_text": "رَبِّ اَوْزِعْنِیْۤ اَنْ اَشْكُرَ نِعْمَتَكَ الَّتِیْۤ اَنْعَمْتَ عَلَیَّ وَ عَلٰى وَالِدَیَّ وَ اَنْ اَعْمَلَ صَالِحًا تَرْضٰىهُ وَ اَصْلِحْ لِیْ فِیْ ذُرِّیَّتِیْ١ؕۚ اِنِّیْ تُبْتُ اِلَیْكَ وَ اِنِّیْ مِنَ الْمُسْلِمِیْنَ",
              "translation_urdu": "اے میرے رب، مجھے توفیق دے کہ میں تیری اُن نعمتوں کا شکر ادا کروں جو تو نے مجھے اور میرے والدین کو عطا فرمائیں، اور ایسا نیک عمل کروں جس سے تو راضی ہو، اور میری اولاد کو بھی نیک بنا کر مجھے سُکھ دے، میں تیرے حضور توبہ کرتا ہوں اور تابع فرمان (مسلم) بندوں میں سے ہوں۔"
            },
            {
              "point_id": "dua_tawakkal_and_inaba",
              "title_urdu": "اللہ پر توکل کی دعا (سورۃ الممتحنۃ 4)",
              "arabic_text": "رَبَّنَا عَلَیْكَ تَوَكَّلْنَا وَ اِلَیْكَ اَنَبْنَا وَ اِلَیْكَ الْمَصِیْرُ",
              "translation_urdu": "اے ہمارے رب، تیرے ہی اوپر ہم نے بھروسا کیا اور تیری ہی طرف ہم نے رجوع کر لیا اور تیرے ہی حضور ہمیں پلٹنا ہے۔"
            },
            {
              "point_id": "dua_protection_from_bughd",
              "title_urdu": "بغض سے حفاظت کی دعا (سورۃ الحشر 10)",
              "arabic_text": "رَبَّنَا اغْفِرْ لَنَا وَ لِاِخْوَانِنَا الَّذِیْنَ سَبَقُوْنَا بِالْاِیْمَانِ وَ لَا تَجْعَلْ فِیْ قُلُوْبِنَا غِلًّا لِّلَّذِیْنَ اٰمَنُوْا رَبَّنَاۤ اِنَّكَ رَءُوْفٌ رَّحِیْمٌ۠",
              "translation_urdu": "اے ہمارے رب، ہمیں اور ہمارے اُن سب بھائیوں کو بخش دے جو ہم سے پہلے ایمان لائے ہیں اور ہمارے دلوں میں اہل ایمان کے لیے کوئی بغض نہ رکھ، اے ہمارے رب، تو بڑا مہربان اور رحیم ہے۔"
            },
            {
              "point_id": "dua_forgiveness_from_qasoor",
              "title_urdu": "قصوروں سے درگزر کی دعا (سورۃ الممتحنۃ 5)",
              "arabic_text": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِیْنَ كَفَرُوْا وَ اغْفِرْ لَنَا رَبَّنَا١ۚ اِنَّكَ اَنْتَ الْعَزِیْزُ الْحَكِیْمُ",
              "translation_urdu": "اے ہمارے رب، ہمیں کافروں کے لیے فتنہ نہ بنا دے اور اے ہمارے رب، ہمارے قصوروں سے درگزر فرما، بے شک تو ہی زبردست اور دانا ہے۔"
            },
            {
              "point_id": "dua_completion_of_noor",
              "title_urdu": "نور کی تکمیل کی دعا (سورۃ التحریم 8)",
              "arabic_text": "رَبَّنَاۤ اَتْمِمْ لَنَا نُوْرَنَا وَ اغْفِرْ لَنَا١ۚ اِنَّكَ عَلٰى كُلِّ شَیْءٍ قَدِیْرٌ",
              "translation_urdu": "اے ہمارے رب، ہمارا نور ہمارے لیے مکمل کر دے اور ہم سے درگزر فرما، تو ہر چیز پر قدرت رکھتا ہے۔"
            },
            {
              "point_id": "dua_maghfirat_for_all_mumeenin",
              "title_urdu": "تمام مسلمانوں کے لئے مغفرت کی دعا (سورۃ نوح 28)",
              "arabic_text": "رَبِّ اغْفِرْ لِیْ وَ لِوَالِدَیَّ وَ لِمَنْ دَخَلَ بَیْتِیَ مُؤْمِنًا وَّ لِلْمُؤْمِنِیْنَ وَ الْمُؤْمِنٰتِ١ؕ وَ لَا تَزِدِ الظّٰلِمِیْنَ اِلَّا تَبَارًا۠",
              "translation_urdu": "میرے رب، مجھے اور میرے والدین کو اور ہر اس شخص کو جو میرے گھر میں مومن کی حیثیت سے داخل ہوا ہے، اور سب مومن مردوں اور عورتوں کو معاف فرما دے، اور ظالموں کے لیے ہلاکت کے سوا کسی چیز میں اضافہ نہ کر۔"
            }
          ]
        }
      ]
    }
  }
}