[{"id":1,"title_en":"Dua for Forgiveness","title_ur":"مغفرت کی دعا","arabic":"اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ","transliteration":"Allahumma inni dhalamtu nafsi dhulman kathira wa la yaghfirudh-dhunuba illa ant, faghfir li maghfiratan min 'indika warhamni, innaka antal-Ghafur-ur-Rahim","translation_en":"O Allah, I have greatly wronged myself and no one forgives sins but You. So grant me forgiveness and have mercy on me. Surely, You are Forgiving, Merciful","translation_ur":"اے اللہ! میں نے اپنی جان پر بہت ظلم کیا اور تیرے سوا کوئی گناہ معاف نہیں کرتا، پس تو اپنی طرف سے مجھے معافی عطا فرما اور مجھ پر رحم کر، بیشک تو بخشنے والا مہربان ہے"},{"id":2,"title_en":"Dua for Prayer & Family","title_ur":"نماز اور اولاد کی دعا","arabic":"رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي، رَبَّنَا وَتَقَبَّلْ دُعَاءِ ۝ رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ","transliteration":"Rabbi aj'alni muqeemas-salati wa min dhurriyyati, Rabbana wa taqabbal du'a. Rabbana ighfir li wa li walidayya wa lil-mu'minina yawma yaqumul-hisab","translation_en":"My Lord, make me an establisher of prayer, and from my descendants. Our Lord, and accept my supplication. Our Lord, forgive me and my parents and the believers the Day the account is established","translation_ur":"اے میرے رب! مجھے نماز قائم کرنے والا بنا اور میری اولاد سے بھی، اے ہمارے رب! میری دعا قبول فرما، اے ہمارے رب! مجھے اور میرے والدین کو اور تمام مومنوں کو بخش دے جس دن حساب قائم ہوگا"},{"id":3,"title_en":"Dua for This Life & Hereafter","title_ur":"دنیا و آخرت کی دعا","arabic":"رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ","transliteration":"Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina 'adhaban-nar","translation_en":"Our Lord, give us in this world good and in the Hereafter good and protect us from the punishment of the Fire","translation_ur":"اے ہمارے رب! ہمیں دنیا میں بھی بھلائی عطا فرما اور آخرت میں بھی بھلائی اور ہمیں آگ کے عذاب سے بچا"}]
