{
  "info": "Complete authentic English translations for azkar_data.json - 186 items",
  "translations_by_point_id": {
    "azkar_be_baha_ajr": {
      "title_en": "Immense Reward",
      "translation_en": "Allah is the Greatest. All praise is for Allah. Glory be to Allah. There is no deity worthy of worship except Allah.",
      "fawaid_en": "It is narrated from Abu Umamah (RA) that the Prophet ﷺ said: 'To me, remembering Allah after sunrise by saying Allahu Akbar, Alhamdulillah, La ilaha illallah, and Subhanallah is more beloved than freeing four slaves from the children of Ismail (AS). Similarly, remembering Allah from Asr prayer until sunset is more beloved to me than freeing an equal number of slaves from the children of Ismail (AS).' (Musnad Ahmad 22194)"
    },
    "azkar_hifazat_shaitaan": {
      "title_en": "Protection from Devils All Day",
      "translation_en": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
      "fawaid_en": "Whoever recites it at night will remain under Allah's protection from jinn and devils until morning, and whoever recites it in the morning will remain under Allah's protection from jinn and devils until evening. (Al-Mu'jam al-Kabir by Tabarani 542)"
    },
    "azkar_kafaayat_3_times": {
      "title_en": "Sufficiency from Everything (Three Times)",
      "translation_en": "(1) Say: He is Allah, the One. Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent. (2) Say: I seek refuge in the Lord of daybreak, from the evil of that which He created, and from the evil of darkness when it settles, and from the evil of the blowers in knots, and from the evil of an envier when he envies. (3) Say: I seek refuge in the Lord of mankind, the Sovereign of mankind, the God of mankind, from the evil of the retreating whisperer - who whispers in the breasts of mankind - from among the jinn and mankind.",
      "fawaid_en": "Abdullah bin Khubaib (RA) narrates: 'We went out on a dark rainy night searching for the Messenger of Allah ﷺ to lead us in prayer. When we found him, he said: \"Say something.\" I did not say anything. He said again: \"Say something.\" I did not say anything. Then he said: \"Say something.\" I asked: \"O Messenger of Allah, what should I say?\" He replied: \"Recite Qul Huwa Allahu Ahad and the Mu'awwidhatayn (the last two Surahs) three times in the morning and three times in the evening, and they will suffice you for everything.\"' (Abu Dawud: 5082)"
    },
    "azkar_mizan_heavy_3_times": {
      "title_en": "Heavy Words in the Scale (Three Times)",
      "translation_en": "Glory be to Allah and praise be to Him, equal to the number of His creation, equal to the pleasure of His Self, equal to the weight of His Throne, and equal to the ink of His words.",
      "fawaid_en": "Umm al-Mu'minin Juwayriyah (RA) narrates that once the Prophet ﷺ left her early in the morning for prayer while she was sitting on her prayer mat. When he returned after sunrise, she was still sitting there. He ﷺ said: 'Are you still sitting in the same position?' She said: 'Yes.' The Prophet ﷺ said: 'After leaving you, I recited these four phrases three times. If they were to be weighed against all your dhikr today, these words would outweigh them.' (Muslim: 2726)"
    }
  }
}
