[
  {
    "id": 1,
    "title_en": "Shahadah",
    "title_ur": "شہادت",
    "title_ar": "الشَّهَادَة",
    "subtitle_en": "Declaration of Faith",
    "subtitle_ur": "ایمان کا اعلان",
    "icon": "format-quote-close",
    "arabic": "أَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا اللّٰهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللّٰهِ",
    "transliteration": "Ash-hadu an la ilaha illallah, wa ash-hadu anna Muhammadan rasoolullah",
    "translation_en": "I bear witness that there is no deity except Allah, and I bear witness that Muhammad is the Messenger of Allah",
    "translation_ur": "میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں، اور میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں",
    "description_en": "The Shahadah is the first and most fundamental pillar of Islam. It is the declaration of faith that makes a person a Muslim. By sincerely reciting this testimony, one enters into the fold of Islam and accepts the core beliefs of the religion.",
    "description_ur": "شہادت اسلام کا پہلا اور سب سے بنیادی رکن ہے۔ یہ ایمان کا اعلان ہے جو کسی شخص کو مسلمان بناتا ہے۔ اس گواہی کو مخلصانہ طور پر پڑھ کر، انسان اسلام میں داخل ہوتا ہے اور مذہب کے بنیادی عقائد کو قبول کرتا ہے۔",
    "sections": [
      {
        "heading_en": "Meaning and Significance",
        "heading_ur": "معنی اور اہمیت",
        "content_en": "The Shahadah consists of two parts:\n\n1. La ilaha illallah (There is no deity except Allah) - This is the declaration of Tawheed, the oneness of Allah. It negates all false deities and affirms that only Allah deserves worship. This part establishes monotheism as the foundation of Islamic belief.\n\n2. Muhammadun rasoolullah (Muhammad is the Messenger of Allah) - This acknowledges Prophet Muhammad ﷺ as the final messenger sent by Allah to guide humanity. It means accepting his teachings, following his example (Sunnah), and believing in the message he delivered.\n\nThe Shahadah is not merely words to be spoken; it requires sincere belief in the heart, verbal confession with the tongue, and demonstration through actions. It transforms one's entire worldview and establishes a direct relationship between the individual and their Creator.",
        "content_ur": "شہادت دو حصوں پر مشتمل ہے:\n\n1. لا الہ الا اللہ (اللہ کے سوا کوئی معبود نہیں) - یہ توحید کا اعلان ہے، اللہ کی یکتائی۔ یہ تمام جھوٹے معبودوں کی نفی کرتا ہے اور تصدیق کرتا ہے کہ صرف اللہ ہی عبادت کا مستحق ہے۔ یہ حصہ اسلامی عقیدے کی بنیاد کے طور پر توحید قائم کرتا ہے۔\n\n2. محمد رسول اللہ (محمد اللہ کے رسول ہیں) - یہ حضرت محمد صلی اللہ علیہ وسلم کو آخری رسول کے طور پر تسلیم کرتا ہے جنہیں اللہ نے انسانیت کی رہنمائی کے لیے بھیجا۔ اس کا مطلب ہے ان کی تعلیمات کو قبول کرنا، ان کی مثال (سنت) کی پیروی کرنا، اور ان کے پیغام پر یقین رکھنا۔\n\nشہادت محض الفاظ نہیں ہیں جو بولے جائیں؛ اس کے لیے دل میں سچے یقین، زبان سے اقرار، اور اعمال کے ذریعے مظاہرہ کی ضرورت ہے۔ یہ کسی کی پوری دنیا کو تبدیل کرتا ہے اور فرد اور ان کے خالق کے درمیان براہ راست تعلق قائم کرتا ہے۔"
      },
      {
        "heading_en": "Conditions of Shahadah",
        "heading_ur": "شہادت کی شرائط",
        "content_en": "For the Shahadah to be valid and accepted, it must fulfill seven essential conditions:\n\n1. Knowledge (Al-Ilm) - Understanding what the Shahadah means and what it requires.\n\n2. Certainty (Al-Yaqeen) - Having firm conviction without doubt about its truth.\n\n3. Sincerity (Al-Ikhlas) - Declaring it purely for Allah's sake, not for worldly benefits.\n\n4. Truthfulness (As-Sidq) - Speaking it honestly from the heart, not just the tongue.\n\n5. Love (Al-Mahabbah) - Loving Allah, His Messenger, and what the Shahadah represents.\n\n6. Submission (Al-Inqiyad) - Accepting and submitting to its requirements willingly.\n\n7. Acceptance (Al-Qabool) - Accepting it completely without rejection or hesitation.",
        "content_ur": "شہادت کے درست اور مقبول ہونے کے لیے، یہ سات ضروری شرائط کو پورا کرنا ضروری ہے:\n\n1. علم (العلم) - شہادت کا مطلب سمجھنا اور اس کی کیا ضرورت ہے۔\n\n2. یقین (الیقین) - شک کے بغیر اس کی سچائی پر پختہ یقین رکھنا۔\n\n3. اخلاص (الاخلاص) - اسے خالصتاً اللہ کی رضا کے لیے کہنا، نہ کہ دنیاوی فوائد کے لیے۔\n\n4. سچائی (الصدق) - اسے دل سے ایمانداری سے بولنا، صرف زبان سے نہیں۔\n\n5. محبت (المحبۃ) - اللہ، اس کے رسول، اور جو شہادت کی نمائندگی کرتی ہے اس سے محبت کرنا۔\n\n6. اطاعت (الانقیاد) - اس کی ضروریات کو رضامندی سے قبول کرنا اور اس کے سامنے جھکنا۔\n\n7. قبولیت (القبول) - اسے مکمل طور پر قبول کرنا بغیر کسی انکار یا ہچکچاہٹ کے۔"
      },
      {
        "heading_en": "Implications of Shahadah",
        "heading_ur": "شہادت کے اثرات",
        "content_en": "The Shahadah has profound implications for a Muslim's life:\n\n• It establishes the purpose of life - to worship Allah alone and follow the Prophet's guidance.\n\n• It creates accountability - recognizing that we will be questioned about our deeds.\n\n• It brings peace and contentment - trusting in Allah's wisdom and plan.\n\n• It unites the Muslim community - all believers share this fundamental testimony.\n\n• It requires constant renewal - through prayer, remembrance, and righteous deeds.\n\nThe Shahadah is recited throughout a Muslim's life - at birth (whispered in the newborn's ear), during daily prayers, and ideally as the last words before death. It serves as a constant reminder of one's commitment to Islam and submission to Allah.",
        "content_ur": "شہادت مسلمان کی زندگی کے لیے گہرے مضمرات رکھتی ہے:\n\n• یہ زندگی کا مقصد قائم کرتی ہے - صرف اللہ کی عبادت کرنا اور نبی کی رہنمائی کی پیروی کرنا۔\n\n• یہ جوابدہی پیدا کرتی ہے - یہ تسلیم کرنا کہ ہم سے ہمارے اعمال کے بارے میں پوچھا جائے گا۔\n\n• یہ سکون اور اطمینان لاتی ہے - اللہ کی حکمت اور منصوبے پر بھروسہ کرنا۔\n\n• یہ مسلم کمیونٹی کو متحد کرتی ہے - تمام مومنین اس بنیادی گواہی کو شیئر کرتے ہیں۔\n\n• اس کی مسلسل تجدید کی ضرورت ہے - نماز، ذکر، اور نیک اعمال کے ذریعے۔\n\nشہادت مسلمان کی پوری زندگی میں پڑھی جاتی ہے - پیدائش پر (نوزائیدہ کے کان میں کہی جاتی ہے)، روزانہ کی نمازوں میں، اور مثالی طور پر موت سے پہلے آخری الفاظ کے طور پر۔ یہ اسلام کے عہد اور اللہ کے سامنے سر تسلیم خم کرنے کی مسلسل یاد دہانی کا کام کرتی ہے۔"
      }
    ]
  },
  {
    "id": 2,
    "title_en": "Salah",
    "title_ur": "نماز",
    "title_ar": "الصَّلَاة",
    "subtitle_en": "Five Daily Prayers",
    "subtitle_ur": "پانچ وقت کی نماز",
    "icon": "mosque",
    "description_en": "Salah is the second pillar of Islam and the most important act of worship after the Shahadah. It is the daily ritual prayer performed five times a day at prescribed times. Prayer is the direct link between the worshipper and Allah, providing spiritual nourishment and guidance.",
    "description_ur": "نماز اسلام کا دوسرا رکن ہے اور شہادت کے بعد سب سے اہم عبادت ہے۔ یہ روزانہ کی رسمی نماز ہے جو دن میں پانچ بار مقررہ اوقات میں ادا کی جاتی ہے۔ نماز عبادت کرنے والے اور اللہ کے درمیان براہ راست رابطہ ہے، جو روحانی غذا اور رہنمائی فراہم کرتی ہے۔",
    "sections": [
      {
        "heading_en": "The Five Daily Prayers",
        "heading_ur": "پانچ وقت کی نمازیں",
        "content_en": "Muslims are obligated to perform five prayers each day:\n\n1. Fajr - Dawn prayer (2 Rakat)\nPerformed before sunrise, this prayer starts the day with remembrance of Allah. The Prophet ﷺ said: 'Whoever prays Fajr is under Allah's protection.'\n\n2. Dhuhr - Midday prayer (4 Rakat)\nPerformed after the sun passes its zenith, it breaks the busy day for spiritual renewal.\n\n3. Asr - Afternoon prayer (4 Rakat)\nPerformed in the late afternoon, maintaining connection with Allah throughout the day.\n\n4. Maghrib - Sunset prayer (3 Rakat)\nPerformed just after sunset, expressing gratitude for the day's blessings.\n\n5. Isha - Night prayer (4 Rakat)\nPerformed after twilight disappears, ending the day in worship and seeking forgiveness.\n\nEach prayer has its specific time window, and performing them on time is highly emphasized in Islam.",
        "content_ur": "مسلمانوں پر ہر روز پانچ نمازیں فرض ہیں:\n\n1. فجر - فجر کی نماز (2 رکعت)\nطلوع آفتاب سے پہلے ادا کی جاتی ہے، یہ نماز دن کا آغاز اللہ کی یاد سے کرتی ہے۔ نبی ﷺ نے فرمایا: 'جس نے فجر کی نماز پڑھی وہ اللہ کی حفاظت میں ہے۔'\n\n2. ظہر - دوپہر کی نماز (4 رکعت)\nسورج کے زوال کے بعد ادا کی جاتی ہے، یہ مصروف دن کو روحانی تجدید کے لیے توڑتی ہے۔\n\n3. عصر - سہ پہر کی نماز (4 رکعت)\nدن کے آخر میں ادا کی جاتی ہے، پورے دن اللہ سے تعلق برقرار رکھتی ہے۔\n\n4. مغرب - غروب آفتاب کی نماز (3 رکعت)\nغروب آفتاب کے فوراً بعد ادا کی جاتی ہے، دن کی نعمتوں کا شکر ادا کرتی ہے۔\n\n5. عشاء - رات کی نماز (4 رکعت)\nشفق غائب ہونے کے بعد ادا کی جاتی ہے، عبادت اور بخشش مانگنے میں دن ختم ہوتا ہے۔\n\nہر نماز کا ایک مخصوص وقت ہوتا ہے، اور انہیں وقت پر ادا کرنے پر اسلام میں بہت زور دیا گیا ہے۔"
      },
      {
        "heading_en": "Benefits and Wisdom of Salah",
        "heading_ur": "نماز کے فوائد اور حکمت",
        "content_en": "Prayer offers numerous spiritual, psychological, and physical benefits:\n\nSpiritual Benefits:\n• Direct communication with Allah, strengthening faith\n• Purification from sins and mistakes\n• Protection from evil and wrongdoing\n• Increase in good deeds and blessings\n• Preparation for meeting Allah in the Hereafter\n\nPsychological Benefits:\n• Inner peace and tranquility\n• Stress relief and emotional stability\n• Discipline and time management\n• Sense of purpose and direction\n• Community connection through congregational prayer\n\nPhysical Benefits:\n• Regular exercise through prayer movements\n• Improved blood circulation\n• Flexibility and posture improvement\n• Mindfulness and concentration\n\nThe Prophet Muhammad ﷺ said: 'Prayer is the pillar of religion, whoever establishes it has established religion, and whoever abandons it has destroyed religion.' (Bayhaqi)",
        "content_ur": "نماز بے شمار روحانی، نفسیاتی اور جسمانی فوائد پیش کرتی ہے:\n\nروحانی فوائد:\n• اللہ سے براہ راست بات چیت، ایمان کو مضبوط کرنا\n• گناہوں اور غلطیوں سے پاکیزگی\n• برائی اور غلط کاری سے تحفظ\n• نیک اعمال اور برکتوں میں اضافہ\n• آخرت میں اللہ سے ملاقات کی تیاری\n\nنفسیاتی فوائد:\n• اندرونی سکون اور اطمینان\n• تناؤ سے نجات اور جذباتی استحکام\n• نظم و ضبط اور وقت کا انتظام\n• مقصد اور سمت کا احساس\n• باجماعت نماز کے ذریعے کمیونٹی سے تعلق\n\nجسمانی فوائد:\n• نماز کی حرکات کے ذریعے باقاعدہ ورزش\n• خون کی گردش میں بہتری\n• لچک اور کرنسی میں بہتری\n• توجہ اور ارتکاز\n\nنبی محمد ﷺ نے فرمایا: 'نماز دین کا ستون ہے، جس نے اسے قائم کیا اس نے دین قائم کیا، اور جس نے اسے چھوڑ دیا اس نے دین کو تباہ کر دیا۔' (بیہقی)"
      },
      {
        "heading_en": "Requirements for Valid Prayer",
        "heading_ur": "صحیح نماز کی ضروریات",
        "content_en": "For prayer to be valid, certain conditions must be met:\n\nBefore Prayer:\n1. Purification (Wudu/Ghusl) - Physical cleanliness is essential\n2. Clean clothes and place - Free from impurities\n3. Covering awrah - Proper modest dress\n4. Facing Qibla - Direction of Ka'bah in Makkah\n5. Right time - Within the prescribed time for each prayer\n6. Intention (Niyyah) - Sincere intention in the heart\n\nDuring Prayer:\n• Proper recitation of Qur'an (at least Surah Al-Fatiha)\n• Correct sequence of standing, bowing, prostrating\n• Maintaining focus and humility (Khushu')\n• Avoiding unnecessary movement or speech\n\nImportance of Congregation:\nPraying in congregation (especially for men) is highly rewarded. The Prophet ﷺ said: 'Prayer in congregation is twenty-seven times superior to prayer offered alone.' (Bukhari & Muslim)",
        "content_ur": "نماز کے صحیح ہونے کے لیے، کچھ شرائط پوری ہونی چاہیے:\n\nنماز سے پہلے:\n1. طہارت (وضو/غسل) - جسمانی صفائی ضروری ہے\n2. صاف کپڑے اور جگہ - ناپاکی سے پاک\n3. ستر کا ڈھانپنا - مناسب شائستہ لباس\n4. قبلہ رخ ہونا - مکہ میں کعبہ کی سمت\n5. صحیح وقت - ہر نماز کے مقررہ وقت میں\n6. نیت - دل میں سچی نیت\n\nنماز کے دوران:\n• قرآن کی صحیح تلاوت (کم از کم سورہ فاتحہ)\n• کھڑے ہونے، رکوع کرنے، سجدہ کرنے کی صحیح ترتیب\n• توجہ اور عاجزی برقرار رکھنا (خشوع)\n• غیر ضروری حرکت یا بولنے سے پرہیز\n\nباجماعت کی اہمیت:\nباجماعت نماز (خاص طور پر مردوں کے لیے) بہت زیادہ ثواب والی ہے۔ نبی ﷺ نے فرمایا: 'باجماعت نماز تنہا پڑھی گئی نماز سے ستائیس گنا بہتر ہے۔' (بخاری اور مسلم)"
      }
    ]
  },
  {
    "id": 3,
    "title_en": "Zakat",
    "title_ur": "زکوٰۃ",
    "title_ar": "الزَّكَاة",
    "subtitle_en": "Obligatory Charity",
    "subtitle_ur": "فرض خیرات",
    "icon": "hand-coin-outline",
    "description_en": "Zakat is the third pillar of Islam, an obligatory annual charitable payment that purifies one's wealth. It is a fixed percentage (2.5%) of savings and certain types of wealth that must be given to specified categories of people in need.",
    "description_ur": "زکوٰۃ اسلام کا تیسرا رکن ہے، ایک لازمی سالانہ خیراتی ادائیگی جو کسی کی دولت کو پاک کرتی ہے۔ یہ بچت اور مخصوص قسم کی دولت کا ایک مقررہ فیصد (2.5٪) ہے جو ضرورت مند لوگوں کی مخصوص اقسام کو دیا جانا چاہیے۔",
    "sections": [
      {
        "heading_en": "Understanding Zakat",
        "heading_ur": "زکوٰۃ کو سمجھنا",
        "content_en": "Zakat literally means 'purification' and 'growth'. It purifies wealth and the soul from greed and miserliness, while promoting growth in both spiritual and material aspects.\n\nWho Must Pay Zakat:\n• Every adult Muslim (male/female)\n• Who is sane and of sound mind\n• Who possesses wealth above the Nisab threshold\n• Who has owned this wealth for one lunar year (Hawl)\n\nNisab Threshold:\nThe minimum amount of wealth one must possess before Zakat becomes obligatory. It is equivalent to:\n• 87.48 grams of gold, or\n• 612.36 grams of silver\n\nZakat Rate:\n2.5% of qualifying wealth accumulated over one lunar year. This applies to:\n• Cash and savings\n• Gold and silver\n• Business inventory and trade goods\n• Stocks and investments\n• Agricultural produce (different rates)\n• Livestock (specific calculations)",
        "content_ur": "زکوٰۃ کا لفظی معنی 'پاکیزگی' اور 'نمو' ہے۔ یہ دولت اور روح کو لالچ اور بخل سے پاک کرتی ہے، جبکہ روحانی اور مادی دونوں پہلوؤں میں نمو کو فروغ دیتی ہے۔\n\nزکوٰۃ کس پر فرض ہے:\n• ہر بالغ مسلمان (مرد/عورت)\n• جو عاقل اور صحیح دماغ کا ہو\n• جو نصاب کی حد سے زیادہ دولت رکھتا ہو\n• جس نے اس دولت کو ایک قمری سال تک رکھا ہو (حول)\n\nنصاب کی حد:\nدولت کی کم از کم رقم جو کسی کے پاس ہونی چاہیے اس سے پہلے کہ زکوٰۃ فرض ہو۔ یہ برابر ہے:\n• 87.48 گرام سونا، یا\n• 612.36 گرام چاندی\n\nزکوٰۃ کی شرح:\nایک قمری سال میں جمع شدہ اہل دولت کا 2.5٪۔ یہ لاگو ہوتا ہے:\n• نقد رقم اور بچت\n• سونا اور چاندی\n• کاروباری انوینٹری اور تجارتی سامان\n• اسٹاک اور سرمایہ کاری\n• زرعی پیداوار (مختلف شرحیں)\n• مویشی (مخصوص حساب)"
      },
      {
        "heading_en": "Recipients of Zakat",
        "heading_ur": "زکوٰۃ کے مستحقین",
        "content_en": "The Qur'an specifically mentions eight categories of people eligible to receive Zakat (Surah At-Tawbah 9:60):\n\n1. Al-Fuqara (The Poor) - Those with little to no income or means of livelihood\n\n2. Al-Masakin (The Needy) - Those whose income doesn't cover basic necessities\n\n3. Al-Amileen (Zakat Administrators) - Those employed to collect and distribute Zakat\n\n4. Al-Muallafatu Qulubuhum (New Muslims) - Those whose hearts are being reconciled to Islam\n\n5. Ar-Riqab (Freeing Slaves) - Those in bondage or captivity\n\n6. Al-Gharimeen (Debtors) - Those in debt who cannot repay\n\n7. Fi Sabilillah (In the Path of Allah) - Those striving for Allah's cause\n\n8. Ibn as-Sabil (Travelers) - Stranded travelers in need of assistance\n\nImportant Notes:\n• Zakat cannot be given to parents, grandparents, children, or spouse\n• It must be given to Muslims (with rare exceptions)\n• Recipients should not be from the family of Prophet Muhammad ﷺ",
        "content_ur": "قرآن نے خاص طور پر آٹھ قسم کے لوگوں کا ذکر کیا ہے جو زکوٰۃ وصول کرنے کے اہل ہیں (سورہ التوبہ 9:60):\n\n1. فقراء - وہ جن کی آمدنی بہت کم ہے یا معاش کا کوئی ذریعہ نہیں\n\n2. مساکین - وہ جن کی آمدنی بنیادی ضروریات کو پورا نہیں کرتی\n\n3. عاملین - وہ جو زکوٰۃ جمع اور تقسیم کرنے کے لیے ملازم ہیں\n\n4. مؤلفۃ القلوب - نئے مسلمان جن کے دل اسلام سے مانوس ہو رہے ہیں\n\n5. رقاب - وہ جو غلامی یا قید میں ہیں\n\n6. غارمین - وہ جو قرض میں ہیں اور واپس نہیں کر سکتے\n\n7. فی سبیل اللہ - وہ جو اللہ کی راہ میں کوشش کر رہے ہیں\n\n8. ابن السبیل - پھنسے ہوئے مسافر جنہیں مدد کی ضرورت ہے\n\nاہم نوٹس:\n• زکوٰۃ والدین، دادا دادی، بچوں، یا شریک حیات کو نہیں دی جا سکتی\n• یہ مسلمانوں کو دی جانی چاہیے (نادر استثناء کے ساتھ)\n• وصول کنندگان نبی محمد ﷺ کے خاندان سے نہیں ہونے چاہیے"
      },
      {
        "heading_en": "Wisdom and Benefits of Zakat",
        "heading_ur": "زکوٰۃ کی حکمت اور فوائد",
        "content_en": "Zakat serves multiple purposes in Islam:\n\nSpiritual Benefits:\n• Purifies the soul from greed and miserliness\n• Increases faith and brings one closer to Allah\n• Earns immense rewards in the Hereafter\n• Protects from calamities and Allah's punishment\n• Develops compassion and empathy\n\nSocial Benefits:\n• Reduces poverty and inequality\n• Creates social solidarity and cohesion\n• Bridges the gap between rich and poor\n• Prevents concentration of wealth\n• Ensures basic needs are met for all\n\nEconomic Benefits:\n• Circulates wealth in society\n• Encourages productive use of resources\n• Prevents hoarding of wealth\n• Stimulates economic growth\n• Provides safety net for vulnerable\n\nThe Prophet Muhammad ﷺ said: 'Charity does not decrease wealth.' (Muslim)\n\nAllah says in the Qur'an: 'And establish prayer and give Zakat, and whatever good you put forward for yourselves - you will find it with Allah.' (Qur'an 2:110)",
        "content_ur": "زکوٰۃ اسلام میں متعدد مقاصد پورے کرتی ہے:\n\nروحانی فوائد:\n• روح کو لالچ اور بخل سے پاک کرتی ہے\n• ایمان میں اضافہ اور اللہ سے قریب کرتی ہے\n• آخرت میں بے شمار اجر کماتی ہے\n• مصیبتوں اور اللہ کے عذاب سے بچاتی ہے\n• ہمدردی اور رحمدلی پیدا کرتی ہے\n\nسماجی فوائد:\n• غربت اور عدم مساوات کو کم کرتی ہے\n• سماجی یکجہتی اور اتحاد پیدا کرتی ہے\n• امیر اور غریب کے درمیان فاصلہ پاٹتی ہے\n• دولت کے ارتکاز کو روکتی ہے\n• سب کے لیے بنیادی ضروریات کو یقینی بناتی ہے\n\nاقتصادی فوائد:\n• معاشرے میں دولت کو گردش دیتی ہے\n• وسائل کے پیداواری استعمال کی حوصلہ افزائی کرتی ہے\n• دولت کے ذخیرہ اندوزی کو روکتی ہے\n• اقتصادی ترقی کو فروغ دیتی ہے\n• کمزور طبقے کے لیے حفاظتی جال فراہم کرتی ہے\n\nنبی محمد ﷺ نے فرمایا: 'صدقہ مال کو کم نہیں کرتا۔' (مسلم)\n\nاللہ قرآن میں فرماتا ہے: 'اور نماز قائم کرو اور زکوٰۃ دو، اور جو بھلائی تم اپنے لیے آگے بھیجو گے، اسے اللہ کے پاس پاؤ گے۔' (قرآن 2:110)"
      }
    ]
  },
  {
    "id": 4,
    "title_en": "Sawm",
    "title_ur": "روزہ",
    "title_ar": "الصَّوْم",
    "subtitle_en": "Fasting in Ramadan",
    "subtitle_ur": "رمضان کا روزہ",
    "icon": "moon-waning-crescent",
    "description_en": "Sawm (fasting) is the fourth pillar of Islam, referring specifically to fasting during the holy month of Ramadan. Muslims abstain from food, drink, and other physical needs from dawn until sunset, focusing on spiritual growth and self-discipline.",
    "description_ur": "روزہ اسلام کا چوتھا رکن ہے، جو خاص طور پر مقدس ماہ رمضان کے روزے کا حوالہ دیتا ہے۔ مسلمان فجر سے غروب آفتاب تک کھانے، پینے اور دیگر جسمانی ضروریات سے پرہیز کرتے ہیں، روحانی ترقی اور خود نظم و ضبط پر توجہ مرکوز کرتے ہیں۔",
    "sections": [
      {
        "heading_en": "The Significance of Ramadan",
        "heading_ur": "رمضان کی اہمیت",
        "content_en": "Ramadan is the ninth month of the Islamic lunar calendar and holds special significance:\n\n• The month in which the Qur'an was first revealed to Prophet Muhammad ﷺ\n• The Night of Power (Laylatul Qadr) occurs in the last ten nights, worth more than a thousand months\n• Gates of Paradise are opened, gates of Hell are closed\n• Devils are chained, making it easier to do good deeds\n• A month of forgiveness, mercy, and salvation from Hellfire\n\nAllah says: 'O you who believe! Fasting is prescribed for you as it was prescribed for those before you, that you may become righteous.' (Qur'an 2:183)\n\nThe Prophet ﷺ said: 'When Ramadan begins, the gates of Paradise are opened, the gates of Hell are closed, and the devils are chained.' (Bukhari & Muslim)",
        "content_ur": "رمضان اسلامی قمری کیلنڈر کا نواں مہینہ ہے اور خاص اہمیت رکھتا ہے:\n\n• وہ مہینہ جس میں قرآن پہلی بار نبی محمد ﷺ پر نازل ہوا\n• شب قدر آخری دس راتوں میں ہوتی ہے، جو ہزار مہینوں سے بہتر ہے\n• جنت کے دروازے کھل جاتے ہیں، جہنم کے دروازے بند ہو جاتے ہیں\n• شیطانوں کو زنجیروں میں جکڑ دیا جاتا ہے، جس سے نیک کام کرنا آسان ہو جاتا ہے\n• بخشش، رحمت، اور جہنم سے نجات کا مہینہ\n\nاللہ فرماتا ہے: 'اے ایمان والو! تم پر روزے فرض کیے گئے ہیں جیسے تم سے پہلے لوگوں پر فرض کیے گئے تھے، تاکہ تم تقویٰ اختیار کرو۔' (قرآن 2:183)\n\nنبی ﷺ نے فرمایا: 'جب رمضان شروع ہوتا ہے، تو جنت کے دروازے کھول دیے جاتے ہیں، جہنم کے دروازے بند کر دیے جاتے ہیں، اور شیاطین کو زنجیروں میں جکڑ دیا جاتا ہے۔' (بخاری اور مسلم)"
      },
      {
        "heading_en": "Rules and Requirements of Fasting",
        "heading_ur": "روزے کے قوانین اور ضروریات",
        "content_en": "Who Must Fast:\n• Every adult Muslim (reached puberty)\n• Who is mentally sound\n• Who is physically able\n• Who is not traveling\n• Women who are not menstruating or in postpartum period\n\nExemptions:\n• Children (not yet reached puberty)\n• Elderly who cannot fast\n• Sick people (temporary exemption)\n• Travelers on long journeys\n• Pregnant or nursing women if fasting harms them or baby\n• Menstruating women (must make up later)\n\nWhat Breaks the Fast:\n• Eating or drinking intentionally\n• Sexual intercourse\n• Deliberately inducing vomiting\n• Menstruation or postpartum bleeding\n\nWhat Doesn't Break the Fast:\n• Unintentional eating/drinking (forgetting)\n• Swallowing saliva\n• Using miswak or toothbrush\n• Taking a bath or shower\n• Applying kohl or eye drops\n• Receiving injections (non-nutritive)\n\nDaily Routine:\n• Suhoor - Pre-dawn meal (highly recommended)\n• Fasting from dawn (Fajr) to sunset (Maghrib)\n• Iftar - Breaking fast at sunset, preferably with dates\n• Taraweeh - Special night prayers during Ramadan",
        "content_ur": "روزہ کس پر فرض ہے:\n• ہر بالغ مسلمان (بلوغت تک پہنچ گیا)\n• جو ذہنی طور پر تندرست ہو\n• جو جسمانی طور پر قابل ہو\n• جو سفر میں نہ ہو\n• عورتیں جو حیض یا نفاس میں نہ ہوں\n\nاستثنیٰ:\n• بچے (ابھی بلوغت تک نہیں پہنچے)\n• بوڑھے جو روزہ نہیں رکھ سکتے\n• بیمار لوگ (عارضی استثنیٰ)\n• لمبے سفر پر مسافر\n• حاملہ یا دودھ پلانے والی خواتین اگر روزہ انہیں یا بچے کو نقصان پہنچائے\n• حیض والی خواتین (بعد میں قضا کرنی ہوگی)\n\nروزہ کیا توڑتا ہے:\n• جان بوجھ کر کھانا یا پینا\n• جنسی تعلق\n• جان بوجھ کر قے کرنا\n• حیض یا نفاس کا خون\n\nروزہ کیا نہیں توڑتا:\n• غیر ارادی کھانا/پینا (بھول جانا)\n• لعاب نگلنا\n• مسواک یا ٹوتھ برش استعمال کرنا\n• نہانا یا شاور کرنا\n• سرمہ یا آنکھوں کے قطرے لگانا\n• انجیکشن لگانا (غیر غذائی)\n\nیومیہ معمول:\n• سحری - فجر سے پہلے کھانا (بہت سفارش کی گئی)\n• فجر سے غروب آفتاب (مغرب) تک روزہ\n• افطار - غروب آفتاب پر روزہ کھولنا، ترجیحاً کھجوروں سے\n• تراویح - رمضان کے دوران خصوصی رات کی نمازیں"
      },
      {
        "heading_en": "Spiritual Dimensions of Fasting",
        "heading_ur": "روزے کے روحانی پہلو",
        "content_en": "Fasting in Islam is not merely abstaining from food and drink; it encompasses comprehensive spiritual development:\n\nPhysical Fasting:\n• Abstaining from food, drink, and physical needs\n• Controlling bodily desires and impulses\n• Developing self-discipline and willpower\n\nSpiritual Fasting:\n• Avoiding gossip, lying, and backbiting\n• Controlling anger and negative emotions\n• Increasing prayers and Qur'an recitation\n• Making extra supplications and seeking forgiveness\n• Giving charity and helping others\n\nBenefits of Fasting:\n\nSpiritual:\n• Increases God-consciousness (Taqwa)\n• Strengthens faith and devotion\n• Purifies the soul from sins\n• Develops empathy for the less fortunate\n• Brings one closer to Allah\n\nPhysical:\n• Detoxification of the body\n• Improved metabolic health\n• Weight management\n• Better digestive system function\n• Increased energy and mental clarity\n\nSocial:\n• Unity of Muslim community (Ummah)\n• Equality - rich and poor fast together\n• Increased charity and generosity\n• Stronger family bonds through shared meals\n\nThe Prophet ﷺ said: 'Whoever fasts Ramadan with faith and seeking reward, his previous sins will be forgiven.' (Bukhari & Muslim)",
        "content_ur": "اسلام میں روزہ محض کھانے پینے سے پرہیز نہیں ہے؛ یہ جامع روحانی ترقی پر مشتمل ہے:\n\nجسمانی روزہ:\n• کھانے، پینے، اور جسمانی ضروریات سے پرہیز\n• جسمانی خواہشات اور جذبات کو قابو کرنا\n• خود نظم و ضبط اور قوت ارادی کو فروغ دینا\n\nروحانی روزہ:\n• غیبت، جھوٹ، اور چغلی سے بچنا\n• غصے اور منفی جذبات کو قابو کرنا\n• نمازوں اور قرآن کی تلاوت میں اضافہ\n• اضافی دعائیں کرنا اور بخشش طلب کرنا\n• خیرات دینا اور دوسروں کی مدد کرنا\n\nروزے کے فوائد:\n\nروحانی:\n• تقویٰ میں اضافہ\n• ایمان اور عقیدت کو مضبوط کرنا\n• گناہوں سے روح کو پاک کرنا\n• کم قسمت لوگوں کے لیے ہمدردی پیدا کرنا\n• اللہ سے قریب لانا\n\nجسمانی:\n• جسم کی صفائی\n• میٹابولک صحت میں بہتری\n• وزن کا انتظام\n• بہتر نظام ہاضمہ\n• توانائی اور ذہنی وضاحت میں اضافہ\n\nسماجی:\n• مسلم کمیونٹی (امت) کی یکجہتی\n• برابری - امیر اور غریب اکٹھے روزہ رکھتے ہیں\n• خیرات اور سخاوت میں اضافہ\n• مشترکہ کھانے کے ذریعے مضبوط خاندانی بندھن\n\nنبی ﷺ نے فرمایا: 'جس نے ایمان اور ثواب کی امید کے ساتھ رمضان کا روزہ رکھا، اس کے پچھلے گناہ معاف کر دیے جائیں گے۔' (بخاری اور مسلم)"
      }
    ]
  },
  {
    "id": 5,
    "title_en": "Hajj",
    "title_ur": "حج",
    "title_ar": "الْحَجّ",
    "subtitle_en": "Pilgrimage to Makkah",
    "subtitle_ur": "مکہ کی زیارت",
    "icon": "kaaba",
    "description_en": "Hajj is the fifth pillar of Islam, the annual pilgrimage to Makkah that every Muslim must undertake at least once in their lifetime if they are physically and financially able. It is performed during the Islamic month of Dhul-Hijjah.",
    "description_ur": "حج اسلام کا پانچواں رکن ہے، مکہ کی سالانہ زیارت جو ہر مسلمان کو اپنی زندگی میں کم از کم ایک بار کرنی چاہیے اگر وہ جسمانی اور مالی طور پر قابل ہو۔ یہ اسلامی مہینے ذوالحجہ میں ادا کیا جاتا ہے۔",
    "sections": [
      {
        "heading_en": "Obligation and Conditions",
        "heading_ur": "فرضیت اور شرائط",
        "content_en": "Hajj becomes obligatory when five conditions are met:\n\n1. Islam - Must be a Muslim\n2. Maturity - Must have reached puberty (adult)\n3. Sanity - Must be of sound mind\n4. Freedom - Must not be enslaved or imprisoned\n5. Capability (Istita'ah) - Must have:\n   • Financial means for journey and stay\n   • Physical ability to perform rituals\n   • Safe route to Makkah\n   • Provision for dependents during absence\n   • For women: Mahram (male guardian) to accompany\n\nAllah says in the Qur'an: 'Pilgrimage to the House is a duty owed to Allah by people who are able to undertake it.' (Qur'an 3:97)\n\nThe Prophet ﷺ said: 'Whoever performs Hajj for the sake of Allah and does not commit any obscenity or transgression will return as pure as the day his mother gave birth to him.' (Bukhari & Muslim)\n\nTypes of Hajj:\n1. Hajj al-Ifrad - Hajj only\n2. Hajj al-Qiran - Hajj and Umrah together\n3. Hajj al-Tamattu - Umrah first, then Hajj (most common)",
        "content_ur": "حج اس وقت فرض ہو جاتا ہے جب پانچ شرائط پوری ہوں:\n\n1. اسلام - مسلمان ہونا چاہیے\n2. بلوغت - بالغ ہونا چاہیے\n3. عقل - صحیح دماغ کا ہونا چاہیے\n4. آزادی - غلام یا قیدی نہیں ہونا چاہیے\n5. استطاعت - ہونا چاہیے:\n   • سفر اور قیام کے لیے مالی وسائل\n   • رسومات ادا کرنے کی جسمانی صلاحیت\n   • مکہ کا محفوظ راستہ\n   • غیر موجودگی کے دوران انحصار کرنے والوں کی فراہمی\n   • خواتین کے لیے: ساتھ جانے کے لیے محرم (مرد سرپرست)\n\nاللہ قرآن میں فرماتا ہے: 'اور اللہ کے لیے لوگوں پر بیت اللہ کا حج فرض ہے جو اس کی استطاعت رکھتے ہیں۔' (قرآن 3:97)\n\nنبی ﷺ نے فرمایا: 'جس نے اللہ کی رضا کے لیے حج کیا اور کوئی فحش یا گناہ نہیں کیا، وہ اس دن کی طرح پاک ہو کر لوٹے گا جس دن اس کی ماں نے اسے جنم دیا تھا۔' (بخاری اور مسلم)\n\nحج کی اقسام:\n1. حج افراد - صرف حج\n2. حج قران - حج اور عمرہ ایک ساتھ\n3. حج تمتع - پہلے عمرہ، پھر حج (سب سے عام)"
      },
      {
        "heading_en": "The Rituals of Hajj",
        "heading_ur": "حج کے مناسک",
        "content_en": "Hajj consists of several sacred rituals performed over 5-6 days:\n\n8th Dhul-Hijjah (Yawm at-Tarwiyah - Day of Reflection):\n• Enter state of Ihram (sacred state)\n• Make intention for Hajj\n• Recite Talbiyah: 'Labbayk Allahumma Labbayk...'\n• Travel to Mina\n• Pray Dhuhr, Asr, Maghrib, Isha and Fajr there\n\n9th Dhul-Hijjah (Yawm Arafah - Day of Arafah):\n• Most important day of Hajj\n• Stand at Mount Arafat from noon until sunset\n• Make abundant supplications and seek forgiveness\n• Pray Dhuhr and Asr combined and shortened\n• Prophet ﷺ said: 'Hajj is Arafah'\n\n10th Dhul-Hijjah (Yawm an-Nahr - Day of Sacrifice):\n• Travel to Muzdalifah after sunset\n• Collect pebbles for stoning\n• Pray Maghrib and Isha combined\n• Return to Mina before dawn\n• Stone Jamarah al-Aqabah (largest pillar)\n• Offer sacrifice (animal)\n• Shave or trim hair (men shave, women trim)\n• Perform Tawaf al-Ifadah around Ka'bah\n• Perform Sa'i between Safa and Marwah\n\n11th-13th Dhul-Hijjah (Days of Tashriq):\n• Stay in Mina\n• Stone all three Jamarat (pillars) daily\n• Make supplications\n• Can leave on 12th or 13th\n\nFarewell Tawaf:\n• Perform final Tawaf around Ka'bah before leaving Makkah\n• Make final prayers and supplications",
        "content_ur": "حج کئی مقدس رسومات پر مشتمل ہے جو 5-6 دنوں میں ادا کی جاتی ہیں:\n\n8 ذوالحجہ (یوم الترویہ - غور و فکر کا دن):\n• احرام کی حالت میں داخل ہوں\n• حج کی نیت کریں\n• تلبیہ پڑھیں: 'لبیک اللہم لبیک...'\n• منیٰ جائیں\n• وہاں ظہر، عصر، مغرب، عشاء اور فجر پڑھیں\n\n9 ذوالحجہ (یوم عرفہ - عرفہ کا دن):\n• حج کا سب سے اہم دن\n• دوپہر سے غروب آفتاب تک عرفات پر وقوف\n• بہت زیادہ دعائیں کریں اور بخشش مانگیں\n• ظہر اور عصر ملا کر اور مختصر پڑھیں\n• نبی ﷺ نے فرمایا: 'حج عرفہ ہے'\n\n10 ذوالحجہ (یوم النحر - قربانی کا دن):\n• غروب آفتاب کے بعد مزدلفہ جائیں\n• رمی کے لیے کنکریاں جمع کریں\n• مغرب اور عشاء ملا کر پڑھیں\n• فجر سے پہلے منیٰ واپس آئیں\n• جمرہ عقبہ (سب سے بڑے ستون) کو رمی کریں\n• قربانی (جانور) پیش کریں\n• سر منڈوائیں یا بال کتروائیں (مرد منڈواتے ہیں، عورتیں کترواتی ہیں)\n• کعبہ کے گرد طواف افاضہ کریں\n• صفا اور مروہ کے درمیان سعی کریں\n\n11-13 ذوالحجہ (ایام تشریق):\n• منیٰ میں قیام کریں\n• تینوں جمرات کو روزانہ رمی کریں\n• دعائیں کریں\n• 12 یا 13 کو جا سکتے ہیں\n\nطواف وداع:\n• مکہ چھوڑنے سے پہلے کعبہ کے گرد آخری طواف کریں\n• آخری نمازیں اور دعائیں کریں"
      },
      {
        "heading_en": "Spiritual Significance and Benefits",
        "heading_ur": "روحانی اہمیت اور فوائد",
        "content_en": "Hajj is a profound spiritual journey with immense benefits:\n\nSpiritual Transformation:\n• Complete forgiveness of sins when performed properly\n• Spiritual rebirth and renewal of faith\n• Direct connection with Prophet Ibrahim's legacy\n• Following in the footsteps of prophets\n• Experience of complete submission to Allah\n\nLessons from Hajj:\n\n1. Equality - All pilgrims wear simple white clothes (Ihram), removing distinctions of wealth, status, race, or nationality. Everyone is equal before Allah.\n\n2. Unity - Millions of Muslims from around the world gather for one purpose, demonstrating the unity of the Muslim Ummah.\n\n3. Patience and Perseverance - The physical challenges test one's endurance and commitment to Allah.\n\n4. Sacrifice - Commemorating Prophet Ibrahim's willingness to sacrifice his son, teaching us to sacrifice our desires for Allah's pleasure.\n\n5. Humility - The rituals remind us of our humble position before Allah and our need for His mercy.\n\n6. Purification - Both physical (cleanliness) and spiritual (from sins and bad habits).\n\n7. Gratitude - Appreciation for the blessings of health, wealth, and the ability to perform Hajj.\n\nSymbolic Meanings:\n• Tawaf (circling Ka'bah) - Our life should revolve around worshipping Allah\n• Sa'i (walking between hills) - Remembering Hajar's search for water teaches trust in Allah\n• Standing at Arafat - Reminds us of the Day of Judgment\n• Stoning pillars - Rejecting Satan and evil\n• Sacrifice - Willingness to give up worldly attachments\n\nThe Prophet ﷺ said: 'An accepted Hajj has no reward except Paradise.' (Bukhari & Muslim)",
        "content_ur": "حج ایک گہرا روحانی سفر ہے جس کے بے شمار فوائد ہیں:\n\nروحانی تبدیلی:\n• صحیح طریقے سے ادا کرنے پر گناہوں کی مکمل بخشش\n• روحانی دوبارہ پیدائش اور ایمان کی تجدید\n• حضرت ابراہیم کی میراث سے براہ راست تعلق\n• انبیاء کے نقش قدم پر چلنا\n• اللہ کے سامنے مکمل تسلیم ہونے کا تجربہ\n\nحج سے سبق:\n\n1. برابری - تمام حجاج سادہ سفید کپڑے (احرام) پہنتے ہیں، دولت، حیثیت، نسل، یا قومیت کے فرق کو ختم کرتے ہیں۔ سب اللہ کے سامنے برابر ہیں۔\n\n2. اتحاد - دنیا بھر سے لاکھوں مسلمان ایک مقصد کے لیے جمع ہوتے ہیں، مسلم امت کی وحدت کا مظاہرہ کرتے ہیں۔\n\n3. صبر اور استقامت - جسمانی چیلنجز کسی کی برداشت اور اللہ کے ساتھ عزم کو آزماتے ہیں۔\n\n4. قربانی - حضرت ابراہیم کی اپنے بیٹے کو قربان کرنے کی رضامندی کی یاد، ہمیں سکھاتی ہے کہ اللہ کی خوشنودی کے لیے اپنی خواہشات کو قربان کریں۔\n\n5. عاجزی - رسومات ہمیں اللہ کے سامنے اپنی عاجز پوزیشن اور اس کی رحمت کی ضرورت کی یاد دلاتی ہیں۔\n\n6. پاکیزگی - جسمانی (صفائی) اور روحانی (گناہوں اور بری عادتوں سے) دونوں۔\n\n7. شکرگزاری - صحت، دولت، اور حج کرنے کی صلاحیت کی نعمتوں کی تعریف۔\n\nعلامتی معانی:\n• طواف (کعبہ کے گرد چکر) - ہماری زندگی اللہ کی عبادت کے گرد گھومنی چاہیے\n• سعی (پہاڑیوں کے درمیان چلنا) - حاجرہ کی پانی کی تلاش اللہ پر بھروسہ سکھاتی ہے\n• عرفات پر وقوف - روز قیامت کی یاد دلاتا ہے\n• رمی (ستونوں کو کنکری مارنا) - شیطان اور برائی کو مسترد کرنا\n• قربانی - دنیاوی لگاؤ کو ترک کرنے کی رضامندی\n\nنبی ﷺ نے فرمایا: 'مقبول حج کا بدلہ جنت کے سوا کچھ نہیں۔' (بخاری اور مسلم)"
      }
    ]
  }
]
